{
  "help-with-addisons-medical-journey": {
    "slug": "help-with-addisons-medical-journey",
    "name": "Addison",
    "age": 0,
    "gender": "female",
    "disease": "ALCAPA (Anomalous Left Coronary Artery from the Pulmonary Artery)",
    "raised": 5086,
    "goal": 15000,
    "url": "https://www.gofundme.com/f/help-with-addisons-medical-journey",
    "title": "Help with Addisons medical journey",
    "description": "I created this go fund me to take time off to care for my 8 week old while in the ICU and help with expenses(medical, food, travel, etc.) while away from work. Thank you for taking the time to read about her. Addisons storyThe biggest fear of our lives happened to our 8 week old baby on Saturday 4/17/21. Addison was having chest retractions and not breathing well. We took her to Mott children’s hospital and we were hoping for the best RSV or respiratory infection, after her first X-ray we knew something was wrong. It showed she had an enlarged heart, her heart was taking up most of the room in her chest cavity to where she couldn’t breathe well. After an echo of her heart we discovered she had a rare congenital heart defect called ALCAPA. 1 in 300000 have the same defect as her. Her coronary artery attached to her pulmonary artery instead of the aorta. This required emergency open heart surgery. She had her surgery on 4/19/21. This was a shock and unexpected health issue with our baby girl. This is still a long journey ahead for her. I know times have been difficult for many of us but we would greatly appreciate any donation. NO amount is too small. EVERY LITTTLE PENNY ADDS UP.",
    "creationDate": "2021-04-23",
    "images": [
      "56315606_1619202152382463_r.jpeg",
      "56315606_1621785566170848_r.jpg",
      "56315606_1619541502601191_r.jpg"
    ],
    "numDonationsStr": "59 donations"
  },
  "baby-annabelles-medical-fund": {
    "slug": "baby-annabelles-medical-fund",
    "name": "Annabelle",
    "age": 0,
    "gender": "female",
    "disease": "Kagami Ogata Syndrome (Chromosome 14 deletion), pneumonia, pleural effusion, alpha Thalassemia",
    "raised": 4235,
    "goal": 5000,
    "url": "https://www.gofundme.com/f/baby-annabelles-medical-fund",
    "title": "Baby Annabelle's Medical Fund",
    "description": "In light of recent events, I’ve decided to create a place for those who have been touched by sweet Annabelle, to read about her progress as well as a place where her parents can accept monetary donations in efforts to relieve some of their financial burdens. I want to first say on behalf of our entire extended family, how grateful we are for all who have kept Annabelle in their thoughts, well wishes, and offered to help in anyway. From a simple call, to meals, to places to stay that are closer to the hospital and medical advice, and so much more. It has not gone unnoticed. Annabelle is so loved. Annabelle is my niece and there is nothing I adore more than her sassy looks, sweet chubby cheeks and even her fascination with pulling my hair. She has so much personality and life within her, and has already been through so much more adversity than any child should be expected to endure.On May 23, 2017, we were overjoyed with the sweet gift of Annabelle, though did not join us without difficulties. After a few labor complications, she was quickly swept away by doctors before Mama Bekah and Dad, Jack, could hold her. For days, Annabelle was weak, swollen, and could not breathe or eat unsupervised and assisted. Despite countless doctors and nurses opinions, we still had no definitive answers. Eventually, Annabelle was transferred and admitted to  a more permanent home at Texas Childrens Hospital NICU in downtown Houston. Annabelle didn’t get to come home like every other little girl, her parents would have welcomed sleepless nights caused by late night feedings and diaper changes. Instead, they spent nights up wondering who could help their baby finally find relief, and help them find answers.Annabelle spent the following weeks on oxygen and eating through a feeding tube. She underwent numerous painful testing campaigns, studies, x-rays, and scans. Doctors, nurses, and specialists worked tirelessly, night and day to try to find out how to help Annabelle. We are forever grateful to those doctors and specialists, nurses, and all the staff at Texas Children’s. Thank you, every day for what you do for families like ours.Jack and Bekah were with Annabelle every day holding onto any glimmer of hope they could...Trying to be strong for their baby girl, and trying to be strong for each other. Even though it seemed as if life stopped, the expenses piled up...their jobs and paychecks took a back seat to their daughter. Jack lost his job and Bekah is compensated on an hourly basis. Medical bills, parking, gas bills, as well as regular bills like rent, insurance, and utilities, were all adding up..the bank account was struggling to stay afloat, even with both families help.Finally, there was a dim light at the end of the tunnel. We started to see some progress with our little fighter. Doctors told us they had discovered that Annabelle was missing part of her Chromosome 14. Features that often occur in people with this deletion include developmental delay, intellectual disability, behavioral problems and organ problems. Her deletion causes a disorder called Kagami Ogata Syndrome. There is no long-term data as this syndrome is so new and so rare. (  I beleive there have been less than 60 cases medically reported worldwide as of 2015). While Annabelle seemed to be on the better end of this diagnosis, we did not know if she would be able to walk, talk, stand, or eat orally without assistance. One thing we did know, is it would be a long road together.Once the G-tube surgery was complete and Annabelle grew a bit stronger, her parents were finally able to take her home to their apartment in Katy. Annabelle was finally home.Mom and Dad tried to get back on track. Jack continued to work on his graphic design jobs while Bekah went back to work but catching up proved to be more overwhelming than they could handle alone. While they worked hard to cut costs, like moving in with Jacks (my) parents and selling one of their cars, it just wasn’t enough to cover everything with the enormous medical bills flooding in. After all of these trials and tribulations, they lost their only vehicle in hurricane Harvey. It seemed like even Mother Nature was not on their side.Fast forward: On Thanksgiving, we celebrated Annabelle's 6 month birthday and reflected on how far she had come. We were so proud of her progress.Just a few short days later, Annabelle was rushed to the ER. Immediately upon evaluation, she was put on monitors due to her heavy labored breathing, and X-rays were taken. It all lead to the diagnosis of severe pneumonia. She was put on high flow oxygen, as her blood saturations were in the low 80s, and that did nothing, so we then moved up to a cpap machine, she held up fairly well on that from about 1 am in the morning till 5 am. She was admitted into the Texas children Pediatric ICU. Annabelle started panicking with the cpap on her face and started desaturation into the low 60s (her usual levels are at 100) and they made the decision to intubate her. Her second Xrays showed the pneumonia getting worse. Now with the intubation she is on a ventilator and is sedated. She’s so sick and weak..but she is the such a strong little girl. While her selfless parents have chosen to stay by their baby's side at the hospital, there are still bills piling up. Bekah even missed a job interview that would have provided better benefits. (we all know insurance helps soften the blow, but it does not leave you debt free) There will be so many unanswered questions for the rest of her life. We understand there are so many people in need, but if you feel you are led to donate or share Annabelle’s story, please do.  This will go to help Annabelle and her loving parents for the past, present and any future needs. I will be sure these funds go directly to bills associated with Annabelles medical needs.Update as of 4:45 pm 11/28/17 - from BekahToday they did an xray and found that her pneumonia inside her lungs had gotten better, however the pleural effusion (fluid outside the lungs) had gotten worse and the air between her lungs and chest worse as well. Almost 2 hours ago they inserted a chest tube to drain the fluid and air, and did a pic line in her femeral vein to help administer her medications. There is talk of a possible blood transfusion with her hemoglobin levels being so low, and we just had a echo which Thankfully showed that her heart is healthy. She has had some bradychardia (heart rate dropping) which they are attributing to the fentynol drip and the ventilator tube.  11/30 UPDATE from Bekah : today things have taken a bit of a turn for the worse. The infection in her lungs (which had previously gotten better), has come back in full force and worse. Additionally it has spread to her whole body now. Her hemoglobin count is worse again today, and we are still waiting on the hemotologist to come by and discuss our options, and the labs to come back that they sent this morning. (on top of all of this she has alpha Thalassemia) The pleural effusion is still draining through her chest tube, which is good. She started today with the opposite of a fever, 95 degrees which is not good either. So they did everything possible to get her temp back up to normal numbers. Also they have started ipv interventions which is basically them trying to break up the disease in her lungs to make it come out easier. Little bug is all swollen and puffy from all the fluids they're pumping into her12/1 Update: The fluid output from her chest tube changed to a cloudy/heavier substance. Samples have been sent up to the lab and they beleive it is chylous fluid ( basically lipd and at thats not breaking down in her stomach and it is going into her plearal effusion) so they cannot feed her milk anymore. Hemotologist just came and explained we need to do a blood transfusion asap. Her hemoglobin counts are at 6.3 and they usually start transfusion for anyone lower than 8. This can come with some complications but the Dr has assuerd as that this is a much safer process than it used to be.Doctors and pedi surgeons are keeping an eye on her abdomen as it is distended, but say for now her stomach feels soft enough to not take any further action.Her lungs are breathing over the machines now and the end goal is to get her off the ventilators so her lungs dont start to get lazy and forget what their job is.They are aso weaning her off of the sedation and pain medicine as babies bodies can start to become addicted very quickly. All will keep an eye on any withdrawel symtoms. 12/4 Update: Wide awake and wiggling for mommy and daddy today. It seems little miss has gotten a little too used to her sedation meds so they don't work for her as well anymore. Annabelles body is currently fighting off two pretty severe infections which they believe is the root of everything going on with her. Ecoli, Staph, and Strep. We are still hanging out on the ventilator, and her chest tube is still training copius amounts of viscous fluid, but her hemoglobin levels have been above her goal, since her blood transfusion, so YAY FOR THAT. Baby steps. We still have a long way to go here at TCH, they're thinking 3 weeks maybe more now . Today we are just thankful to spend the next 3 days here with her without having to leave.12/12 update: Annabelle is finally stable and extubated, and her chest tube is out. They have removed her 2 pivs and are using only her tunneled PIC line for her medications and her sedations. Little miss is not taking well to being weaned off her sedation from when she was intubated, not only is she still on low doses of her \"before\" medications, she is on HERIOC amounts of methadone, and Ativan to help ease her withdrawal. We are on Hi...gh flow oxygen still, and having a bit of a time weaning her off of that, and still on the heavy duty antibiotics for her 3 infections. She is now trying 5 MLS of milk to test her and see how her tummy handles it, while still getting iv lipids and tpn to make sure she gets her nutrition. Slow and steady recovery will win the race. Thank you for your continued prayers and concerns. All we want for Christmas is our baby home with us.12/15 Update: My heart is heavy. This is not the update I wanted to give.. Things have been looking up for the past week and we were finally feeling some relief and seeing the light at the end of the tunnel. Last night after work I stayed up with my sweet angel holding her and snuggling to about 4 am, she had gone down to 7 liters of oxygen and they were planning on weaning her down to a normal cannula and 4 liters. At 10 am they had to bump her up to 15 liters on her high fl...ow because she was coughing and retching (most likely from the withdrawal she is experiencing, and the fact they took her off IV methadone, Ativan, and clonodine, and switched her to PO versions of the drugs - meaning it was going into her g tube, and that means she was getting less of the drugs). Her nurse decided it would be good to give Annabelle tummy time (even though she was already retching and vomiting), and the vomiting got worse, I asked her to put her back on her back to calm things down, then pt, ot, and speech therapy came in 5 minutes later to asses her and play with her, as she was already feeling bad, things deteriorated VERY quickly with her being messed with, she started vomiting more and aspirating her vomit. Within 10 minutes they made the decision to intubate her again, she was desatting in the low 60s and it was necessary at that point. They ran rsv and flu tests and a full winter panel, all which have come back negative THANK GOD, did xray of her lungs and the pneumonia was better, there was some lung collapse however. Currently we are discussing different options with doctors on how to proceed with her lungs weak as they are and the aspirating problem. Thank you for your continued prayers and concerns. All we want is for her to be better. I just wanna hear her sweet voice and hold her in my arms again, things change so quickly in just 24 hours...Feel free to call, email or text me with any thoughts.",
    "creationDate": "2017-11-27",
    "images": [
      "25706064_1511849708.879.jpg",
      "25706064_1512162864.9157_funddescription.jpg",
      "25706064_1512162910.0934_funddescription.jpg",
      "25706064_1512163002.5245_funddescription.jpg",
      "25706064_1512162950.2628_funddescription.jpg",
      "25706064_1512162983.9921_funddescription.jpg",
      "25706064_1512163269.4665_funddescription.jpg",
      "25706064_1512163060.8555_funddescription.jpg",
      "25706064_1512163129.7375_funddescription.jpg",
      "25706064_1512163168.9725_funddescription.jpg",
      "25706064_1511842212.0291_funddescription.jpg",
      "25706064_1511842875.8246_funddescription.jpg",
      "25706064_1512151560.1945_funddescription.jpg"
    ],
    "numDonationsStr": "71 donations"
  },
  "help-corey-pay-for-his-newborns-medical-bills": {
    "slug": "help-corey-pay-for-his-newborns-medical-bills",
    "name": "Archie Bennett",
    "age": 0,
    "gender": "male",
    "disease": "cardiac arrest with resulting brain damage and respiratory failure",
    "raised": 2376,
    "goal": 15000,
    "url": "https://www.gofundme.com/f/help-corey-pay-for-his-newborns-medical-bills",
    "title": "Help Corey pay for his newborns medical bills",
    "description": "Corey Bennett is an amazing employee and Father of 2 kids. He works long days to provide for his family. On October 25th, Archie, his third child was born. On Tuesday December 14th 2021, the unthinkable happened and Corey found himself doing what no Father should ever have to do in there life. While waiting on the ambulance to arrive Corey was performing CPR on his 7 week old son desperately trying to save his life. He was rushed to the hospital not breathing and no heartbeat. Once at the hospital they got a heart beat back however, baby Archie still could not breathe on his own. He was Taken by helicopter to Chattanooga Children’s Hostpital where he is currently on life support. The doctors are doing everything they can. At this point, the doctors are not very optimistic. Little Archie has little to no brain activity, and he can not breathe on his own at this time. All we have to cling to is hope….with such a tragic situation going on and all the medical expenses that will come along with it. Money is the LAST thing they need to worry about. Any and all donations will be greatly appreciated even just $1 Thank you all in advance and please pray for little Archie and the Bennett Family.\n",
    "creationDate": "2021-12-16",
    "images": [
      "62002945_1639772444426830_r.jpg"
    ],
    "numDonationsStr": "27 donations"
  },
  "support-for-the-alfreds-journey-with-child-cancer": {
    "slug": "support-for-the-alfreds-journey-with-child-cancer",
    "name": "Aspen",
    "age": 8,
    "gender": "female",
    "disease": "brain cancer",
    "raised": 31055,
    "goal": 60000,
    "url": "https://www.gofundme.com/f/support-for-the-alfreds-journey-with-child-cancer",
    "title": "Support for the Alfred's Journey with Child Cancer",
    "description": "Cancer \n\nCannot cripple love\n\nCannot shatter hope\n\nCannot corrode Faith\n\nCannot kill friendships\n\nCannot suppress memories\n\nCannot invade the soul \n\nCancer cannot stop a community from coming together!!\n\n\n\nBart and Lexi have laid their child, Aspen in the surgeon's arms, slept upright in hospital chairs, smiled through tears and found strength in prayers and family & community support during the most difficult time. \n\nWe have been wondering how we can help- what can we do? \n\nThere is a real superhero living in the heart of Aspen as she fights this battle with brain cancer! She is an inspiration. \n\nShe will soon be starting her treatments in Edmonton and we can help ease the financial burdens that will come with the year ahead. \n\nThe goal is to support the family as a whole through this time. There will be additional costs to travel, food, living expenses, making memories and we can help them with these costs so that they can focus on treatment and staying together through it all. \n\nIf you are unable to donate at this time please share this post and say some prayers for Aspen and her family. \n\n\n\n\n",
    "creationDate": "2021-07-08",
    "images": [
      "58312689_1625788613791083_r.jpeg"
    ],
    "numDonationsStr": "192 donations"
  },
  "asa-walkers-medical-expenses": {
    "slug": "asa-walkers-medical-expenses",
    "name": "Asa Walker",
    "age": 6,
    "gender": "male",
    "disease": "Acute Lymphoblastic Leukemia",
    "raised": 11755,
    "goal": 20000,
    "url": "https://www.gofundme.com/f/asa-walkers-medical-expenses",
    "title": "Asa Walker's medical expenses",
    "description": "Hi. My name is Stephen Walker. Asa is my nephew, He was taken to the Golisano childrens hospital of southwest Florida for treatment . Asa is the youngest of 5 children of Jeffrey Walker and Megan Nash. The doctors have diagnosed him with  ALL - Acute Lymphoblastic leukemia.  On the 27th the doctors are installing the chemo port to start this 2.5 year journey.  The family's medical expenses are just starting and like everyone that knows this little boy and his family know how hard it is economically to survive when the parents can't work.  Thank you all in advance for your gifts of love to help his parents and siblings focus there love on Asa. I know how overwhelmed they are emotionally with this news but they are equally overwhelmed by the love and support from you all.  Thank you does not begin cover the gratitude .\n",
    "creationDate": "2022-04-25",
    "images": [
      "64902251_1681484522403683_r.jpeg",
      "64902251_1651015893321149_r.jpg",
      "64902251_1681484555657719_r.jpeg",
      "64902251_1681484588206099_r.jpeg",
      "64902251_1671577547779057_r.jpeg",
      "64902251_1671577567560780_r.jpeg",
      "64902251_1671577587371619_r.jpeg"
    ],
    "numDonationsStr": "49 donations"
  },
  "baby-bratt-medical-expense-fund": {
    "slug": "baby-bratt-medical-expense-fund",
    "name": "Baby Bratt",
    "age": 0,
    "gender": "male",
    "disease": "Internal bleeding of unknown cause",
    "raised": 43424,
    "goal": 20000,
    "url": "https://www.gofundme.com/f/baby-bratt-medical-expense-fund",
    "title": "Baby Bratt Medical Expense Fund",
    "description": "Anyone who knows Gordon and Kate, and their wonderful children....loves them! In the midst of this already challenging year, their 3 month old baby boy was rushed to the hospital with internal bleeding. He has been stabilized after a couple days of critical condition, but the doctors are unable to find a cause. He is undergoing testing to discover what he has.We are asking for prayers, and more concretely, any financial assistance to help ease what will surely be heavy hospital costs. Gordon and Kate are very self-reliant, but it is through the request of family and friends, that we are asking for support.",
    "creationDate": "2020-07-23",
    "images": [
      "49880132_1595527191660672_r.jpeg",
      "49880132_1596573467188985_r.jpeg",
      "49880132_159656933490642_r.jpeg",
      "49880132_1595719219638164_r.jpeg",
      "49880132_159552844831162_r.jpeg"
    ],
    "numDonationsStr": "280 donations"
  },
  "zte7xz-medical-expenses": {
    "slug": "zte7xz-medical-expenses",
    "name": "Beau",
    "age": 0,
    "gender": "male",
    "disease": "Disease unknown",
    "raised": 11425,
    "goal": 15000,
    "url": "https://www.gofundme.com/f/zte7xz-medical-expenses",
    "title": "Baby Beau's Medical Expenses",
    "description": "Hi, Family & Friends, \n\n\n\nBaby Beau was born on 11/22/2022 four weeks early. He has had multiple hospital visits and is currently hospitalized at UMC Children’s Diamond Center.\n\n\n\nI am hoping to raise funds to assist Joby and Brenna with the unexpected medical expenses. My son Joby is a Paramedic and Brenna is an ER Nurse both serving their community.\n\n\n\nWe are praying the specialists can diagnose him and he can go home in the near future. Brenna is still on Family Medical Leave and Joby has had to miss work multiple weeks\n\n\n\n\n",
    "creationDate": "2023-01-02",
    "images": [
      "70224519_1674536788297328_r.jpeg",
      "70224519_1678897218326409_r.jpeg",
      "70224519_1677462690525975_r.jpeg",
      "70224519_1676389170233893_r.jpeg",
      "70224519_1674537494654172_r.jpeg",
      "70224519_1674537508937114_r.jpeg",
      "70224519_167407153734747_r.jpeg",
      "70224519_1673582512574261_r.jpeg",
      "70224519_1673321889136371_r.jpeg",
      "70224519_167311452961350_r.png",
      "70224519_1672986338240054_r.jpeg",
      "70224519_1672850587978797_r.jpeg",
      "70224519_1672682749412915_r."
    ],
    "numDonationsStr": "87 donations"
  },
  "support-for-baby-bennys-medical-journey": {
    "slug": "support-for-baby-bennys-medical-journey",
    "name": "Benny Cannon",
    "age": 0,
    "gender": "male",
    "disease": "Hypoxic brain injury",
    "raised": 56214,
    "goal": 75000,
    "url": "https://www.gofundme.com/f/support-for-baby-bennys-medical-journey",
    "title": "Support for Baby Benny's Medical Journey",
    "description": "If you know The Cannon Family, you know LOVE. You've felt their their genuine kindness in one way or another and now it's our turn to shower them with the love they have shown everyone and their communities for years. Their focus should be Benny, not the store, current bills and future medical bills. \n\n\n\nIf you are unable to donate, a prayer and a share is just as appreciated. \n\n\n\nHere is the latest update on baby Benny as of 6/27/24 at 10pm: \n\n\n\nWe are currently living everyone’s worst nightmare.\n\nBenny was in an incident at daycare and was found unresponsive, at this time we do not know for how long. He was taken by helicopter to Children’s Mercy and He is currently in a medically induced coma to provide his body time to rest. We do not have much more information until he has time to rest and the doctors have time to get results back.\n\nAt this time Please pray SO hard for Benny, for a stable evening, no seizures, good results from his CT scan, and his little body to rest. \n\nAlso pray for Travis and I as we navigate this obstacle, and for our girls as they are so confused! \n\nThe next 24-72 hours are very very very critical for our baby boy. \n\nPlease please please love on your babies tonight because you never know what tomorrow will bring.\n\nTravis Cannon\n",
    "creationDate": "2024-06-27",
    "images": [
      "81060863_1720672863336680_r.jpeg",
      "81060863_1723307704341476_r.jpeg",
      "81060863_1723307652299298_r.jpeg",
      "81060863_1723145184776355_r.jpeg",
      "81060863_1723046338362311_r.jpeg",
      "81060863_1723046349909446_r.jpeg",
      "81060863_172304635910702_r.jpeg",
      "81060863_1723046273639279_r.jpeg",
      "81060863_1723046286828364_r.jpeg",
      "81060863_172304609242711_r.jpeg",
      "81060863_1723046104455899_r.jpeg",
      "81060863_172304611759386_r.jpeg",
      "81060863_1723046133154752_r.jpeg",
      "81060863_1723046148914799_r.jpeg",
      "81060863_1723046161409465_r.jpeg",
      "81060863_172269619640027_r.jpeg",
      "81060863_172269620529695_r.jpeg",
      "81060863_172244680261155_r.jpeg",
      "81060863_1722446853139480_r.jpeg",
      "81060863_1722446865847309_r.jpeg",
      "81060863_1722446892329163_r.jpeg",
      "81060863_172217824177906_r.jpeg",
      "81060863_1722178252879033_r.jpeg",
      "81060863_1722049615776860_r.jpeg",
      "81060863_1722049624952018_r.jpeg",
      "81060863_1722049537480893_r.jpeg",
      "81060863_1722049579623937_r.jpeg",
      "81060863_1721873211217054_r.jpeg",
      "81060863_1721873229669210_r.jpeg",
      "81060863_1721873253333106_r.jpeg",
      "81060863_1721873268764762_r.jpeg",
      "81060863_1721759566645866_r.jpeg",
      "81060863_1721759575822626_r.jpeg",
      "81060863_1721676179847927_r.jpeg",
      "81060863_1721665269801447_r.jpeg",
      "81060863_1721573359195991_r.jpeg",
      "81060863_1721503963767030_r.jpeg",
      "81060863_1721503980990222_r.jpeg",
      "81060863_1721410529831313_r.jpeg",
      "81060863_1721410548890841_r.jpeg",
      "81060863_172127449674631_r.jpeg",
      "81060863_1721224261585132_r.jpeg",
      "81060863_1721224272775607_r.jpeg",
      "81060863_1721224315894671_r.jpeg"
    ],
    "numDonationsStr": "577 donations"
  },
  "baby-bensons-medical-battle-needs-you": {
    "slug": "baby-bensons-medical-battle-needs-you",
    "name": "Benson Juarez",
    "age": 0,
    "gender": "male",
    "disease": "premature birth complications including brain bleeds, heart condition, respiratory disease, and eye disease",
    "raised": 5736,
    "goal": 7500,
    "url": "https://www.gofundme.com/f/baby-bensons-medical-battle-needs-you",
    "title": "Baby Benson's Medical Battle Needs You",
    "description": "Baby Benson is a fighter and we are asking for help for him and his family.\n\n\n\nBenson arrived extremely premature on May 8, 2025, at just 25 weeks. His Mom had an emergency C-section, and Benson was delivered weighing just 1lb 7oz and was 12.5” long. He was immediately life flighted from the hospital in Eau Claire, WI, to the Children’s Hospital NICU in Marshfield WI.\n\n\n\nOur dear friends, Benson’s parents, Brooklyn Frederick and Rob Juarez, both need to work full-time and are trying to spend as much time as possible at the NICU. The drive to the hospital from home is 1.5 hours. They are able to stay at the Ronald McDonald house as needed, but there are short-notice trips on work days due to Benson’s condition. Mom and Dad are stressed, scared, tired and trying to do all they can for their precious baby boy, while dealing with the financial issues caused by missed work and travel and medical expenses.\n\n\n\nUnfortunately, Benson has suffered from multiple brain bleeds; he has a heart condition, respiratory disease and eye disease. He may need laser eye surgery before discharge. But Benson is a fighter and is improving! When he recently came off the ventilator, he was able to receive his first real bottle from Mom and Dad. The motto is “Benson Strong”!\n\n\n\nWhen Benson comes home, hopefully by the end of August, there will continue to be doctor visits and follow-ups with specialists. Both Brooklyn and Rob will need to take unpaid time from work when he reaches that milestone. We are asking for help to ease the financial burden so Brooklyn and Rob can focus on Benson. The constant travel is expensive and the medical bills continue to add-up. In addition, Brooklyn and Rob are moving this week into a home that will be better for Benson’s recovery.\n\n\n\nIf you can spare any amount for a donation, it would go a long way to help Benson’s family. Prayers and well-wishes are also appreciated. All money raised here will go directly to Brooklyn and Rob, to help with travel, medical and other Benson-related expenses.\n\n\n\nThank you for your consideration! Please share this link with as many as possible! Updates on Benson’s health and new pictures will be provided on this page.\n",
    "creationDate": "2025-07-29",
    "images": [
      "93158391_1753809811414580_r.png",
      "93158391_1753809820698137_r.jpg",
      "93158391_1753809843353660_r.jpg",
      "93158391_1753809854670622_r.jpg",
      "93158391_175381006360643_r.jpg",
      "93158391_1753809718464787_r.jpg",
      "93158391_1762908731164350_r.jpeg",
      "93158391_1762908746747320_r.jpeg",
      "93158391_1762908769620676_r.jpeg",
      "93158391_1762908794451716_r.jpeg",
      "93158391_1761009936154616_r.jpeg",
      "93158391_1761009983658302_r.jpeg",
      "93158391_1761010002888424_r.jpeg",
      "93158391_1761010062752842_r.jpeg",
      "93158391_1758770686883243_r.jpeg",
      "93158391_1758770710940991_r.jpeg",
      "93158391_1758770729357561_r.jpeg",
      "93158391_1757207420438772_r.jpeg",
      "93158391_1757207441158263_r.jpeg",
      "93158391_175720748027846_r.jpeg",
      "93158391_1757207498736806_r.jpeg",
      "93158391_1755700660354399_r.jpeg",
      "93158391_1755700699816794_r.jpeg",
      "93158391_1755700729183844_r.jpeg",
      "93158391_1755700761863275_r.jpeg",
      "93158391_1755050579865049_r.jpeg",
      "93158391_1755050609319198_r.jpeg",
      "93158391_1755050644199956_r.jpeg",
      "93158391_1754365752918991_r.jpeg",
      "93158391_1754365783108724_r.jpeg",
      "93158391_1754365819560167_r.jpeg"
    ],
    "numDonationsStr": "64 donations"
  },
  "help-the-gosse-family-navigate-caring-for-a-sick-kid": {
    "slug": "help-the-gosse-family-navigate-caring-for-a-sick-kid",
    "name": "Bradlee Gosse",
    "age": 13,
    "gender": "male",
    "disease": "Nephrotic Syndrome with Deep Vein Thrombosis and May Thurner Syndrome",
    "raised": 2792,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/help-the-gosse-family-navigate-caring-for-a-sick-kid",
    "title": "Help the Gosse Family navigate caring for a sick kid.",
    "description": "I am Hannah Fletcher, I am Auntie to the Gosse family. I want to introduce you to the members of the Gosse family: Brandon Gosse and his wife Tiffany, and their 4 kids Luke, Bradlee, Hunter and Sophie.\n\nI started this go-fund-me to help raise money to cover medical, travel expenses and loss of wages. As they are navigating the ups and downs that come along with caring for a very sick child.\n\n\n\n\n\nBack in February 2024 Bradlee fell numerous times in under 5 minutes. Knowing that that was out of the ordinary for her 13 year son Tiffany rushed Bradlee to the Grande Prairie Hospital. Through a few days of testing the Medical staff were able to determine the cause of Bradlees's falls. It is a condition called Nephrotic Syndrome.\n\n\n\nWhat is Nephrotic Syndrome? It is a Auto immune disease with a Kidney disorder that causes your body to excrete to much protein into your urine it also causes low albumin blood levels and high blood lipids. The condition causes fatigue, swelling, mainly in your eyes, feet and ankles, and increases the risk of blood clots. Only 5% of people with Nephrotic Syndrome developed blood clots. While there is no cure for Nephrotic Syndrome a way to treat it is through albumin infusions and other expensive medications. It is a life long condition that Bradlee will have to navigate.\n\n\n\n\n\nThe first month Bradlee was in and out of the hospital. The G.P. medical team worked hard to get his levels stable and remain stable so that he could stay home and get back to the life of a 13 year old. His Vitals where good one day and the tanked the next. That's were the Medical Team from the Stollery Hospital in Edmonton came in. On March 15, 2024 Tiffany and Bradlee drove down to meet their new medical team and what was supposed to be a routine meet the team turned into a full weekend of tests and Albumin infusions. These infusions help stabilize his oedema levels and regulate his protein levels and are needed twice per week.\n\n\n\n\n\n\n\nTiffany and Bradlee where at the G.P. Hospital for a routine albumin infusion on the 2nd of April when they where informed that the Stollery hospital would be calling them to schedule Bradlee in for an ultrasound and a possible biopsy. The biopsy would be needed to determine which type of Nephrotic Syndrome Bradlee has and to determine which treatment would be most beneficial. On April 7 Tiffany received the call for them to travel to the Stollery to get the tests done. On their way down Bradlee's left leg had swollen up to two times the size of his right leg. Once they got to the hospital Tiffany asked to speak with the Doctor as she believed the swelling in Bradlee's leg was due to a blood clot. The Doctor agreed. Bradlee was taken for testing to find the clot. The tests revealed that Bradlee had a full DVT- Deep vain thrombosis along with a bi lateral palmary embolism that is asymptomatic. After locating the clot Bradlee had under gone a Thrombectomy procedure. Which is a fairly new procedure. Making Bradlee The 3rd child in Canada, the first child in Alberta and the first child in Canada with Nephrotic Syndrome to under go that type of surgery.\n\n\n\nWhile conducting the surgery Bradlee's medical team found that he also has May Thurner Syndrome which only 23% of Canadians have. May Thurners syndrome is where an artery crosses over a vain putting pressure on the vain restricting the blood flow. This along side the Nephrotic syndrome made the perfect environment for blood clots to form. Bradlee will be on blood thinners for the rest of his life.\n\n\n\nTiffany is not able to work as she is Bradlee's primary caregiver. She is currently at the Stollery Hospital with Bradlee as his amazing medical team works to stabilize his condition. Brandon is keeping the home fires burning while working and taking care of the other 3 kids! (Luke, Hunter and Sophie)\n\n\n\n\n\nThrough all of this Bradlee and his family are still smiling. They are taking one day at a time!\n\nOn behalf of the Gosse family we thank you for any and all donations.\n",
    "creationDate": "2024-04-11",
    "images": [
      "79448351_1712861874287946_r.",
      "79448351_1712862137986141_r.jpeg",
      "79448351_1712861659148427_r.",
      "79448351_1712861853347843_r.",
      "79448351_1712861717886286_r."
    ],
    "numDonationsStr": "19 donations"
  },
  "help-bryson-fight-child-cancer": {
    "slug": "help-bryson-fight-child-cancer",
    "name": "Bryson Rosas",
    "age": 5,
    "gender": "male",
    "disease": "Medulloblastoma, Grade 4",
    "raised": 54873,
    "goal": 50000,
    "url": "https://www.gofundme.com/f/help-bryson-fight-child-cancer",
    "title": "Help Bryson Beat Child Cancer!",
    "description": "(This campaign was started by Diana Bentley on behalf of Melissa & Aaron Rosas. All donations will go directly to Bryson & his family).PLEASE WE NEED YOUR HELP! for Bryson.Bryson is a sweet & active 5-year-old boy who enjoys sports, swimming and exploring outdoors.  He has a close bond to his baby sister,  Madelynn who is 3-yrs-old.  Unfortunately 2 years ago, Madelynn herself suffered a traumatic brain injury (caused by 3rd party care-provider).  She will continue to require specialized care in the years to come. Thru it all, Bryson has been her playful companion & fierce protector.  Seeing how he tenderly interacts with her is heart-warming. They’re best buds.Recently, Bryson fell ill. He was life-flighted from Bend, Oregon to Doernbecher hospital in Portland, where immediate brain surgery was performed. We were devastated to discover Bryson has numerous cancerous tumors,- and only one being operable.  After surgery, Bryson starts radiation and chemotherapy to battle the remaining tumors that have spread to his brain and spinal column.  Doctors have confirmed his diagnosis as Medulloblastoma, Grade 4.Bryson is a kind & well-mannered boy who always gives you a hug and kiss, says hello and goodbye, please and thank you, -your heart just breaks for him. For his parents to endure a second tragedy so soon after Madelynn’s, is unimaginable. Bryson’s parents are struggling to both care for Madelynn, who requires constant care, and pay for medical, travel & hotel expenses to stay with Bryson. His father, a well-respected police officer in Bend, has taken leave from his job and will run out of paid-leave well before Bryson’s treatment has been completed. His doctors are just beginning the fight to keep Bryson alive. Please help us during the battle against cancer for an amazing young boy, and lift up his parents spirits. Maddie misses playing with her older brother. And we need him to be healthy, active and exploring the world again.This well-respected family has endured much sorrow but have remained gracious, hopeful & focused. Any contributions that you can spare will be wholeheartedly received & sorely appreciated. Please keep Bryson in your prayers. Thank you for your support.",
    "creationDate": "2019-04-16",
    "images": [
      "38501684_1555355602669364_r.jpeg",
      "38501684_155535543677196_r.jpeg",
      "38501684_1560007416452602_r.jpeg",
      "38501684_1560007455850013_r.jpeg",
      "38501684_1560007638502788_r.jpeg",
      "38501684_1557329074579545_r.jpeg",
      "38501684_1555355535444421_r.jpeg",
      "38501684_1555355666725622_r.jpeg"
    ],
    "numDonationsStr": "467 donations"
  },
  "help-cassidy-fight-stage-4-neuroblastoma": {
    "slug": "help-cassidy-fight-stage-4-neuroblastoma",
    "name": "Cassidy Crane",
    "age": 5,
    "gender": "female",
    "disease": "Stage 4 Neuroblastoma",
    "raised": 30614,
    "goal": 30000,
    "url": "https://www.gofundme.com/f/help-cassidy-fight-stage-4-neuroblastoma",
    "title": "Help Cassidy Fight Stage 4 Neuroblastoma",
    "description": "On Thursday, May 9th, my five-year-old niece Cassidy was diagnosed with a rare childhood cancer called neuroblastoma.\n\n\n\nCassidy is a bright, loving, child- she is full of energy and joy. Before this diagnosis, she showed no symptoms besides an intermittent tummy ache following what was thought to be a stomach virus a few weeks earlier. On May 8th, she woke up in discomfort, refused to eat or drink anything, and complained of chest pain, so my sister Tess took her to the ER. They were admitted to Boston Children's Hospital seven hours later, where she has since received her first round of chemotherapy.\n\n\n\nCassidy’s disease is high risk (equivalent to Stage 4), and she is currently undergoing treatment at Dana Farber/Boston Children’s Hospital. She will be receiving multiple rounds of chemotherapy in order to shrink the tumor before surgery, which will be followed by stem cell transplant, immunotherapy and radiation. Treatment is expected to last two years, much of it inpatient, barring complications.\n\n\n\nWe are so grateful for all the prayers and positive energy that friends and family have been sending to Cassidy, her mother Tess Wonson (my sister) and her father Fred Crane. They need all the love and support they can get. The financial burden of treatment and all of the associated costs will be significant. Any donations will help cover unanticipated expenses and ensure that Cassidy receives the best possible care and support as she fights against this disease.\n\n\n\n\n\n\n\n\n\nUpdate 6/3/24: Thank you so much to everyone who has shared and donated- every little bit helps.  I'm going to continue sharing and will post updates here from time to time. \n",
    "creationDate": "2024-05-31",
    "images": [
      "80114919_171716421217723_r.jpeg",
      "80114919_1732548345684844_r.jpeg",
      "80114919_1732548361739237_r.jpeg",
      "80114919_1732548373237568_r.jpeg",
      "80114919_1723146018254333_r.jpeg",
      "80114919_1719179307897266_r.jpeg",
      "80114919_171917932737854_r.jpeg",
      "80114919_171917934119237_r.jpeg",
      "80114919_1717165096253203_r.jpeg",
      "80114919_1717165109893870_r.jpeg"
    ],
    "numDonationsStr": "216 donations"
  },
  "medical-fund-for-cassius-the-warrior-kid": {
    "slug": "medical-fund-for-cassius-the-warrior-kid",
    "name": "Cassius",
    "age": 0,
    "gender": "male",
    "disease": "Disease unknown",
    "raised": 8955,
    "goal": 50000,
    "url": "https://www.gofundme.com/f/medical-fund-for-cassius-the-warrior-kid",
    "title": "Medical fund for Cassius the Warrior Kid",
    "description": "We are raising funds for the Warrior Kid Cassius and his amazing Warrior Queen-Mama La-Toya. Cass will be undergoing medical treatments at SickKids for a minimum of 6 months (but may easily continue for 9 months or more). During this time, La-Toya is taking a leave from office work to be a full time caregiver and cheerleader to Cass in hospital. Being a full-time caregiver is emotionally and financially draining. On top of regular monthly bills (rent, utilities, etc.) La-Toya will have substantial additional expenses such as: medications and medical procedures not covered by OHIP or insurance, transportation to and from the hospital (all hours), prepared food for La-Toya to eat (both for in hospital and at home after a long day in the hospital), gifts for Cassius (to keep his spirits up and for holidays), and other unforeseen expenses. While we cannot help directly with La-Toya’s emotional labor, we can ease the financial burden, and thus give her piece of mind financially throughout this challenging process.",
    "creationDate": "2023-09-18",
    "images": [
      "75453233_1695076809496298_r.jpg"
    ],
    "numDonationsStr": "46 donations"
  },
  "charlottes-childhood-cancer-journey": {
    "slug": "charlottes-childhood-cancer-journey",
    "name": "Charlotte Cruz",
    "age": 4,
    "gender": "female",
    "disease": "Pre-B Acute Lymphoblastic Leukemia",
    "raised": 50955,
    "goal": 50000,
    "url": "https://www.gofundme.com/f/charlottes-childhood-cancer-journey",
    "title": "Charlotte's Childhood Cancer Journey",
    "description": "Charlotte is an amazing 4-year-old girl who always has a smile on her face, a princess dress on her body, and a microphone in her hand. Her spirit and heart are contagious to all those around her. Recently, the Cruz Family received some news that turned their world upside down. Charlotte was diagnosed with Pre-B Acute Lymphoblastic Leukemia. Doctors have put together a treatment plan of a minimum of 2.5 years, and Charlotte will begin with chemotherapy this week.\n\n\n\nJessica has dedicated her life to helping others through her line of work as a Nurse. Jessica and Nick are always the first ones to step up and lend a helping hand to others around them. Now, it's our turn to help them. The money raised will go towards medical expenses that will quickly add up, weekly trips to the hospital, and essentials for their beautiful family of 5. Every little bit of love counts and makes a huge difference in her fight to get the best care possible. Thank you all for helping in any way you can.\n",
    "creationDate": "2022-01-19",
    "images": [
      "62739901_1686783632394359_r.jpeg",
      "62739901_1642628718493849_r.jpeg",
      "62739901_1686783598596870_r.jpeg",
      "62739901_1686783619237628_r.jpeg",
      "62739901_1676519519297689_r.jpeg",
      "62739901_1676519530568290_r.jpeg",
      "62739901_1674098940148098_r.jpeg",
      "62739901_1674098956608647_r.jpeg",
      "62739901_1673491461850230_r.jpeg",
      "62739901_1672373078675771_r.jpeg",
      "62739901_1671678626466159_r.jpeg",
      "62739901_1671076563290640_r.jpeg",
      "62739901_167047007725069_r.jpeg",
      "62739901_1669862315149910_r.jpeg",
      "62739901_1669862329966656_r.jpeg",
      "62739901_1669258657691507_r.jpeg",
      "62739901_1668656051497306_r.jpeg",
      "62739901_16680475918124_r.jpeg",
      "62739901_166745287544541_r.jpeg",
      "62739901_1667452888144811_r.jpeg",
      "62739901_1666837755582262_r.jpeg",
      "62739901_1666837768112477_r.jpeg",
      "62739901_1666669110569056_r.jpeg",
      "62739901_1666237096479013_r.jpeg",
      "62739901_1665637630956563_r.jpeg",
      "62739901_1665023870236831_r.jpeg",
      "62739901_1664419459722643_r.jpeg"
    ],
    "numDonationsStr": "390 donations"
  },
  "cjs-battle-with-cancer": {
    "slug": "cjs-battle-with-cancer",
    "name": "CJ Nielsen",
    "age": 3,
    "gender": "male",
    "disease": "Rhabdomyosarcoma",
    "raised": 10500,
    "goal": 20000,
    "url": "https://www.gofundme.com/f/cjs-battle-with-cancer",
    "title": "CJ's Battle with Cancer",
    "description": "Meet CJ!\n\n\n\nHe is a spunky, intelligent, active and loveable three year old. He loves trains, planes, cars and his twin brother Cooper.\n\n\n\n\n\nOn May 3rd, CJ was admitted to the hospital due to a rapidly worsening jaundice. After a quick ultrasound, a mass was found on his liver. The surgeons originally thought it was benign and decided on a complete resection of the tumor. The surgery was successful and CJ started to recover well.\n\n\n\n\n\nA week later, the pathology report came back and showed that the mass was not benign, but was in fact malignant. The tumor on his liver tested positive for Rhabdomyosarcoma, a muscle cancer. The treatment needed will be long and hard. CJ will undergo 42 weeks of chemo with radiation following the first 13 weeks.\n\n\n\nCJ's mom and dad are Conner and Tamela Nielsen. Conner recently graduated from dental school at Loma Linda and will start Oral Maxillofacial Surgery residency at UCSF Fresno. Tamela has loved being a mom to her two boys the last 3 years, and frequently takes them to children's museums, hikes, and their favorite parks, they love being outside!\n\n\n\n\n\nWith financial and insurance needs, Conner will keep his residency position at UCSF Fresno, while Tamela, CJ, and Cooper will remain in Loma Linda (4 hours away from Fresno) so CJ can receive his care.\n\n\n\nHow can you help? With weekly chemotherapy and Conner being away, they need help with necessities like groceries, gas money for Conner to visit, and every day living needs to help ease the burden for Tamela and the boys as they begin this new way of life.\n\nJoin us in letting CJ's family know how much we love them. Every dollar helps.\n\n\n\nEven if you are unable to donate at this time, please share this campaign with your friends and community, Through Facebook, Instagram, Snapchat, Tiktok, or email, it really does help tremendously!\n\n\n\nI will continue to update this page as CJ progresses through his treatments.\n\n\n\nThank you!\n\n\n\n-Erica\n",
    "creationDate": "2023-05-28",
    "images": [
      "73166435_1685317753975047_r.jpeg",
      "73166435_1685313020287629_r.",
      "73166435_168532013797772_r.jpeg",
      "73166435_1685313046215916_r."
    ],
    "numDonationsStr": "65 donations"
  },
  "teamcoop-hospital-bills": {
    "slug": "teamcoop-hospital-bills",
    "name": "Cooper",
    "age": 15,
    "gender": "male",
    "disease": "traumatic brain injury with skull fractures and brain bleeding",
    "raised": 13380,
    "goal": 100000,
    "url": "https://www.gofundme.com/f/teamcoop-hospital-bills",
    "title": "#TEAMCOOP - Hospital Bills",
    "description": "Hello Friends and Family,On Saturday October 19th, Elisha and Hunter got a devastating phone call that Cooper had been in a fight and was transported to Brigham City ER. He was hit in his head so hard that he was knocked out while standing , fell backwards to the ground, hitting his head on the asphalt, then  had a seizure. The other kid ran and fled the scene, while a couple of boys helped Cooper while he was seizing. Elisha and her family rushed to the Brigham City ER. Cooper was absolutely out of it and was not making sense at all and his poor little body was in shock.  Within the first few hours that he was there he had seized 5 times. Cooper was then life-flighted to Primary Children’s Hospital Trauma Unit, and was admitted to the ICU, and intubated for 48 hours. Cooper has several skull fractures as well as bleeding on his brain and bruising.  WHY IS THIS URGENT? Cooper was not insured at the time of the incident.  Elisha was in the process of adding Cooper to her medical plan, but with open enrollment, we all know that coverage will not be effective until January 1st 2020. Funds will help with hospital bills and Cooper’s ongoing rehab to ensure he is getting the proper care. In the event there are funds over the amount needed, Elisha is going to advocate and bring awareness to the severity of what can happen when kids fight and what a brain injury can do to our youth. Elisha will also give back to kids in need in our hospitals and any fundraisers for those in need.Cooper will have a long road to recovery. Cooper does not remember much about the event and his memory has suffered, he will need rehabilitation/ occupational therapy going forward. Cooper will not be able to return to school in a normal fashion and he will have to be home schooled for some time. A brain injury is very serious and if anything happens to Cooper over the next few months it could very well put him back into the hospital and the damages will be worse.Most of you know Elisha Ward.  She is one of the most positive and giving people that I know, and I can say that, because I have known here since I was a wee lass. Elisha is always taking care of everyone else, and is always one of the first people to reach out and offer help, volunteer her time and money for whatever cause or fundraiser there is.  Elisha is a single mother, raising 2 boys the best she can, and she always gives all she has to her boys, friends and strangers, and rarely takes the time for herself.  If you know Elisha like I do, she is also very prideful. She never asks for help on anything, she just buckles down and jumps in with both feet. And so when she said, Kate, I need help, I knew that her even asking for help was very hard for her.Friends, it is time for us to rally around this Momma and help her, the way she helps everyone else.The case is being investigated, so any information we have as far as what is going to happen next, is in the hands of the county attorneys.Elisha also has a Venmo account if you would rather donate that way - @Elisha-Ward-1",
    "creationDate": "2019-10-25",
    "images": [
      "42952124_1572111292357044_r.jpeg",
      "_1575130260382885_r.jpeg",
      "_1574080032685033_r.jpeg",
      "_1573485994862303_r.jpeg",
      "_1573136840715924_r.jpeg",
      "_157296390317744_r.jpeg",
      "_1572614988850012_r.jpeg",
      "42952124_1572451781194167_r.jpeg",
      "_1572366215556668_r.jpeg",
      "42952124_1572111358612930_r.jpeg",
      "42952124_1572111388796252_r.jpeg",
      "42952124_1572276445117810_r.jpeg"
    ],
    "numDonationsStr": "159 donations"
  },
  "baby-cross-johnson-medical-expenses": {
    "slug": "baby-cross-johnson-medical-expenses",
    "name": "Cross Johnson",
    "age": 0,
    "gender": "male",
    "disease": "kidney failure due to bladder outlet obstruction",
    "raised": 7135,
    "goal": 30000,
    "url": "https://www.gofundme.com/f/baby-cross-johnson-medical-expenses",
    "title": "Baby Cross Johnson's Medical Expenses",
    "description": "The Johnson family recently welcomed the newest member of their family -Cross Johnson - on June 17th 2021. Since baby Cross' arrival he has been fighting to remain healthy and become strong enough to go home. He has required extensive medical interventions for his lungs and will continue to need medical attention for his Kidneys, with the possibility of a kidney transplant down the road. We love Sarah and Matt dearly and ask that you bless them in anyway possible through prayer, or donation to help with medical expenses.Update from Sarah’s Facebook!Cross David Johnson was born June 17, 2021 at 37 weeks and 5 days, at 4:30 am weighing 7lbs 7oz. A middle of the night labor and birth was quite exciting, given that he was breech and we made it to the hospital in time for my first c section, and the neonatologist team to prepare for his arrival. Because of his extremely high risk pregnancy, our hospital was prepared for him to come. It’s been a rollercoaster since Cross has arrived. As soon as he was born he was taken straight to the NICU at Harris hospital. His first 48 hours in the NICU were really scary and sad. His lungs were really struggling. He was put on the ventilator, jet ventilator, nitric oxide and given surfactant. On the night of his second day, he made a huge leap and proved that he was a fighter! His lungs began to improve and he came off of a few machines, then he was stable enough to transfer over to Cooks Children’s Hospital. Once we got to Cooks, he had a few procedures done to get catheters and lines in place to begin dialysis because he was not producing any urine and both kidneys were showing to be non-functioning. On day 5 he came off the ventilator and began peritoneal dialysis. But over the course of the next 3 days this was not effective. His dialysis port was leaking really bad and he wasn’t draining properly. He took on 3 lbs of fluid and we needed to try something else. Cooks Children’s just started using a new machine called Aquadeks that preforms Aquapheresis. This is basically hemodialysis for babies and small kids. We are really fortunate our hospital just received this machine so we had the option to do the hemodialysis while his other dialysis port was healing. It’s only being used in 5 hospitals in the country. So on day 8, Cross had surgery to install the new port and began the Aquadeks machine. After 6 days on Aquadeks his swelling had all gone down and he was back to his birth weight and all of his labs were almost to normal ranges. So we went back to the peritoneal dialysis to give that a try again. Over the last 16 days of his life he has produced small amounts of urine but the nephrologists say in combination his kidneys are probably working at less than 10%. Our current goals are to get some consistency from the peritoneal dialysis and start removing some of the lines he has in. With the big picture being that he will eventually need a kidney transplant. Please pray for us and for Cross:-Pray that we find some routine amidst this journey while we juggle time at the nicu and time with the girls. -Pray that Cross’ kidneys would heal and grow and miraculously start to function. -Pray we can stay on the peritoneal dialysis as this is the only way for us to bring him home one day. -Pray for Norah and Shiloh as this is the most time we’ve ever spent away from them. We are so thankful for our friends and family who have loved us and supported us though all of this. I can’t even put into words what we have fully be through over the last 16 days but we are so thankful that Cross is alive and that he is fighting. Galatians 6:24 “May I never boast in anything but the CROSS of Jesus Christ.”Thank you Jesus for the most precious gift of Cross’ life!#bladderoutletobstruction\n",
    "creationDate": "2021-07-06",
    "images": [
      "58280711_1625578259160838_r.jpeg",
      "58280711_1628452033309395_r.jpg",
      "58280711_1626554355775687_r.jpg",
      "58280711_1626554356173523_r.jpg",
      "58280711_1626554356311294_r.jpg",
      "58280711_162619301785852_r.jpg",
      "58280711_1625955749954154_r.jpg"
    ],
    "numDonationsStr": "45 donations"
  },
  "baby-daniels-fight-medical-help-needed": {
    "slug": "baby-daniels-fight-medical-help-needed",
    "name": "Daniel",
    "age": 0,
    "gender": "male",
    "disease": "hydrocephalus, atrial septal defect, laryngomalacia, obstructive sleep apnea",
    "raised": 7760,
    "goal": 15000,
    "url": "https://www.gofundme.com/f/baby-daniels-fight-medical-help-needed",
    "title": "Baby Daniel's Fight: Medical Help Needed",
    "description": "Daniel was born prematurely at 34 weeks on November 21st. He spent 85 days in the NICU before being discharged to come home. He’s had many struggles, like learning to eat and breathing without oxygen support.\nDaniel has an atrial septal defect in his heart, laryngomalacia (a floppy airway), difficulties eating by mouth, and obstructive sleep apnea. He received a supraglottoplasty back in January to open up his airway.\nRecently, Daniel was diagnosed with hydrocephalus, which is a buildup of spinal fluid within the brain that can cause pressure, pain, and developmental delays. Daniel had another surgery, called an ETV (endoscopic third ventriculostomy) to help his brain drain the spinal fluid and relieve the pressure in his skull in late June. Unfortunately, the procedure failed to help him maintain the spinal fluid in his brain, and he required a shunt to be placed in early July. Daniel has a long road to recovery ahead of him, but he is resilient. This experience has been very heavy on myself and my husband, Keegan. Any donation is greatly appreciated to help cover medical bills and others medical expenses. Thank you!",
    "creationDate": "2025-01-12",
    "images": [
      "85626565_1752070637524057_r.jpg"
    ],
    "numDonationsStr": "84 donations"
  },
  "support-illanas-twins-facing-major-surgeries": {
    "slug": "support-illanas-twins-facing-major-surgeries",
    "name": "Daniel and Donald Mikhael",
    "age": 1,
    "gender": "male",
    "disease": "Tetralogy of Fallot",
    "raised": 20919,
    "goal": 70000,
    "url": "https://www.gofundme.com/f/support-illanas-twins-facing-major-surgeries",
    "title": "Save Twins Lives Facing Major heart and GTube Surgeries",
    "description": "Hi everyone,\n\n\n\nI’m asking for support for my sister Illana, a devoted mom to five young children. Her family has been through more than most could imagine, and the twins’ medical journey has reached another difficult chapter.\n\n\n\nBoth baby boys were born with Tetralogy of Fallot, a rare and serious congenital heart condition. They have spent much of their lives in and out of the hospital, undergoing procedures, living with feeding tubes, and fighting every day to grow and stay strong.\n\n\n\nIllana is the person who primarily manages the boys’ medical care. She lovingly and tirelessly places their feeding tubes three to five times every single day, while juggling hospital stays, therapies, and endless doctor visits — all while caring for her other three little ones with so much love and grace.\n\n\n\nRecently, things have become even more critical:\n\n• Daniel underwent G-Tube surgery to safely receive the nutrition he needs.\n\n• Donald Mikhael just had his third open-heart surgery, and he will be undergoing another important surgical procedure this December.\n\n\n\nBoth boys will also need multiple future cardiac catheterization procedures and additional open-heart surgeries as they grow.\n\n\n\nThis has meant more long days and nights in the hospital, more exhausting travel, and more expenses. Our parents help when they can, but the ongoing medical demands are still overwhelming.\n\n\n\nIf you can give anything — no matter how small — please know that 100% of all donations will go directly toward the twin boys’ medical and recovery needs: hospital bills, travel costs, therapies, medical supplies, groceries, and essentials for the children’s care and stability.\n\n\n\nThese donations are personal gifts made solely for the children’s medical expenses and family support during this long recovery journey. All funds will be managed transparently by Illana’s sister to ensure they are used only for the children’s well-being and household stability.\n\n\n\nIf you can’t give, please share this page and keep them in your prayers and your hearts. Every prayer, every share, and every kind word helps lighten their load.\n\n\n\nIllana has always been the kind of mother who stays up all night at a hospital bedside and still wakes up with love and strength for her children in the morning. Now, she needs all of us to show up for her.\n\n\n\nFrom the bottom of my heart, thank you for reading, caring, giving, and sharing. It truly means the world to our family right now.\n\n\n\nWith love and hope,\n\nHer Sister\n\n\n",
    "creationDate": "2025-07-06",
    "images": [
      "92458919_176331599392684_r.png",
      "92458919_1760665748239987_r.jpeg",
      "92458919_1761089379351429_r.png",
      "92458919_1761089402151207_r.png",
      "92458919_1761089456175009_r.png",
      "92458919_1751862849964172_r.jpeg"
    ],
    "numDonationsStr": "141 donations"
  },
  "thumbs-up-for-declan-fighting-childhood-cancer": {
    "slug": "thumbs-up-for-declan-fighting-childhood-cancer",
    "name": "Declan Lyons",
    "age": 3,
    "gender": "male",
    "disease": "Brain tumor (cerebellum) - cancer type pending diagnosis",
    "raised": 312328,
    "goal": 250000,
    "url": "https://www.gofundme.com/f/thumbs-up-for-declan-fighting-childhood-cancer",
    "title": "Thumbs Up For Dec: Fighting Childhood Cancer",
    "description": "Standing Strong with Declan: Join the #ThumbsUpforDec Movement\n\n\n\nMeet sweet Declan Lyons, an energetic and loving 3-year-old boy, and twin brother to JB. Declan's days are filled with joy as he plays with trucks, cars, and his favorite sand and Play-Doh. He loves Disney movies, often quoting lines from classics like Cars and Toy Story. Outdoors, he's a bundle of energy, racing his toy fire truck through the neighborhood and reveling in the magic of playgrounds. You can often find him cheering on his big sister Mallory and older brother Kellen at hockey rinks and soccer fields.\n\n\n\nRecently, the Lyons family's world turned upside down when weeks of headaches led to an MRI, revealing a tumor the size of a golf ball in Declan's cerebellum, the lower back of his brain. This brave young boy just underwent an arduous 9-hour surgery to remove the tumor, only to discover that it was indeed cancerous. Now, Declan and his loving family are faced with an unimaginable journey to battle childhood cancer.\n\n\n\nAs we await the specific diagnosis of the cancer Declan is bravely confronting, we are certain that the path ahead won't be easy. Currently, Declan's loved ones are holding their breath as he recovers from surgery, hoping to learn the extent of any mobility impacts he may face. They've been told to prepare for a year's worth of treatments, including chemotherapy, radiation, medications, frequent hospital visits, and inpatient stays.\n\n\n\nThe financial strain on the Lyons family is substantial. With medical bills piling up, the challenge of feeding a family of six, transportation costs, parking fees, and the need to maintain a sense of normalcy for their three other children who are active in sports and dance, the burden is simply overwhelming. Both Bobby and Sarah will potentially need to take unpaid leave from work to support Declan during his treatments.\n\n\n\nDespite this formidable obstacle in their path, the Lyons family is determined to fight and navigate this brutal and unjust journey. They are not alone, as we stand beside them, ready to offer our unwavering support.\n\n\n\nYour contributions will make a significant difference in Declan's battle against cancer. Every donation, no matter the size, will help alleviate the financial burden and allow the family to focus on what matters most – Declan's health, well-being, and full recovery.\n\n\n\nThank you for your love, support, and enduring compassion during this challenging time. Together, we can help Declan face this battle with strength and determination. Please share this campaign using #ThumbsUpForDec & #DeclanStrong to spread the word and garner even more support for a family we all love so deeply.\n\n\n\nTo follow Declan's journey, please visit https://caringbridge.org/visit/thumbsupfordec\n\n\n\nWith heartfelt gratitude,\n\n\n\nSarah's Friends (& UML Soccer Teammates),\n\n\n\n(Kristin, Darcy, Kelly, Caitie, Beth, Ange, Marielle, & Carly)\n",
    "creationDate": "2023-09-07",
    "images": [
      "75235779_1694133313117547_r.jpeg",
      "75235779_1755041759928355_r.jpeg",
      "75235779_1755041782895351_r.jpeg",
      "75235779_1755041816135148_r.jpeg",
      "75235779_1755041829252929_r.jpeg",
      "75235779_1755041859988688_r.jpeg",
      "75235779_1705086199973525_r.jpeg",
      "75235779_1705086246185586_r.jpeg"
    ],
    "numDonationsStr": "3K donations"
  },
  "medical-and-funeral-expenses-for-baby-dominic": {
    "slug": "medical-and-funeral-expenses-for-baby-dominic",
    "name": "Dominic Alexander Nava",
    "age": 0,
    "gender": "male",
    "disease": "Vein of Galen Malformation",
    "raised": 9729,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/medical-and-funeral-expenses-for-baby-dominic",
    "title": "Medical and funeral expenses for baby Dominic",
    "description": "In honor of Dominic Alexander Nava, a son, brother, grandson, nephew, and cousin. At 37 weeks baby Dominic was diagnosed with a vein of “Galen Malformation” in his brain. Dominic was delivered on 09/26/2021 and rushed to Phoenix  children's Hospital. On 10/06/2021 Dominic went under a high-risk surgery to help heal part of his malformation to help his chances of survival. Baby Dominic was a fighter, and he will forever be missed and loved. Heaven has gained another angel.\n\n \n\nWe want to relief some stress away from Miranda and Marco in this difficult time in their life. We are looking to raise some money to help with medical bills and funeral expenses. If you can help our family, it would mean the world to all of us. Thank you in advance for your support.\n\n \n\nAlso, we want to humbly thank every single one of you that have been praying for our family and sending good positive vibes.\n\n \n",
    "creationDate": "2021-10-07",
    "images": [
      "60431069_163363325397290_r.jpeg"
    ],
    "numDonationsStr": "81 donations"
  },
  "assist-our-family-during-babys-medical-care": {
    "slug": "assist-our-family-during-babys-medical-care",
    "name": "Eli",
    "age": 0,
    "gender": "male",
    "disease": "sleep apnea and swallowing difficulties",
    "raised": 2375,
    "goal": 2500,
    "url": "https://www.gofundme.com/f/assist-our-family-during-babys-medical-care",
    "title": "Help support us in the care of our medical needs baby",
    "description": "Our baby was born at 36 weeks and had a stay in the NICU for almost a month. He was sent home on oxygen and a feeding tube for a diagnoses of sleep apnea and troubles with swallowing. \n\nWe are looking into continuous months of occupational therapy and work with the neuroscience specialists at the children's hospital. \n\nDuring this postpartum recovery period we are struggling to keep up with some of our bills, the biggest one we haven't been able to recieve much help with is our car payments.  \n\nThe amount we are requesting will cover the cost of our car payments as well as a little bit extra for unexpected prescription costs and fuel for appointments until I am cleared to go back to work after 12 weeks. \n\nI am greatful for job security as this time is very much needed for my body to heal as well as getting doctors and care personnel at up for Eli.\n\nAt this point anything helps, but being able to keep our vehicle is a huge need in medical care for our whole family. \n",
    "creationDate": "2025-01-05",
    "images": [
      "85395079_173613452427976_r.jpeg"
    ],
    "numDonationsStr": "8 donations"
  },
  "help-support-ellie": {
    "slug": "help-support-ellie",
    "name": "Ellie",
    "age": 1,
    "gender": "female",
    "disease": "Leukemia",
    "raised": 2700,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/help-support-ellie",
    "title": "Help Support Ellie's fight against Leukemia",
    "description": "Hi, my name is Kelsey and I'm here to ask for help for a fellow Cape Bretoner.\n\nLeah and I have known each other since we were children, and although we haven't kept in touch as we got older, I want to make sure she has the help her and Ellie need at this very difficult time in their life.\n\n\n\nLike me, Leah doesn't want to ask for help, but when a child is in need, I found out first hand that we help the child no matter what, letting the parent breathe a sigh of relief when that help show up without being asked. So let's help Leah breathe a little easier and help her focus all her energy into her baby girl.\n\n\n\nLeah's sweet Ellie is only 18 months old and was diagnosed with Leukemia a few weeks ago. As a cancer warrior mom myself, I know how incredibly hard this journey can be. It is even harder when you have the worry of how bills are going to be paid. No parent should have to go through their child's cancer diagnosis wondering what they will do after treatment ends.\n\n\n\nI hope that we can show Ellie and her mom Leah the same support we were shown in our time of need.\n",
    "creationDate": "2025-09-10",
    "images": [
      "94522549_1757530703531347_r.jpg",
      "94522549_1757530767116559_r.png",
      "94522549_1757530703123217_r.jpg",
      "94522549_1757530703724804_r.jpg",
      "94522549_1757530702929069_r.jpg"
    ],
    "numDonationsStr": "29 donations"
  },
  "baby-enzos-heart-surgery-and-medical-expenses": {
    "slug": "baby-enzos-heart-surgery-and-medical-expenses",
    "name": "Enzo",
    "age": 0,
    "gender": "male",
    "disease": "Vascular Ring (congenital heart defect)",
    "raised": 5030,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/baby-enzos-heart-surgery-and-medical-expenses",
    "title": "Baby Enzo’s heart surgery and medical expenses",
    "description": "Hi, my name is Madisen Glaze, and I am fundraising for my friends new baby, Enzo. Enzo was diagnosed with a congenital heart defect when his mom was 20 weeks pregnant. The heart defect he suffers from is called a Vascular Ring which means his aortic arch is not arched, it is wrapped around his esophagus and trachea compressing his airways and causing other problems. He was born in Boston due to being high risk and thankfully was born with minimal time in the NICU and followed by Boston Childrens. Over the last month, baby Enzo has become increasingly symptomatic from his heart condition and is set to go to Boston Childrens next week to be put under anesthesia for pre operative testing. His team made up of pediatric cardiologists, cardiothoracic surgeron, general surgeron, ORL doctor, ENT, gastroenterologist and pulmonologist out of Boston Childrens are creating a game plan for when Enzo will need heart surgery. It was originally planned for when he was 6 months old but due to his symptoms that timeline may be moved up. Some symptoms he suffers from is choking when eating, gasping for air, strider (noisy breathing,) he has difficulty laying on his back as it makes it harder to breathe and becomes pained from eating due to silent reflux from his condition. Enzo’s mom had to leave her full time job to take care of him as daycares would not accept the child with his symptoms. \n\n\n\n\n\n\nEnzo’s mom has been a social worker at Catholic Medical Center in NH and goes above and beyond for her patients with compassion and kindness. Anyone that knows Enzo’s mom, Taylor, knows what a big heart and kind person she is. As a single mom, Enzo’s medical expenses are quickly piling up and I am hoping to relieve some of that burden for them as they continue to embark on his medical journey. \n\n\n\n\n\n\nThank you for your donations and well wishes for baby Enzo!\n\n\n\n\n\n\n\n\n",
    "creationDate": "2022-08-16",
    "images": [
      "67448531_1660687698966218_r.jpeg",
      "67448531_1663169562264712_r.jpeg",
      "67448531_1661994027638570_r.jpeg",
      "67448531_1661439884569444_r.jpeg",
      "67448531_1660699485816377_r.jpg",
      "67448531_1660699507722991_r.jpg",
      "67448531_1660699533449362_r.jpg"
    ],
    "numDonationsStr": "71 donations"
  },
  "greer-and-estelle-need-help-with-medical-expenses": {
    "slug": "greer-and-estelle-need-help-with-medical-expenses",
    "name": "Estelle",
    "age": 5,
    "gender": "female",
    "disease": "dysplasia of right hip",
    "raised": 3683,
    "goal": 15000,
    "url": "https://www.gofundme.com/f/greer-and-estelle-need-help-with-medical-expenses",
    "title": "Greer and Estelle need help with medical expenses",
    "description": "My niece Greer is a single mother to two beautiful girls. Her oldest daughter Estelle (Stelly) is the kind of kid that’s always smiling, always dancing. Estelle was diagnosed with dysplasia of her right hip. This has caused her right leg to grow slower than her left. Without surgery she was told she’d have an adulthood filled with pain and difficulty walking.  She had surgery today and her doctors are hopeful for a full recovery. However, she’s in a body cast for 12-18 weeks. We know her Medicare won’t cover all of the expenses. She will require full time care while casted and physical therapy later. I’m just trying to help ease some of the stress. Greer will have to be off work while Estelle recovers. Anything you can do to help will be a huge help and greatly appreciated.",
    "creationDate": "2021-04-15",
    "images": [
      "56111336_1618766615860052_r.jpg",
      "56111336_161853395088186_r.jpeg",
      "56111336_1626580134693079_r.jpg",
      "56111336_1626580134630656_r.jpg",
      "56111336_1621792093990966_r.jpg",
      "56111336_1621792093979922_r.jpg",
      "56111336_1621539589856257_r.jpg",
      "56111336_1621384715159906_r.jpg",
      "56111336_1620325564365375_r.jpg",
      "56111336_1620325564389130_r.jpg",
      "56111336_1619576798105434_r.jpg",
      "56111336_161957679878484_r.jpg",
      "56111336_1619192844100275_r.jpg",
      "56111336_1619018089814519_r.jpg",
      "56111336_1618842607401879_r.jpg",
      "56111336_1618721764122866_r.jpg",
      "56111336_1618534820292722_r.jpeg"
    ],
    "numDonationsStr": "49 donations"
  },
  "evelyns-unexpected-medical-expenses": {
    "slug": "evelyns-unexpected-medical-expenses",
    "name": "Evelyn",
    "age": 5,
    "gender": "female",
    "disease": "Type 4 choledochal cyst with blocked bile duct",
    "raised": 6140,
    "goal": 15000,
    "url": "https://www.gofundme.com/f/evelyns-unexpected-medical-expenses",
    "title": "Evelyn’s medical expenses",
    "description": "Hello Friends & Family.\n\nGallegos family here raising funds for our sweet Evey.\n\n\n\nOur little Evelyn has been having health issues for the past 3 months. It started with what we thought were allergies, since she had been complaining about being itchy. It got to the point where I knew something was off, so we took her to the pediatrician and they had to get bloodwork. From there, it turned into many specialist appointments, to then getting an emergency admission to the Children’s hospital at the end of September. Everything from then until now has been so overwhelming and just a complete shock.\n\n\n\nOur baby girl had been dealing with something far worse than what we could’ve ever imagined. We found out that she had developed jaundice, caused by a blocked duct that goes from the liver/ gallbladder/ down to her intestine. Initially, we were told that they weren’t sure what was blocking the duct, but they knew something was there because it showed up in a sonogram she got. There was speculation of all sorts of scary diagnosis, but we wouldn’t know for sure until that first hospital admission.\n\n\n\nThe first stay was to run more tests and to get some procedures done. We found out that she actually had a type 4 cohlydocal cyst blocking most of her duct and some sludge/ stones that had been building up. It was causing her to itch so much, and to have other uncomfortable symptoms. She got an MRCP & an ERCP done to clear that sludge, and put in a stent to help keep it clear and also help with inflammation that was causing her body to react.\n\n\n\nWe got discharged while the doctors finalized their plans, but we knew she’d have to get things removed because of cancer risks. We tried our best making those last normal weeks with her memorable.\n\n\n\nTuesday was surgery day, one of the hardest days of our lives. I can’t tell you how many times i’ve cried, prayed, wished it wasn’t real, but this has become our new reality. Her gallbladder and cyst were taken out, as well as the stent, and to repair the remaining duct to the intestine. A 3 hour surgery turned into 5 hours, but they managed to repair everything and she is currently recovering for the rest of the week.\n\n\n\nIts been hard for her understandably, us as well. This surgery is life changing, but vital to her health. She has been soo strong and brave through it all. She amazes me everyday, a true warrior. If you know about Evelyn, you know just how sacred she already is to us since we almost lost her in the womb. Both my kids are my world, and it hurts us so much to see her going through something like this. Our hope after this is that her body is able to completely recover and not have any further complications because there are risks we still have to look out for. Her liver ducts had gotten inflamed as well, but we’re praying that after this surgery they can go back to normal. If not, there were talks about a liver transplant. I refuse to accept that for her because we have hope.\n\n\n\nPlease keep us all in your prayers, especially our little rainbow baby. That her little body is able to completely heal itself, and that she has no further complications and is able to live a full healthy life after this.\n\n\n\nI created a gofundme to help with current and near future medical bills for her. It would also help tremendously with her 6+ month aftercare, etc. Thank you❤️\n",
    "creationDate": "2023-11-07",
    "images": [
      "76409913_169938346717103_r.png",
      "76409913_1700810219803630_r.jpeg",
      "76409913_1699661265803675_r.jpeg"
    ],
    "numDonationsStr": "41 donations"
  },
  "fighting-childhood-cancer-the-evie-fund": {
    "slug": "fighting-childhood-cancer-the-evie-fund",
    "name": "Evelyn",
    "age": 2,
    "gender": "female",
    "disease": "Acute myeloid leukemia (AML) with KMT2A chromosomal genetic mutation",
    "raised": 102525,
    "goal": 100000,
    "url": "https://www.gofundme.com/f/fighting-childhood-cancer-the-evie-fund",
    "title": "Fighting Childhood Cancer - The Evie Fund",
    "description": "In honor of the 2nd anniversary of Evie’s bone marrow transplant on March 10th, our family is donating $25,000 via The Evie Fund at Children's Wisconsin to support Dr. Julie-An Talano's transplant research.\n\n\n\nWe are seeking to raise an additional $25,000+ from friends, family, and anyone who wants to fight back against childhood cancer. All donations are tax deductible, and will go directly towards continuing the research that saved Evie's life.\n\n\n\nEvie's Story\n\n\n\nAt 7:45pm on November 18th, 2021, we were told that our 6 week old daughter Evelyn had Leukemia.\n\n\n\n\n\nSoon after Evie was born, she started to develop bruises all over her body. At her one month well-baby visit, her doctor recommended we see a dermatologist just to be safe.\n\n\n\nAs we learned, the bruises were actually what is called leukemia cutis - blood cancer that was causing lesions under her skin. That night, we sat there holding her tiny body, staring at the disease that was trying to kill her. How could this happen?\n\n\n\nTime stopped for our family after the diagnosis. Somehow, we continued on, our bodies living and moving through each of those initial days as though in a trance, thinking about how odd it was to have to do “normal” things like changing diapers when our baby was unlikely to make it to her first birthday. The feeling was utter hopelessness.\n\n\n\nBut Evie did make it to her first birthday. And her second. And she didn’t just make it - she lives life with a sweetness and intensity that brings smiles and joy to everyone around her.\n\n\n\n\n\nEvie made it thanks to the efforts of Dr. Julie-An Talano and the unbelievable team of doctors, nurses, researchers, and supporting staff at Children’s Wisconsin.\n\n\n\nRecent advancements in the evaluation and treatment of infant leukemia, including numerous contributions by Dr. Talano, are why Evie is alive today. Initial genetic testing quickly confirmed that Evie had a sub-type of leukemia called acute myeloid leukemia (AML) that was caused by a chromosomal genetic mutation, KMT2A.\n\n\n\nResearch showed that less than half of children with this genetic mutation survived on standard chemotherapy protocols. Thanks to advances made in the last 8-10 years, we knew that Evie was headed for bone marrow transplant, where her chances of two-year survival jumped to over 70%.\n\n\n\nWhile the survival rate increases with a bone marrow transplant, they also rely on finding suitable donors - typically a sibling or one of the 40 million donors in the NMDP global donor registry.\n\n\n\nIn one of the lowest moments of our lives, we learned that Evie did not have a suitable genetic match for transplant from either of these routes. Once again, thanks to protocols and techniques established within the last decade, and championed by Dr. Talano, we were able to proceed with a stem cell transplant using Kim (mom) as Evie's donor.\n\n\n\nEvie's transplant was a success. In total, we endured 5 months of inpatient treatment, 6 months of intense outpatient treatment, and a host of bumps and scares along the way. The last two years have been both a dream and a nightmare. We are not out of the woods, but we are extremely fortunate, and we've learned to cherish every moment we've been given.\n\n\n\n\n\n10 years ago, Evie would've had almost no chance of survival without a donor match. Now, her odds are high and climbing every day she remains cancer free.\n\n\n\nWhat can we accomplish if we help fund the next 10 years of research?\n\n\n\n\n\nThank you all, and Go Evie Go!\n\n\n\n-Paul and Kim\n",
    "creationDate": "2024-03-11",
    "images": [
      "78829843_1714021333868559_r.jpeg",
      "78829843_1710388807893289_r.jpeg",
      "78829843_1710274437154670_r.jpeg",
      "78829843_1710176208922838_r.",
      "78829843_1710181228559794_r.jpeg",
      "78829843_171018126393174_r.jpeg",
      "78829843_171018130543279_r.jpeg"
    ],
    "numDonationsStr": "192 donations"
  },
  "help-the-huneycutt-family-fight-childrens-cancer": {
    "slug": "help-the-huneycutt-family-fight-childrens-cancer",
    "name": "Evelyn Huneycutt",
    "age": 4,
    "gender": "female",
    "disease": "Acute Lymphoblastic Leukemia (ALL)",
    "raised": 39289,
    "goal": 50000,
    "url": "https://www.gofundme.com/f/help-the-huneycutt-family-fight-childrens-cancer",
    "title": "Help the Huneycutt Family Fight Children’s Cancer",
    "description": "The Huneycutt family, who are an important part of the Orlando and Jewish community, are in need of our help. Evelyn, their youngest daughter, is a spunky little 4 year old beautiful girl who was admitted Monday night to the Orlando hospital where she was diagnosed with Children’s Leukemia (ALL). We are all hopeful and confident they will make it through this struggle with the strong family, friends, and medical staff around them, including her three strong big brothers.\n\n\n\nThey still need our help though and I’m asking for the community that they’ve been a part of for so long to come together for Evelyn.\n\n\n\n\n\n\n\nDespite her blood counts being extremely low and requiring transfusion, a hard time getting a central line to start chemo and lots of other scary new things for the family along the way, Evelyn has been very brave and stayed the same happy sweet girl we have all grown to love.\n\n\n\n\n\nThe family is currently at the Advent Health Orlando for children who have been amazing. It will be their home away from home on their journey these next few years including the next 6 months of intensive chemo followed by 2 years of continued treatment and testing. They are not sure what the next few years may truly be like and are fighting to make the most of every single day!\n\n\n\nWe are fighting to help give Evelyn and her family the support they need to get through it. These funds will go towards helping them keep Evelyn happy, comfortable, and entertained during her stressful time. It will also go towards helping the family with meals, bills, and unknown expenses along the way so they can focus on being there for their daughter and sister’s journey back to health.\n\n\n\n\n\n\n\n\n\nThis process is a costly one that is tolling on the entire family, even one as loved and supported as theirs. While they are all pushing through a smile to keep Evelyn’s spirits high, I know that Britney and Kyle are fighting on the inside to be strong parents for their child, family, and community. I put this page together to ask a caring community to help make a difference for a beautiful, inspirational, and loving little girl who may not know it but needs our help now more than ever.\n\n\n\n\n\nPlease consider making a small donation to help cover the extensive unexpected costs and to provide Evelyn and their family the support they need to get through these tough times. Thank you everyone for taking the time to read this, for your thoughts, and your prayers! ❤️\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAny remaining funds will go towards helping fight children’s leukemia!\n",
    "creationDate": "2022-11-11",
    "images": [
      "69284845_1668236380493895_r.jpeg",
      "69284845_1671037563884982_r.jpeg",
      "69284845_1669212496173932_r.jpg",
      "69284845_1668237079352969_r.",
      "69284845_1668237100761970_r.",
      "69284845_1668237218216473_r.",
      "69284845_1668237238438979_r.",
      "69284845_1668237255110317_r.",
      "69284845_1668237403310072_r.",
      "69284845_1668237468892557_r.",
      "69284845_1668237482581472_r.",
      "69284845_1668237198799106_r.",
      "69284845_1668257417927250_r.jpeg"
    ],
    "numDonationsStr": "226 donations"
  },
  "baby-gabriels-struggle-medical-costs": {
    "slug": "baby-gabriels-struggle-medical-costs",
    "name": "Gabriel",
    "age": 0,
    "gender": "male",
    "disease": "intestinal blockage with colostomy complications, fibrosis, and kidney dysfunction",
    "raised": 4595,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/baby-gabriels-struggle-medical-costs",
    "title": "Baby Gabriel's Struggle: Medical Costs",
    "description": "Help baby Gabriel recover from medical negligence and malpractice\n\n\n\n\n\n\n\nBaby Gabriel was born on August 24, 2023. He seemed to have been born a healthy baby until his first two days of life. He was rushed to medical care due to a blockage in his intestine and required colostomy surgery.\n\n\n\n\n\n\n\nAfter frequent visits to the emergency room and treatment at Driscoll Children’s Hospital in Edinburg, TX, Gabriel’s mother knew he was in urgent need of another doctor’s opinion and evaluation. A doctor in Colorado, an angel in disguise, looked over Gabriel’s medical history and confirmed medical negligence. Gabriel’s mother had no choice but to get private insurance to have surgery done in Colorado. He suggested an emergency surgery to do a colostomy reversal, but it had been too late. Gabriel’s intestine had developed fibrosis, and the surgery wasn’t successful. There have been 5 surgeries with baby Gabriel, and no one had discovered his kidney is only working 30%. He now has to undergo yet another surgery. More than $50K has gone to baby Gabriel’s medical expenses, which has left his family with a financial burden. The family will use these funds to cover medical expenses.\n\n\n\n\n\n\n\nThank you for your donations and God bless you.\n\n",
    "creationDate": "2025-02-22",
    "images": [
      "88212783_1740248905929656_r.png"
    ],
    "numDonationsStr": "56 donations"
  },
  "hope-for-harper-help-fight-rare-pediatric-cancer": {
    "slug": "hope-for-harper-help-fight-rare-pediatric-cancer",
    "name": "Harper",
    "age": 1,
    "gender": "female",
    "disease": "stage 3 Sertoli-cell ovarian cancer",
    "raised": 25924,
    "goal": 12000,
    "url": "https://www.gofundme.com/f/hope-for-harper-help-fight-rare-pediatric-cancer",
    "title": "Support Harper & Help Fight Rare Pediatric Cancer",
    "description": "Join Harper's Fight Against Cancer and Stand Up for Kids with Rare Cancers.\n\n\n\n\n\n\n\nHarper is a 1.5-year-old warrior who has been battling stage 3 ovarian cancer since she was 10 months old. While perfectly healthy up until that day in November, her dad noticed a hard mass in her abdomen while changing her diaper. We took Harper to pediatric urgent care as well as her pediatrician, and the doctors believed this mass was due to constipation. As her parents, we pushed for an ultrasound, believing in our gut that something was not right, and as a result, on 12/3/2024, doctors discovered an 11 cm Sertoli-cell ovarian tumor that had already spread to her lymph nodes. Nothing can prepare a parent to hear the news that their child has cancer. Harper's cancer is incredibly rare and, according to her doctors, the youngest recorded case of this tumor that they can find. With very little information out there, her doctors have been working tirelessly to come up with the best plan for treatment, not knowing whether chemotherapy will work and if so, which drugs will be effective.\n\n\n\n\n\n\n\nHarper is being treated at Memorial Sloan Kettering Cancer Center and has demonstrated strength, resilience, and bravery through every step of this battle. The day after discovering the tumor, she had surgery to remove her ovary, fallopian tube, and some pelvic lymph nodes. Since then, she has received 7 rounds of chemotherapy as well as the awful side effects that come with it. Harper had two more 8-hour surgeries (in March and June) to dissect retroperitoneal lymph nodes that were infected as well. With such little information available regarding Sertoli-cell tumors in babies, Harper continues to be monitored frequently with MRI scans as well as PET scans. We are hopeful that the worst is behind us but are also very aware that any changes on these scans will lead to further surgeries and treatment.\n\n\n\n\n\n\n\nHope for Harper\n\n\n\n\n\n\n\nHarper demonstrates her resilience and strength every single day. She has the chubbiest cheeks and the best smile. From the time she was 10 months old, she endured 3 major abdominal surgeries, impacting her core strength and ability to learn to walk. With the help of rehabilitation doctors, physical therapists, and custom orthotics, at 19 months old, Harper began to walk. Within weeks of learning to take her first steps, she was already trying to ride her big sisters' scooters around. Harper is a force to be reckoned with, and despite so many nights spent in the hospital, the chemotherapy, needles, anesthesia, surgeries, scars, hair loss, neuropathy, medicine, and vomiting, she wakes up happy and with the biggest smile on her face. While only 20 months old, Harper speaks in sentences and loves to boss her parents and sisters around.\n\n\n\n\n\n\n\nYour Support Helps\n\n\n\n\n\n\n\nWe have been overwhelmed by the outpouring of love and support from family, friends, and strangers. So many people have reached out over the last 10 months through messages, care packages, meals, or simply asking how they can help. We never imagined ourselves to be in this position, but the love and support we have received has helped us through some of the most difficult days. Harper's mom has taken leave from work for the time being to help support her through ongoing doctor appointments, scans, and physical therapy.\n\n\n\n\n\n\n\nWhile we do not yet know what Harper's medical expenses will look like long-term, we have been managing for now. We hesitated to set up a GoFundMe for that very reason. However, through many generous and caring people reaching out, we recognize that many people want to contribute in a meaningful way. Funds raised will go directly toward Harper's medical care and related expenses as well as funding research for rare pediatric cancers through MSK.\n\n\n\n\n\n\n\nHow You Can Help\n\n\n\n\n\n\n\nYour support, whether through a donation, sharing this page, or simply keeping Harper in your prayers, means the world to us. Every contribution, big or small, will help support Harper's fight while also advancing research to give hope to other children battling rare cancers.\n\n\n\n\n\n\n\nWe have an amazing team of doctors at MSKCC. Harper's oncologist, Dr. Julia Glade-Bender, surgeon Dr. Justin Gerstle and Talia Sauerhaft, NP, are just a few of the incredible heroes fighting tirelessly for our little girl and other children battling rare cancers. They have provided exceptional care and unwavering dedication. We are beyond grateful for their expertise, compassion, and commitment to advancing treatments for children like Harper.\n\n\n\n\n\n\n\nFrom the bottom of our hearts, thank you for standing with us, for Harper, and for every child fighting this fight.\n\n",
    "creationDate": "2025-10-08",
    "images": [
      "95454491_1759929873332981_r.png"
    ],
    "numDonationsStr": "300 donations"
  },
  "support-3-year-old-harper-family": {
    "slug": "support-3-year-old-harper-family",
    "name": "Harper Raye Fraps",
    "age": 3,
    "gender": "female",
    "disease": "esophageal injury from swallowed battery",
    "raised": 7795,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/support-3-year-old-harper-family",
    "title": "Support 3 Year Old Harper & Family",
    "description": "My name is Jessie Joye, stepsister to Jeffrey Fraps. Jeffrey, Marcus, and I shared the loss of a brother, Michael, when he was two. A lifetime of heartache, anger, and often time isolation followed our family. No one should have to go through this twice. And yet, here we are…again.  \n\n\n\nMy brother Jeffrey and his wife, Kara, have embarked on their own nightmare of despair and uncertainty with one of their own little princesses, Harper Raye.  Jeffrey and Kara need your help right now more than ever. Their beautiful blue eyed three year old little Harper is under sedation as they await the unknown.  Acid from a swallowed battery slowly eats away through her esophagus traveling directly towards an artery to her heart. With multiple recommendations to save her and all of them life threatening.  Jeffrey’s life as he knows it is at a stand still. \n\n\n\nA mother’s instinct is the one thing that Harper has in her favor. A junk drawer is where most household batteries are placed. When Kara noticed a battery cover had fallen off a toy she immediately removed the battery and placed it in the junk drawer. Some time later she noticed the drawer was open and observed that the battery was missing. Because of their swift actions and rushing Harper to emergency they have given her the gift we are most blessed to be given, time.\n\n\n\nKara, Harper, and Harper’s 7 week old sister, Elaina will be flying to Stanford immediately. Jeffrey, Raylee age 9 and Kenzie age 7 will follow shortly behind them by car. They will be in California for up to two months where they have a two month window of possible risk to Harper’s heart. She will be under 24 hour observation with her family next to her. \n\n\n\nJeff and Kara’s income is based solely on their own business where Jeff plows away snow and manages residential property maintenance, himself. Family and friends have come forward to carry on business needs for Jeff while he is gone but this is not sustaining. Until they know how they will recover financially any immediate help they can receive now will remove a burden that should never interfere with the hope and healing of a child. Medical Expenses are guaranteed to be high, including travel costs, and business losses. The future financial burden is inevitable but the gift you can provide today will make one small obstacle during this storm, bearable. \n\n\n\nWhen asked for something to share from Harper’s parents all they wanted to do was share about their little Harper:\n\n\n\n“She is the sweetest most loving big and little sister in the whole world! She is a best friend to everyone especially her mommy and daddy ❤ Harper loves to color and play with her cocomelon toys! She loves to be with her big sisters and is enjoying every minute with baby Elaina. She is so much fun to talk to and her imagination is endless. Harper is the sweetest little girl and wants to make best friends and ‘Go to school to make more little friends.’ Her favorite movie is toy story.”\n\n\n\nLet your prayers, love and support go ‘to infinity and beyond!” \n",
    "creationDate": "2022-01-08",
    "images": [
      "62484445_1641668943125407_r.png"
    ],
    "numDonationsStr": "87 donations"
  },
  "help-little-hazal-fight-leukemia": {
    "slug": "help-little-hazal-fight-leukemia",
    "name": "Hazel",
    "age": 7,
    "gender": "female",
    "disease": "Leukemia",
    "raised": 2950,
    "goal": 20000,
    "url": "https://www.gofundme.com/f/help-little-hazal-fight-leukemia",
    "title": "Help Little Hazel Fight Leukemia",
    "description": "Dear friends, family, and kind-hearted supporters,\n\n\n\nWe are reaching out with heavy hearts to ask for your support for this family from Chatham Ontario who have a beautiful 7-year-old girl named Hazel, who has been diagnosed with a rare and aggressive form of leukemia.\n\n\n\nHazel’s world changed overnight. Once a bubbly, energetic little girl full of laughter and life, she is now courageously battling cancer with a strength far beyond her years. Her parents, Chris and Stephanie, have been by her side every step of the way—traveling back and forth from their home to the Ronald McDonald Children’s Cancer Centre in London, Ontario, where Hazel is receiving intensive treatment. While still caring and focusing on there other 14 year old daughter Lillie.\n\n\n\nAs you can imagine, this journey has taken an emotional, physical, and financial toll on the family. Chris and Stephanie have had to take extended time off work to care for Hazel full-time, attend countless medical appointments, and manage the difficult day-to-day realities of having a child with cancer. The mounting travel costs, hospital stays, meals, and lost income are creating a serious financial burden—on top of the unimaginable emotional stress they are already enduring.\n\n\n\nWe are creating this GoFundMe to help ease the pressure on this loving family so they can focus entirely on what matters most: helping Hazel heal.\n\n\n\nYour donation—no matter the amount—will go directly toward:\n\n\n\nTravel and accommodation expenses for treatments in London\n\n\n\nDay-to-day living costs while Chris and Stephanie are off work\n\n\n\nMedical-related expenses not covered by insurance\n\n\n\nSupport for Hazel's ongoing care and comfort\n\n\n\nHazel is a fighter, and her family is doing everything they can to support her through this battle. But they need our help. Please consider donating or sharing this campaign to help bring hope, stability, and a little peace to a family in crisis.\n\n\n\nThank you from the bottom of our hearts for your generosity, kindness, and prayers.\n\n\n\nWith love,\n\n\n\n#HazalStrong #HelpHazalHeal\n",
    "creationDate": "2025-06-15",
    "images": [
      "91865117_1749994438293780_r.png",
      "91865117_1749992327186122_r.jpeg",
      "91865117_1749992327256514_r.JPG",
      "91865117_1749992327374664_r.JPG",
      "91865117_1749994502195891_r.jpg",
      "91865117_17499923271536_r.JPG",
      "91865117_175055477486641_r.jpeg",
      "91865117_1750554819338402_r.jpeg"
    ],
    "numDonationsStr": "21 donations"
  },
  "hudsons-childhood-cancer-journey": {
    "slug": "hudsons-childhood-cancer-journey",
    "name": "Hudson Adamo",
    "age": 6,
    "gender": "male",
    "disease": "Cancer",
    "raised": 70125,
    "goal": 60000,
    "url": "https://www.gofundme.com/f/hudsons-childhood-cancer-journey",
    "title": "Hudson's Childhood Cancer Journey",
    "description": "Hudson is an amazing 6 year old boy who always has a smile on his face. His spirit and heart is contagious to all those around him. Recently, the Adamo Family received some news that turned their world upside down. Hudson was diagnosed with advanced stages of cancer. Doctors have put together a treatment plan of 3-5 years and Hudson will begin with chemotherapy this week.\n\n\n\nCalla and Mike have dedicated their life to helping others though their lines of work as an ER Nurse and Firefighter. They are always the first ones to step up and lend a helping hand to others around them. Now, its our turn to help them. The money raised will go towards medical expenses that will quickly add up, weekly trips to Children's Hospital, and essentials for their beautiful family of 6.\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "creationDate": "2021-10-13",
    "images": [
      "60539611_163412736633401_r.jpeg",
      "60539611_1703114411305869_r.jpeg",
      "60539611_1703114421834245_r.jpeg",
      "60539611_1703114432299218_r.jpeg",
      "60539611_1703114440529760_r.jpeg",
      "60539611_1703114449489799_r.jpeg",
      "60539611_1695075070273511_r.jpeg",
      "60539611_1695075081515568_r.jpeg",
      "60539611_1695075093286671_r.jpeg",
      "60539611_1662162123631131_r.jpeg",
      "60539611_1662162200749967_r.jpeg",
      "60539611_1662162292618990_r.jpeg",
      "60539611_1642482418851758_r.jpeg",
      "60539611_1642482452236316_r.jpeg",
      "60539611_1642482505254532_r.jpeg",
      "60539611_1635373634602460_r.jpeg",
      "60539611_163425243525807_r.jpeg",
      "60539611_1634129359165813_r.",
      "60539611_1634129147539362_r.",
      "60539611_1634129191106817_r."
    ],
    "numDonationsStr": "614 donations"
  },
  "izzys-medical": {
    "slug": "izzys-medical",
    "name": "Izzy",
    "age": 6,
    "gender": "female",
    "disease": "Systemic Scleroderma and bladder birth defect with ureter reflux and hutch diverticulum",
    "raised": 4165,
    "goal": 20000,
    "url": "https://www.gofundme.com/f/izzys-medical",
    "title": "Izzy's Medical Needs",
    "description": "\n\n\nIzzy (6 yrs old on August 5th) was diagnosed with Systemic Scleroderma when she was a year and a half old, so she's no stranger to doctors and hospitals. This time we're not dealing her Scleroderma, we're dealing with a birth defect in her bladder.\n\n---\n\nScleroderma is a rare disease that affects connective tissue and the vascular system. Generally classified as an autoimmune rheumatic disease, an overproduction of collagen (fibrosis) hardens tissue and damages organs. Commonly affecting the skin (called localized), scleroderma also affects internal organs (systemic sclerosis) and can be life-threatening. Anyone can have scleroderma. No one knows what causes the disease, although there are many clues including genetic predisposition. There is no cure and no drugs that halt the progression of the disease or reverse it. The fibrosis at the center of scleroderma makes it prototypic for all other fibrotic diseases.\n\n---\n\nShe has reflux in her ureter tubes and at least one hutch diverticulum in her bladder caused by a thin bladder wall. A third doctor claims he sees a second hutch. But we aren't sure. (A hutch is a pocket on the side of her bladder that holds urine and becomes easily infected.) Her ureter tubes have reflux meaning her urine is going back up into her kidney causing infection. This means that Izzy can't control her bladder and is constantly getting kidney and bladder infections. She starts school in a few weeks and will have to deal with incontinence in the middle of a class full of kids. Surgery is scheduled for Sept 9th. Until they go in and see what's going on they aren't sure if they're going to repair the hutch and the tubes, or if they're just going to do what's called a deflux to prevent the reflux of urine in the tubes. So she may be in the hospital 24hrs or an entire week depending on what they find.\n\nPayment is due the week before the surgery for Izzy's urologist, Dr. Nosnik's portion. Dr. Nosnik has been her urologist for over a year so he knows the case well. His price for the surgery is $8,253.00.\n\nWe are still waiting on Dallas Children's to call us with a price that they'll send to her Medi-Share insurance plan. We won't know how much medi-share will pay, if any, until after we file the bill after the procedure. She was recently in the hospital for a week at Cook's Children's Hospital Fort Worth and the cost for that stay was around 23k, with no help from insurance.\n\nWe're trying to help Izzy's mom, Tessa, with bills so she doesn't have to worry about how to pay while focusing on Izzy getting better. Anything you can donate will help.\n",
    "creationDate": "2021-08-02",
    "images": [
      "58896469_1627956965716063_r.jpeg",
      "58896469_1627958427277381_r."
    ],
    "numDonationsStr": "36 donations"
  },
  "jacer-all": {
    "slug": "jacer-all",
    "name": "Jace Russell",
    "age": 4,
    "gender": "male",
    "disease": "B-Cell Acute Lymphoblastic Leukemia",
    "raised": 3855,
    "goal": 20000,
    "url": "https://www.gofundme.com/f/jacer-all",
    "title": "Baby Jace's Medical Expenses",
    "description": "As some may know, what was suppose to be a normal pediatrician visit turned into something much more for the Russell family. On December 13, 2017, Jace was diagnosed with B-Cell Acute Lymphoblastic Leukemia. Jace will be visiting Texas Childrens Hospital in Houston once a week for 9 months for treatment and if all goes well once a month for 2 and a half years. His parents, Jill and Justin are also expecting their second child in March of 2018, a baby girl.  Along with this, Justin's job is the only form of income. This will be a long journey, so any donations are greatly appreciated. If you are unable to donate we ask you to lift them up in prayer for we know God will make a way. Donations are accepted here or direct through his mom's paypal via paypal.me/JillianRussell just leave a note saying it's for Jace. Thank you, The Russell Family---As of September 2018, we have updated about each of the stages he has gone through thus far, and what is to be expected from now until end of treatment. \n",
    "creationDate": "2017-12-16",
    "images": [
      "26273830_1513441459.0307.jpg",
      "26273830_1536606738384994_r.jpeg",
      "26273830_1536606878705207_r.jpeg",
      "26273830_153660690639276_r.jpeg",
      "26273830_1536606950324517_r.jpeg",
      "26273830_1536606989788929_r.jpeg",
      "26273830_1536607026874348_r.jpeg"
    ],
    "numDonationsStr": "25 donations"
  },
  "uad896-help-jack-beat-cancer": {
    "slug": "uad896-help-jack-beat-cancer",
    "name": "Jack Corr",
    "age": 3,
    "gender": "male",
    "disease": "metastatic neuroblastoma",
    "raised": 22599,
    "goal": 50000,
    "url": "https://www.gofundme.com/f/uad896-help-jack-beat-cancer",
    "title": "Help Jack Beat Cancer",
    "description": "\n\nThis is for my sister Jessica Corr and her husband Tim and son Jack. Upon hearing the news of her family’s situation, so many people have reached out to me asking what they can do to help. My nephew Jack (who is three years old) has been diagnosed with metastatic neuroblastoma which is stage four of one of the most complex and serious childhood cancers. He is very seriously ill and currently in the ICU at Seattle Children’s hospital on high flow oxygen support and a feeding tube as tumors have taken over much of his lungs and are all throughout his abdomen. He has cancer through several different parts of his body and will need a very aggressive treatment in order to make it. Jessica is two weeks away from giving birth to their third child and Tim just returned 3 weeks ago from being deployed in Poland with the National Guard. Because Jack’s cancer is so advanced, it will take a very aggressive and long-term approach requiring the use of several different treatments including chemotherapy, radiation, surgery, immunotherapy, and a bone marrow transplant in order to fight it appropriately. His doctors estimate his treatment will take about 18 months to complete. With all of this in mind, we have estimated the cost after insurance will be about $50,000 (between medical bills and any in-home care that Jack will need as he is not doing great on his own). I also ask for your continued faith and prayers that Jack will not only make it but go onto thrive and have a great and healthy life. For those uncomfortable using go fund me (because I do know they do take a certain percentage of the funds) I will also post Jessica‘s Venmo here if people would like to donate to her directly. Thank you to all of you who are willing to help even in a small way. The emotional cost of having a child suffering from cancer and adding to it delivering a new baby is really heavy and so I am hoping that with some of their financial burden lifted it will be a little easier to bear. Thank you all for being willing to help.\n\n\n\n\n\n\n\n\n\n\n",
    "creationDate": "2022-03-12",
    "images": [
      "63972395_1647152463444503_r.jpeg",
      "63972395_1658084959192222_r.jpeg",
      "63972395_1647493658389449_r.jpeg",
      "63972395_1647388176796424_r.jpeg",
      "63972395_1647154577457464_r.jpeg",
      "63972395_164715278738568_r.",
      "63972395_1647152871328920_r.",
      "63972395_1647152748132108_r.",
      "63972395_164715270568772_r."
    ],
    "numDonationsStr": "214 donations"
  },
  "aiming-to-save-a-life": {
    "slug": "aiming-to-save-a-life",
    "name": "Jamie",
    "age": 2,
    "gender": "male",
    "disease": "Ewing Sarcoma",
    "raised": 50,
    "goal": 2600,
    "url": "https://www.gofundme.com/f/aiming-to-save-a-life",
    "title": "Life for Jamie",
    "description": "I'm the grateful aunty of my 2-year-old nephew, who has just been diagnosed with a tumor in his brain called Ewing Sarcoma. This baby boy is so full of life, and now has to begin chemo/radiation treatments for this terrible illness we were told he was born with. His short little life has been nothing but horrific circumstances after horrific circumstances. This boy and his single parent, his mom, can't seem to get a break on life! Jamie (my nephew) has suffered from his father's domestic abuse, was saved multiple times by his abused mommy (thank God for her protection skills), being without a home and living in a car, to moving to Florida for safety reasons, and having their apartment (their new \"safe haven\") washed away by hurricanes! And once again, homeless except for life in mommy's car! Mom is not being offered employment opportunities due to the fact she is Jamie's only support system and has to work full-time! They have tried multiple ways to get financial help from the government and are told funds are backed up, minimally 8 months away... possibly longer. They have so many more struggles... too many to list.\n\n\n\nNow on top of everything else, a diagnosis of cancer in this 2-year-old!\n\n\n\nAsking for financial support until, hopefully, they get the situation a bit more under control. For those of you who are asking about the medical bills...\n\n\n\nFortunately, John Hopkins Children's Cancer in Florida will help a tremendous amount with treatments/care for Jamie... we praise God for that! And will continue our prayers. Yet a little financial stability could go a long way in so many ways for them. Up until these issues, Jamie's mom, Lexi, was working as a full-time CNA wanting to start nursing school... then the domestic abuse began and their whole world changed for the worst.\n\n\n\nMy wish is that others can open their hearts, show some compassion toward Lexi and Jamie, this story, and hopefully be able to help... even a small amount would be greatly appreciated by all of us!\n\n\n\nPeace and love to all of you... thanks so much for your consideration towards donating.\n",
    "creationDate": "2025-10-17",
    "images": [
      "95646171_1760484419348112_r.png",
      "95646171_1760484490148890_r.jpg",
      "95646171_1760484490266838_r.jpg"
    ],
    "numDonationsStr": "1 donation"
  },
  "help-jax-and-family-with-medical-expenses": {
    "slug": "help-jax-and-family-with-medical-expenses",
    "name": "Jax",
    "age": 3,
    "gender": "male",
    "disease": "ALL Leukemia",
    "raised": 1895,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/help-jax-and-family-with-medical-expenses",
    "title": "Help Jax and family with medical expenses",
    "description": "We just found out that our 3 yr old son Jax has ALL Leukemia. We need some help with medical bills and bills. We only have one income and 2 other child that still need to be cared for that cannot come here due to covid. This is going to be a long road, they say at least 2 1/2yrs of a lot of hospital trips and stays. Jax cannot leave the hospital for several weeks as of now. Anything is greatly appreciated. Thank you everyone for your support. Will update as we find out more.#Jax strong",
    "creationDate": "2021-05-31",
    "images": [
      "57454189_1622506680949182_r.jpeg"
    ],
    "numDonationsStr": "28 donations"
  },
  "jett-machs-medical-bills": {
    "slug": "jett-machs-medical-bills",
    "name": "Jett Mach",
    "age": 6,
    "gender": "male",
    "disease": "thrombocytopenia",
    "raised": 2335,
    "goal": 50000,
    "url": "https://www.gofundme.com/f/jett-machs-medical-bills",
    "title": "Jett Mach’s Medical Bills",
    "description": "Disclaimer:  I have permission to do this Go Fund Me from Jett’s Parents, Chad and Jessica.   \n\n\n\nThis little full of life little boy, Jett, has been through a lot these last 2 months while Mom and Dad get to deal with the hard stuff of medical bills from all of this.   \n\n\n\nIt all started September 11, 2022 while out playing at Dropzone, a trampoline park, when Jett hit his knee to his forehead.   He then went to school and a kid swinging his back park hit Jett in the exact same spot.  It was at this point that more bruises started showing up.  \n\n\n\nThe bruise on his forehead was huge and other bruises were rapidly forming from something as simple as falling down on the ground.  His parents took him to the Emergency Room and they didn’t find anything wrong with him.    So Chad and Jessica took him down to Children’s Hospital in Omaha, NE and they found out that his platelets were so low that any other fall could have been detrimental.  They stayed at the Hospital for quite some days until the platelets came up so it was safe to take him home.  \n\n\n\nThey’ve been to Children’s so many times either staying there or in outpatients to lessen the costs.  It’s not over yet but at least he is now over 50k platelet count but normal range is above 150k so he isn’t out of the woods just yet.  \n\n\n\n It’s been a very grueling process and also not cheap.   I’m asking for them to help cover medical expenses.  I, Jim, Thank You for any and all donations! \n",
    "creationDate": "2022-11-10",
    "images": [
      "69264565_1668144577251467_r.jpeg"
    ],
    "numDonationsStr": "16 donations"
  },
  "baby-john-nicu-medical-expenses": {
    "slug": "baby-john-nicu-medical-expenses",
    "name": "John Jr",
    "age": 0,
    "gender": "male",
    "disease": "Premature birth complications",
    "raised": 2560,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/baby-john-nicu-medical-expenses",
    "title": "Baby John’s NICU medical expenses",
    "description": "Dear family and friends, I am raising money to help with the unexpected early arrival of my baby boy John Jr aka JJ. I was only 22 weeks pregnant when my water broke and was immediately admitted to the hospital and put on strict bed rest. I had no complications prior to my water breaking so the reason is still unknown. The goal was to stay pregnant as long as possible so the chances of him surviving would be greater. I was able to hold on for another 2 weeks but on Sunday March 10, 2019 my baby boy arrived, 4 months early by emergency c section. He was only 1lb 6oz. I was told by many doctors of all the risks of going forward with the pregnancy but my faith was strong and I knew in my heart that my baby boy belonged here. He was the gift that I’ve been waiting for my entire life. I knew that the road ahead would be tough but I was willing to do whatever it took to make sure he grew healthy and strong. We have now been in the NICU for 120 days and counting. He has come a long way but still has a ways to go, with his heart and lungs being the main focus. My baby is a true fighter and even on the days when I’m feeling overwhelmed and just worried about every little thing, he gives me this look that to me, says “mommy everything will be ok”.  I must admit, he is a lot stronger than me. After being poked & pricked, all the tubes, machines, monitors, and medications, he has proven that! And he inspires me everyday. If anyone would like to make a donation so that I can time off to care for him when he comes home and to help with the heavy medical expenses It would be greatly appreciated! ❤️❤️",
    "creationDate": "2019-07-10",
    "images": [
      "40498694_1575413988186242_r.jpg",
      "40498694_1564177555776858_r.jpeg"
    ],
    "numDonationsStr": "44 donations"
  },
  "support-for-baby-jjs-medical-journey": {
    "slug": "support-for-baby-jjs-medical-journey",
    "name": "Jordan James Didericksen",
    "age": 0,
    "gender": "male",
    "disease": "esophageal atresia and tracheoesophageal fistula",
    "raised": 1925,
    "goal": 6000,
    "url": "https://www.gofundme.com/f/support-for-baby-jjs-medical-journey",
    "title": "Support for Baby JJ's Medical Journey",
    "description": "Hello, the Didericksen family has experienced some unexpected medical problems with their newborn son Jordan James who was born just 2 days ago. What they thought was just pneumonia was actually a symptom and result of him having esophageal atresia and Tracheoesophageal fistula.\n\n\n\nJJ hasn't been able to or interested in eating since birth. That, along with him consistently spitting up mucus and fluid, led Carlie and her husband to take him to Primary Children's Hospital. They immediately got him in and started running tests (echo, X-rays, etc.) and when they were unable to place an NG tube, they realized that his esophagus wasn't connected to his stomach.\n\n\n\nJJ is expected to go into surgery tomorrow, June 17. A week after that, he will hopefully be able to start eating breastmilk. They have told Carlie to expect about a month stay.\n\n\n\nWe are putting together this GoFundMe to help with the expenses of the surgery/hospital stay, food while his parents are at the hospital and away from home and help with whatever else they'll need during this time.\n",
    "creationDate": "2024-06-16",
    "images": [
      "80794955_1718552097898816_r.jpeg"
    ],
    "numDonationsStr": "33 donations"
  },
  "support-keonis-fight-against-neuroblastoma": {
    "slug": "support-keonis-fight-against-neuroblastoma",
    "name": "Keoni",
    "age": 0,
    "gender": "male",
    "disease": "Neuroblastoma",
    "raised": 69138,
    "goal": 65000,
    "url": "https://www.gofundme.com/f/support-keonis-fight-against-neuroblastoma",
    "title": "Support Keoni's Fight Against Neuroblastoma",
    "description": "\nOn Sunday Sept 29th, our lives forever changed. We woke up to shrill cries coming from the room of our 5-month-old baby boy. When I picked Keoni up, I noticed he was hot to touch, his right eye was drooping, and his pupils were unequal. A golf ball-sized lump on the right side of his neck was inhibiting his ability to straighten his neck. \n\nWe went to the ER and were then told we needed to be transferred to a Children's Medical Center for a higher level of care. After an ambulance ride, blood tests, X-rays, MRIs, and days of anxiously waiting for a diagnosis, the doctor entered our room and introduced himself as the Oncologist. He told us what every parent fears hearing - \"the results show your baby most likely has cancer - neuroblastoma.\"\n\nKeoni's scans show he has a tumor on the right side of his neck slightly shifting his trachea, a tumor on the right side of his spine slightly shifting his lung, and multiple masses in his enlarged liver. \n\nWe feel like we're living in a bad dream that we wish we could wake up from. A few weeks ago, Keoni was playing and laughing with his grandparents visiting from CA and TX. \n\nDays now are filled with doctor appointments, blood tests, biopsies, medicine, conversations about plans, updating family, and waiting for results and next steps. \n\nKeoni will soon undergo a surgical procedure to insert a central IV catheter in one of his major veins close to his heart for 6 to 12 weeks of chemotherapy. \n\nDuring this time, we have taken a personal leave of absence from work and are spending quality time caring for Keoni. \n\nKeoni's sweet smile and playful energy when he feels well give us strength for the moments he doesn't feel well, as we share hours consoling and holding him in our arms.\n\nWe are so blessed to have loving family in CA & TX and friends in NYC and beyond reaching out, checking in, and showing support. We are eternally grateful. \n\nWe so appreciate all the offers for help and support during this difficult time as we navigate this diagnosis and treatment. \n\nIf you feel called to offer support to help us with possible treatment options, bills, food, and travel to/from the hospital while we are caring for Keoni and not at work, we truly appreciate it. \n\nOr\n\nIf you work at Northwell Health, please consider donating 1 PTO day: \n\nSign into MyExperience > click 'Help' tab > click 'HR Service Request' >\n\nClick 'Create Service Request' >\n\nin Category of Service Request, type or scroll to 'PTO Donation Form' >\n\nin Service Request Details type 'Donating PTO to Sara Choi Person ID # 239425 for Personal Leave of Absence to care for child during illness' \n\nThank you so much for all of your love, prayers, and support as we pray in hope and faith for pain relief, healing, strength and full recovery for our loving baby boy, Keoni. \n",
    "creationDate": "2024-10-09",
    "images": [
      "83339413_1728483570779603_r.jpeg",
      "83339413_175242239361027_r.png",
      "83339413_1752422392983257_r.png",
      "83339413_1752422392975080_r.png",
      "83339413_1742318436721751_r.png",
      "83339413_1742318436700528_r.png",
      "83339413_1742318436745771_r.png",
      "83339413_1739580167359232_r.png",
      "83339413_1739580167330868_r.png",
      "83339413_1739580167464289_r.png",
      "83339413_1734919136447390_r.jpg",
      "83339413_1734919136688959_r.jpg",
      "83339413_1734919135537848_r.jpg",
      "83339413_1731355960471917_r.png",
      "83339413_1731355960456983_r.png",
      "83339413_1731355960436085_r.png",
      "83339413_1730043882185782_r.png",
      "83339413_1730043882227672_r.png",
      "83339413_1730043882516845_r.png",
      "83339413_1729358908829915_r.png",
      "83339413_1729358908517573_r.png",
      "83339413_1729358908677769_r.png",
      "83339413_1728764862637435_r.png",
      "83339413_1728764862952131_r.png",
      "83339413_1728764862642084_r.png",
      "83339413_1728492400559304_r.jpeg"
    ],
    "numDonationsStr": "546 donations"
  },
  "emergency-medical-expenses-for-our-baby-kingstin": {
    "slug": "emergency-medical-expenses-for-our-baby-kingstin",
    "name": "Kingstin",
    "age": 1,
    "gender": "male",
    "disease": "severe burns from hot oil accident",
    "raised": 5580,
    "goal": 7000,
    "url": "https://www.gofundme.com/f/emergency-medical-expenses-for-our-baby-kingstin",
    "title": "Emergency medical expenses for our baby Kingstin.",
    "description": "Sunday started off the same as every other day, playing with the kids and spending time with the family. We were making our usual buffalo wings and getting ready to watch football when a terrible freak accident happened. \n\nWhile moving the frying oil from the stove the handle of the pan broke and the hot oil spilled. Sadly, it spilled and splashed onto and severely burned our sweet baby Kingstin. We immediately ran him under ice cold water. Once we took off his clothes, we knew right away we had to come straight to the ER. From there we were told he would need to be transferred to a burn unit (there is only 1 in the state of NJ). A few hours later we were finally where he needed to be to get the care he required.\n\nThe doctors let us know that the majority of his burns are second degree, but there was one area of his body in particular that was concerning. The care team here has been fantastic but our baby has a lot of healing to do. We will most likely be here in the burn unit for a minimum of 7-10 days. Each day he is taken into the “burn tank” where his team changes his dressings and assesses his healing and what to do next. We are still waiting to get final word on whether or not he will need any grafts.\n\nIf you don’t know about burn healing, it’s a lot of wait and see what the body can do on its own. So this is where we are now.\n\nMom and Dad are trying our best to keep King as comfortable as possible with lots of love and gentle snuggles. Both Nanas are doing a spectacular job helping with Ashlin and little Colin, we wouldn’t be able to get through this without them.\n\nWe are reaching out to all of you for a bit of help to offset some of the medical expenses as well as to ask that you keep King in your prayers and thoughts. We will take all the healing vibes we can get for him! He has been such a strong little guy throughout this whole process! \n\nThank you all for your help, love, calls, and well wishes! He is a fighter and he is definitely #KingstinStrong!\n\n❤️ The Senior Family\n",
    "creationDate": "2023-02-01",
    "images": [
      "70832563_1675258881137856_r.jpeg",
      "70832563_1675785460707673_r.jpg",
      "70832563_1675549809227380_r.jpg",
      "70832563_1675469355405389_r.jpg",
      "70832563_1675373937609740_r.jpg",
      "70832563_1675270261640145_r.jpg"
    ],
    "numDonationsStr": "54 donations"
  },
  "3on218w": {
    "slug": "3on218w",
    "name": "Kylie Ann Pruitt",
    "age": 2,
    "gender": "female",
    "disease": "cancer with tumor",
    "raised": 13949,
    "goal": 25000,
    "url": "https://www.gofundme.com/f/3on218w",
    "title": "Kylie's Fight Against Child Cancer",
    "description": "\"Our sweet Kylie Ann Pruitt\"Kylie was born March 30, 2015. That day She changed all of our lives forever. From the first glimpse we were all so joyful with getting to finally meet her. Sara Pruitt her mother was so brave being a young mother that she was and with her husband Grant Pruitt. Kylie had a specific spot in each one of our hearts and continues to keep us here on our feet and making memories.On April 21st 2017 we found out that Kylie has a tumor which is cancerous. We are very early in the stages to see where this will lead in her early life and getting to know more about it as the days go by. There are still many test that need to be done and surgery. She will begin Chemotherapy in this next week to try and shrink the tumor so it can be removed. We do not know exactly how all of this will work or how long it will take so that we can bring our precious Kylie home where she belongs. We are asking for your prayers and your guidance through this journey with our Kylie. Campaign created by Bradley Gray",
    "creationDate": "2017-04-22",
    "images": [
      "19852132_14929115150_r.jpg",
      "19852132_14930025320_r.jpg"
    ],
    "numDonationsStr": "148 donations"
  },
  "medical-expenses-for-baby-kynnidi": {
    "slug": "medical-expenses-for-baby-kynnidi",
    "name": "Kynnidi",
    "age": 0,
    "gender": "female",
    "disease": "eye injury",
    "raised": 21496,
    "goal": 48000,
    "url": "https://www.gofundme.com/f/medical-expenses-for-baby-kynnidi",
    "title": "Medical Expenses For Baby Kynnidi",
    "description": "My name is Kynnidi, I am 10 months old. My mommy and I live in Southern Idaho. My mommy is the best mommy in the world. She works so hard for me and our dog, Dodge.  She loves me so much and she is my world.  I hurt my eye when I was playing with my toys. The doctor here said that I need to see a special doctor who works with kids my age. \n\n\n\nMy mommy and I will be taking a road trip to Utah very soon. Mommy says that I will have to go to sleep for a while so they can take special pictures of my head and eye.  Then after that the doctor will let my mommy, and I hope me too, know what is wrong and what they can do to fix my eye.\n\n\n\nMy mommy will need to take off a lot of time from work to take care of me. We will need to travel to Utah a lot and my doggy will need someone to watch him while we are traveling too. \n\n\n\nMy Ama said that she needed my help with this letter, and she would get the fund raiser started to help with my doctor and travel costs.\n\n\n\nThank you so very much for your donation to help with my medical expenses for my eye! \n\n\n",
    "creationDate": "2023-05-27",
    "images": [
      "73104331_1685172249239161_r.jpeg",
      "73104331_1713347993957481_r.jpeg",
      "73104331_1713348006521563_r.jpeg",
      "73104331_1712402464678481_r.jpeg",
      "73104331_1712402479437603_r.jpeg",
      "73104331_1711650701327477_r.jpeg",
      "73104331_1711561090949493_r.jpeg",
      "73104331_1711561147637732_r.jpeg",
      "73104331_1711018391549501_r.jpeg",
      "73104331_1711018406921771_r.jpeg",
      "73104331_1710455600493166_r.jpeg",
      "73104331_1710009554178002_r.jpeg",
      "73104331_1710010298292443_r.jpeg",
      "73104331_1709457048240952_r.jpeg",
      "73104331_1708982200994161_r.jpeg",
      "73104331_1708629716308571_r.jpeg",
      "73104331_1708629733741013_r.jpeg",
      "73104331_1708083176251910_r.jpeg",
      "73104331_1707852111828305_r.jpeg",
      "73104331_1707767284973551_r.jpeg",
      "73104331_1707343456259632_r.jpeg",
      "73104331_1706951870329924_r.jpeg",
      "73104331_1706691732904130_r.jpeg",
      "73104331_1706518503332880_r.jpeg",
      "73104331_170614136546004_r.jpeg",
      "73104331_170608818412091_r.jpeg"
    ],
    "numDonationsStr": "81 donations"
  },
  "laeneys-medical-expenses": {
    "slug": "laeneys-medical-expenses",
    "name": "Laeney",
    "age": 7,
    "gender": "female",
    "disease": "seizures",
    "raised": 2940,
    "goal": 5000,
    "url": "https://www.gofundme.com/f/laeneys-medical-expenses",
    "title": "Laeneys Medical Expenses",
    "description": "Laeney had her first seizure on Christmas day 2022. Her seizures have progressively gotten worse. She has had numerous ambulance rides and hospital stays. Currently her main Dr is at U of M, but we really would like to try to get her to the Mayo Clinic because nothing seems to be working at this point. She has appointments every other week at U of M right now for more testing.  We are asking for help with expenses to take some weight off the familys shoulders.  Hopefully when they can get her into the Mayo Clinic this will help cover anything they may need.   They are also looking into brain mapping which insurance does not cover.  We are desperate to try to figure out how to get Laeney back to living a normal life.  Laeney's reward after all the hospital tests and overnights is a trip to Krispy Kreme (which is where she is in this picture)  Even if you can't donate please pray for answers for Laeney.\n",
    "creationDate": "2023-12-17",
    "images": [
      "77174791_1702849859803369_r.jpeg",
      "77174791_1703030733360827_r.jpeg"
    ],
    "numDonationsStr": "41 donations"
  },
  "donate-to-help-with-logans-medical-expenses": {
    "slug": "donate-to-help-with-logans-medical-expenses",
    "name": "Logan",
    "age": 8,
    "gender": "male",
    "disease": "lymphoma",
    "raised": 20515,
    "goal": 28000,
    "url": "https://www.gofundme.com/f/donate-to-help-with-logans-medical-expenses",
    "title": "Donate to help with Logan's medical expenses.",
    "description": "If you're lucky enough to know Logan, you know he is the coolest kid with the biggest heart. He doesn't know a stranger, is the most sensitive, caring soul, and is always making everyone laugh with witty comebacks. To see him start this journey is heartbreaking, and the whole family could use prayers.\n\n\n\nLogan, whos only 8yrs old, is currently at Children's National Hospital after a large mass, consistant with lymphoma, was found in his chest. He just had a biospy to determine specific diagnoses and the course of treatment. It's looking like Logan is in for a long journey.\n\n\n\nEveryone has been asking how to help? Right now, the biggest blessings are prayers and the gift of time for the family to focus on Logan's healing. The family depends on survival from two small businesses, and there is no paid time off. Any help would be so greatly appreciated.\n",
    "creationDate": "2022-12-12",
    "images": [
      "69872383_1670876206693890_r.jpeg",
      "69872383_1700531461203650_r.jpeg",
      "69872383_1700531476347334_r.jpeg",
      "69872383_1700531487843051_r.jpeg",
      "69872383_1700532175699700_r.jpeg"
    ],
    "numDonationsStr": "201 donations"
  },
  "help-baby-logans-medical-expenses": {
    "slug": "help-baby-logans-medical-expenses",
    "name": "Logan",
    "age": 0,
    "gender": "male",
    "disease": "Supraventricular tachycardia (SVT)",
    "raised": 9380,
    "goal": 12000,
    "url": "https://www.gofundme.com/f/help-baby-logans-medical-expenses",
    "title": "Help Baby Logan's Medical Expenses",
    "description": "This is our son Logan.He was diagnosed with Supraventricular tachycardia (SVT) while he was in utero at 29 weeks. This is a condition where an extra electrical pathway is formed when the heart is developing and causes a short circuit and the heart beats as high as 300 bpm.Mom was in the hospital for 4 days of observations and given a beta blocker to try and steady his heart rate. After repeated episodes the decision was made to perform an emergency C-Section and he was born on February 2nd at 1:21 pm weighing in at 5 lbs 6 ounces.He was immediately put on the standard drug treatments for SVT and kept in the NICU.The amazing doctors and nurses assigned to him kept doing everything they could to keep his heart rate down, but nothing worked. They tried every drug and technique to prevent his episodes and to convert him out of them. After 6 weeks he started to develop an infection that was most likely due to a lack of blood flow to his gut because his heart was pumping it through too fast.Feeds were stopped and he was put on IV nutrition.Most cases of SVT are something that children grow out of, but in cases that are severe and not managed by drugs they do a procedure called an ablation to burn off that extra pathway and restore normal heart function. This procedure is typically reserved for older kids because an infant's heart is extremely delicate.  The decision was made to do the ablation when Logan's condition continued to deteriorate.  He was spending his days in SVT and they repeatedly had to shock him with a transesophageal pacer. This is a catheter that goes up his nose and down his throat and placed just behind his heart in order to try and shock his heart into a normal rhythm. This was just as pleasant as it sounds and as effective as everything else they tried.He went in for his procedure at about 12:30 on March 31st. After some difficulty getting set up, including the central line that was placed in his scalp coming out and a new IV needing to be put in,  the electrophysiologist was moving the catheter into position to do the ablation.This is when the worst thing possible happened and the left ventricle of his heart was punctured.Logan spent 50 minutes in cardiac arrest while the team worked to open his chest and repair the hole. He's currently on an ECMO machine that does the work of his heart and lungs for him. The doctors don't know how much blood made it to his vital organs or how much damage was done.As you can imagine, expenses are adding up quickly. Please help in any way you can.",
    "creationDate": "2021-04-01",
    "images": [
      "55752016_1617300177240917_r.jpeg"
    ],
    "numDonationsStr": "98 donations"
  },
  "zewg7v64": {
    "slug": "zewg7v64",
    "name": "Lucas",
    "age": 8,
    "gender": "male",
    "disease": "Rhabdomyosarcoma",
    "raised": 71713,
    "goal": 85000,
    "url": "https://www.gofundme.com/f/zewg7v64",
    "title": "Lucas' Fight Against Child Cancer",
    "description": "At 8 years old, Lucas is the youngest of three boys. He always has a smile on his face and is one of the sweetest boys you’ll meet. On March 29, 2016,  Lucas was diagnosed with a very rare and aggressive cancer, Rhabdomyosarcoma. The doctors have said he will undergo months of treatment and chemotherapy. He has been given a 20-30% survival rate. He has a very large and rapidly growing tumor in his lower abdominal/ groin area and has metastisized in his bone marrowMy brother, Robert and my sister-in-law Karina, are amazing parents and both work full time to support their family. Like a lot of families, they live pay check to pay check. Robert is a self-employed piano tuner and does well supporting his family, but unfortunately does not have any benefits for time off to take care of his son. His wife also does not have any paid time off during treatment.  This is where family, friends, and community steps in. As his brother, I want to help relieve the financial anxiety of raising a family and travel costs for chemo. Please help my brother and his family in their courageous fight against cancer. Every little bit will help. Thank you from the bottom of my heart!**I will be updating this page as more information comes in on treatment details.** You can also follow his facebook at https://www.facebook.com/LoveforLukiWill Jones",
    "creationDate": "2016-03-29",
    "images": [
      "10244903_1501873458.8191.jpg",
      "10244903_14944141170_r.jpg",
      "10244903_14944141300_r.jpg"
    ],
    "numDonationsStr": "1.6K donations"
  },
  "ce78k-mackenzies-medical-expenses": {
    "slug": "ce78k-mackenzies-medical-expenses",
    "name": "Mackenzie",
    "age": 2,
    "gender": "female",
    "disease": "second degree and third degree burns on hands, arms and legs",
    "raised": 2470,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/ce78k-mackenzies-medical-expenses",
    "title": "Mackenzie’s medical expenses",
    "description": "Saturday around 7pm, my sweet baby, Mackenzie was seriously injured and had to be rushed to Westchester Medical Center, where she will stay for the next few weeks. We were at a family function where hot coals weren’t properly disposed of on gravel (which disguised the coals) in close proximity where the children were playing. Mackenzie, Allie and daddy were playing catch with a cardboard box, (Let’s face it kids rather play with boxes, than toys) After 10 minutes of playing and having a blast, Mackenzie went running for the box, in of course her rain boots, which caused her to fall on the hidden hot coals.  I thank god that Jesse was very close to her and was able to react fast. But the damage was already done. Mackenzie sustained deep second degree and third degree burns on her hands, arms and legs. Her rain boots protected her feet and ankles. Tomorrow morning, she will be heading into surgery for skin graphs and most likely a feed tube. The feed tube is because the best thing for burn victims is a high calorie and high protein diet to stimulate skin regrowth. We are forever grateful for whatever donations and help we receive and if you can’t donate please just say a pray for our baby girl.",
    "creationDate": "2020-09-14",
    "images": [
      "51227634_1600144625394704_r.jpeg",
      "51227634_160026399355537_r.jpg",
      "51227634_1600181385596779_r.jpg",
      "51227634_160018138637226_r.jpg",
      "51227634_1600181385761310_r.jpg"
    ],
    "numDonationsStr": "38 donations"
  },
  "baby-masons-medical-fund-helping-roy-and-haley": {
    "slug": "baby-masons-medical-fund-helping-roy-and-haley",
    "name": "Mason",
    "age": 0,
    "gender": "male",
    "disease": "pulmonary atresia",
    "raised": 2995,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/baby-masons-medical-fund-helping-roy-and-haley",
    "title": "Baby Mason’s Medical Fund  Helping Roy and Haley",
    "description": "Updates are at the bottom. \n\n\n\n\n\nRoy and Haley have been excited to welcome their baby (Mason) into this world. At twenty weeks it was found that Mason had pulmonary atresia. Then at thirty one weeks Haley started having preeclampsia. Haley missed a lot of work. She was on bed rest for two months. At thirty five weeks Haley was admitted into the hospital. With his known heart issue the doctors were hoping he would not come until 7/26. Mason weighed 5 pounds 4 oz and was taken to Children's within an hour of being born. Unfortunately he had to be intubated and due to the stress on his little body he is on lots of meds. He is due to have the balloon surgery 7/22 but one of his lungs are not working so they are doing a CT scan and doing another Nuero check. He will also need a stent surgery within a week. It is $10 a day to park at Children’s. Haley can eat for free but Roy has to pay for all his meals. Roy, Haley and Mason are going to need all the support they can get. They have a very long road ahead of them. Haley will need to return back to work in eight short weeks unless she can afford to take FMLA and stay home a little longer. Medical expenses are going to be a lot over the next several years. They have insurance but it doesn’t cover everything at 100%. If you can give please do but if you can’t please know your prayers, text and love means so much to Roy and Haley. They want to THANK everyone from the bottom of their hearts. Right now Mason’s health is Roy and Haley’s main focus. If they don’t respond or answer please know they feel your love and are grateful for it. #TeamMason #Fighting4Mason #Praying4Mason\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease help us share this. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBefore birth it was discovered Mason would need a pulmonary atresia repair surgery within his first week of life and possibly three surgeries by the age of three.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPulmonary atresia is a birth defect (pronounced PULL-mun-airy ah-TREE-sha) of the heart where the valve that controls blood flow from the heart to the lungs doesn't form at all. In babies with this defect, blood has trouble flowing to the lungs to pick up oxygen for the body.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n7/25 Today is a big and exciting day. Mason will have his heart balloon at 1. Please join us in praying for him and his medical team. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpdate: Unfortunate news, the procedure has been moved once again. There's another case going on before his in the cath lab today and there's been a complication. While we are disappointed that our Mason won't be getting his procedure today. \n\nMasons procedure will be taking place tomorrow morning around 8:30 so he will be first. And there should be little reason for any further delay.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n7/26 Mason is out of his procedure, he did amazingly! If the ballon takes(which they think it will) he won’t need a stent next week! \n\n\n\n\n\n\n\n\n\n\n7/27 A couple hours after his procedure Mason started  bleeding very badly last night in his groin where they went in. The DRs held pressure on the site for over an hour and it finally stopped bleeding. He had to receive  blood due to this. His heart rate was very high and BP was very low. They gave him a ton of meds to help his heart rate & BP. He is currently not bleeding and heart rate and blood pressure are stable. Hoping he can get weaned off some medication today.\n\n\n\n\n\n\n\n\n\n\n\n\n7/31 Sweet mason \n\nHe’s had a rough couple of days, he’s more awake and is getting agitated very easily. I know he is so tired of this breathing tube. Looks like he is going to need the stent afterwards, we will know more in the next couple of days. \nTomrrow is a big day for him, he is getting a pic line because his ivs keep going bad and he’s just getting poked too much! He is also probably going to get a NG tube tomorrow (feeding tube) so he can start finally having some of mommas breast milk! \n\nI love you sweet boy. Haley \n\n\n\n\n8/5\n\nMasons PDA has finally closed enough for him to get the stent! He is scheduled for procedure number two tomorrow afternoon. Prayers that all goes smoothly & he doesn’t bleed a lot like he did with his first procedure. \n\nHe was also able to finally receive some breast milk!  \n\nWe are so thankful to everyone at Children’s-Dallas! From the DRs, nurses, respiratory therapist, techs, PT, OT and speech therapy. Everyone has been so amazing to Mason, Roy and I. Literally all angels  \n\nI love you bubba, you got this! \n\n\n\n\n\n\n\n\n",
    "creationDate": "2022-07-22",
    "images": [
      "66847629_1659321557342217_r.jpg"
    ],
    "numDonationsStr": "36 donations"
  },
  "g5vsnh-support-baby-masons-medical-journey": {
    "slug": "g5vsnh-support-baby-masons-medical-journey",
    "name": "Mason Stevenson",
    "age": 0,
    "gender": "male",
    "disease": "Trisomy 21 (Down Syndrome), tracheal anomalies, partially collapsed trachea and lung",
    "raised": 2603,
    "goal": 8000,
    "url": "https://www.gofundme.com/f/g5vsnh-support-baby-masons-medical-journey",
    "title": "Support Baby Mason's Medical Journey",
    "description": "Sweet baby Mason Stevenson was born on June 12, 2025, and after a long stay in the NICU, finally came home on July 17. Mason was born with Trisomy 21 (Down Syndrome) and has already shown incredible strength in his short life.\n\n\n\n\n\n\n\nRecently, Mason began having trouble breathing and choking. After a visit to his pediatrician on October 17, he was transferred to Brenner Children’s Hospital, where doctors discovered tracheal anomalies — his trachea never fully developed and is partially collapsed, along with part of his lung.\n\n\n\n\n\n\n\nOn October 31, Mason will undergo major surgery for a tracheostomy, ventilator placement, and a penis reconstructive procedure. His recovery will require a lengthy hospital stay, possibly until December or January. Once home, Mason will need round-the-clock care from at least two caregivers, as well as special equipment, and modifications to the home and vehicle.\n\n\n\n\n\n\n\nDuring this time, Mason’s mom, Heather Durden, will be out of work to care for her baby. This GoFundMe is set up to help the family with medical-related expenses, travel costs, meals, and monthly bills as they navigate this challenging journey.\n\n\n\n\n\n\n\nPlease consider donating and sharing to support this loving family — and most importantly, keep baby Mason and his caregivers in your prayers.\n\n",
    "creationDate": "2025-10-23",
    "images": [
      "95916051_1761264186615350_r.png",
      "95916051_1761264219997088_r.jpeg",
      "95916051_176126423248949_r.jpeg",
      "95916051_1761264204311300_r.jpeg",
      "95916051_1765372958174965_r.jpeg"
    ],
    "numDonationsStr": "42 donations"
  },
  "support-my-sons-family-through-their-medical-crisis": {
    "slug": "support-my-sons-family-through-their-medical-crisis",
    "name": "Mateo",
    "age": 0,
    "gender": "male",
    "disease": "bacterial meningitis",
    "raised": 2915,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/support-my-sons-family-through-their-medical-crisis",
    "title": "Baby Mateo’s medical crisis!",
    "description": "Hi, I'm grandma Melanie.\n\n\n\nI’m raising money for my grandson’s medical bills. \n\n\n\nMateo had a symptomless infection aside from blood in his urine. It ended up traveling and turning into bacterial meningitis and now will have to be admitted for 21 days for IV antibiotics!\n\n\n\n\n\nNot only do they have their medical bills for the unplanned c-section, but this unexpected length of stay for my grandson will be a hefty bill (out of pocket expenses) for his thorough recovery!\n",
    "creationDate": "2024-06-03",
    "images": [
      "80517759_171750718254540_r.jpg"
    ],
    "numDonationsStr": "42 donations"
  },
  "bjfz3-maxs-medical-bills": {
    "slug": "bjfz3-maxs-medical-bills",
    "name": "Max",
    "age": 0,
    "gender": "male",
    "disease": "bronchiolitis",
    "raised": 13490,
    "goal": 30000,
    "url": "https://www.gofundme.com/f/bjfz3-maxs-medical-bills",
    "title": "Baby Max’s Medical Bills",
    "description": "Baby Max is 3 months old and got a cold his first week in daycare. Within 12 hours our sweet happy baby went from having a simple dry cough to not being able to breathe on his own. He has been diagnosed with bronchiolitis and we are now on Day 3 in the Pediatric ICU at Children's Healthcare of Atlanta Scottish Rite.\n\n\n\n\n\nMax has a feeding tube, an IV, breathing treatments and constant suctioning. He is also on a RAM nasal cannula with a ventilator attached to push the air better into his lungs since his airways are so inflamed. We have had to go up on his breathing support multiple times already and Max's medical team says we are definitely not over the worst of it yet!\n\n\n\n\n\n\nNathan and I are taking turns being by his bedside and don't know how long we will need to be taking a leave of absence from work. We have a high deductible on our insurance and honestly can't even think about the total of Max's medical bills. Nathan owns his own business and I had just returned from medical leave for Max's birth. Like so many other people who have been in our situation we know we can't face this on our own and need to ask for financial help. Any amount is appreciated. \n\n\n\n\n\n\nThank you to everyone who has shown their love and support for Max, Nathan and I (Nicky) these last few days. We will try to update you on Max's condition!\n\n\n\n\n\n",
    "creationDate": "2023-02-01",
    "images": [
      "70832371_1675268362358261_r.jpeg",
      "70832371_1675803798320204_r.jpg",
      "70832371_1675443088167859_r.jpg",
      "70832371_1675345074188187_r.jpg",
      "70832371_1675345074156839_r.jpg"
    ],
    "numDonationsStr": "85 donations"
  },
  "micahs-chubbies-medical-expenses": {
    "slug": "micahs-chubbies-medical-expenses",
    "name": "Micah Perez",
    "age": 4,
    "gender": "male",
    "disease": "Leukemia",
    "raised": 9441,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/micahs-chubbies-medical-expenses",
    "title": "Micah’s (Chubbies) Medical Expenses",
    "description": "Hello we are Micah’s parents Irvin and Jude Perez. Micah also known as Chubbies is our youngest child from 3 boys, very energetic and just being a happy boy.\n\n\nOn November 23, 2020 my son Chubbies was diagnosed with Cancer (Leukemia) which is cancer in the blood system. Since then we have received enormous amounts of support from our families, close friends and excellent coworkers in which we are very grateful for. Unfortunately we have exhausted all of our savings since November till now and we still need to continue to drive 2 hours one way to San Diego and 2 hours back to the Imperial Valley. \n\n\nThe donations will mainly be used for room and lodging, food and gas for the upcoming medical travels and medical services that will be paid. We feel so grateful for the help we have received from everyone and we will forever pay it forward. Help chubbies to continue his journey to recovery. \n\n\nThank you for your time.\n",
    "creationDate": "2021-03-17",
    "images": [
      "55365440_1616006986971030_r.jpeg",
      "55365440_1635873713789610_r.jpg",
      "55365440_1635873713790786_r.jpg",
      "55365440_1616008668456927_r.jpeg"
    ],
    "numDonationsStr": "91 donations"
  },
  "mjs-fight-against-bone-cancer": {
    "slug": "mjs-fight-against-bone-cancer",
    "name": "MJ Graves",
    "age": 12,
    "gender": "male",
    "disease": "Ewing's Sarcoma",
    "raised": 22242,
    "goal": 50000,
    "url": "https://www.gofundme.com/f/mjs-fight-against-bone-cancer",
    "title": "MJ's Fight Against Ewing’s Sarcoma",
    "description": "Dear friends and family - we're reaching out to ask for your support for our beloved friends Becky, Mike and MJ Graves. These last few months have been nothing less than a parent's worst nightmare. Mike & Becky's only child MJ was just diagnosed with bone cancer. This comes shortly after Becky was let go from her job of 19+years, leaving them to solely rely on Cobra Insurance Coverage that ends in 16 months time and runs $2200 a month. No parent should ever have to worry about the cost of their child's medical expenses. We would like Becky and Mike to be able to concentrate 100% on MJ and his needs by easing some of the financial burden. Many people have asked how they can help. The best way to help at this time is by making a donation. Any amount will be greatly appreciated. We would also like to ask you to share this page with your family and friends...church groups, etc. Becky & Mike are the kind of people who will go out of their way to help friends and strangers alike. Let's join together and be there for Becky, Mike and MJ. ￼MJ's Last Few Months (shared by his mom Becky) In mid/late October 2017 MJ was experiencing pain in his thigh that got progressively worse throughout each day and then started fresh the next morning. Eventually it reached the point that even when lying down, he was in excruciating pain - literally screaming. That night even though we felt silly we took him to a standalone ER for thigh pain. I told her that he had a fever before we came if that was relevant and she said he did not have a fever, that body temp goes up at night. They moved his hip around, did an X-ray, and reported that they couldn't see any issues causing the pain. They offered a CT scan and blood work but said the CT scan would be a lot of radiation and if it were something that would be caught on a CT scan there would be other symptoms. So we agreed not to do the CT scan but I requested blood work. The doctor said that if we weren't doing to CT Scan there was no reason to do blood work. So we were released and told to follow up with our pediatrician, which we did the next day. Our pediatrician checked MJ over and since she didn't find anything concerning she ruled the problem to be small muscle tears. She told him to take it easy. The pain did pass in a few days, for about a week, but then returned. We called the pediatrician who referred us to an orthopedic doctor. The ortho moved him around, took an X-ray, and said it happened because he needed to stretch before physical activities, and diagnosed him with tendinitis of the knee (yes knee?). After a week or two of no improvement and in fact worse pain, and after multiple calls to the ortho asking if they were sure, they referred us to physical therapy. We owe so much to the physical therapist. It was fairly obvious to me that she knew something more serious was wrong throughout her examination. When she finished her evaluation she tactfully told us that there was something more going on and that we needed to go back to our doctors for more scans and blood work. So the next day she called the ortho for us and we called the pediatrician. We went to three appointments that day. Pediatrician, blood work (ordered by pediatrician), and the ortho. The ortho took another X-ray, charged me for my visit (yes I'm bitter) and told me he wasn't qualified to help us because he saw nothing wrong and 'sees kids who have sports injuries'. So he referred us to a better ortho - the best pediatric ortho in Dallas. The new ortho got us in the next day (Friday). He ordered an MRI which we had Saturday and he reviewed it over the weekend. He called Sunday night and told us MJ had infection in his pelvic bone and that he would need to operate within the week. He operated the first time on 12/20 (Wednesday). They took cultures but nothing (no bacteria) ever grew in the lab. MJ slowly improved following surgery, but 10 days later (12/30) he had a night of terrible pain that woke him from sleep and couldn't be managed. We were out of town so went to an ER under our Ortho's instruction and had blood work and an ultrasound. Blood work hadn't improved so they changed our oral antibiotic but ultrasound looked normal. MJ started using his crutches 100% of the time and after not using the leg for a week or so it felt a little better but if he moved to much it resulted in hours of crying. Still nothing growing in the lab. After returning home we had a follow up appointment and did blood work to check infection markers - they were WORSE not better. So the doctor ordered another MRI which we did the next afternoon. The doctor called about 2 hours after the MRI to tell us the infection in the pelvic bone was worse/bigger than when he operated. We had to go back into the operating room for the same procedure THAT NIGHT. It was much more aggressive/invasive and he was in a lot of pain. They took more cultures but again, nothing grew in the lab. They put in a PICC line so he could get IV antibiotics at the hospital and then eventually at home for 6 weeks. Unfortunately a couple days later he was back in terrible pain in his thigh that caused moaning and screaming for long periods of time. Another MRI showed that he had infection/an abscess in his right thigh. Enter his 3rd surgery in a month on 1/20. More fluid taken for culture, but again nothing grew in the lab. Walking was limited to 25-50 steps and every time he got out of bed it resulted in an hour or more of terrible pain. He got mildly better and we were released on Wednesday 1/24 to home health. Home was hard too. He might be fine for hours but if he had to crutch-it to the bathroom it would result in hours of writhing in pain and often fever. Tuesday 1/30 returned disappointing blood work and Wednesday 1/31 we had another MRI. The next day we had a follow up appointment at his office. When he came in MJ was on the table crying in pain. He asked us to come back into the hospital to operate in the pelvic bone again. MJs 4th surgery was 2/1. They took a ton of bone and fluid and tissue so that they could rule things out and hopefully finally identify the root cause. MJ continued to have terrible pain. We all thought it was from the surgery but it got worse not better. His pain in his thigh was/is unbearable. They went through all the most powerful pain medications and nothing worked for more than a few minutes. He can't walk and can barely stand. And now I come to (believe it or not) the worst part of MJs tale. The surgeon came to us last night (2/5) and asked if we wanted him to speak in front of MJ or in private. I already knew the news would be unbearable. He started with the fact that there was more/new infection in the right thigh and some also in the left visible from yet another MRI that morning. He would probably have to operate again. But he hadn't gotten to the worst part. The pathology lab had returned results. Yes they saw inflammation in the bone (indicating infection), but also \"Small round blue cell tumor\" cells. We don't get know for sure which 'flavor' of cancer (yes, I just said that MJ has cancer). Our amazing orthopedic surgeon thinks it is one from a short list: Lymphoma of bone, Ewing's sarcoma, or PNET. He said it's aggressive, and its life threatening. And we can assume that if he had these cells in his pelvic bone that they are in all of his bones. We are moving to a Dallas hospital with an oncology department in the morning, and plan to get a second opinion regarding the plan to heal him either in Houston or New York. It's our understanding that for this rare form of cancer those are the most qualified hospitals. And tonight we tell our 12 year old that he has cancer.",
    "creationDate": "2018-02-06",
    "images": [
      "27553630_15220994380_r.jpg",
      "27553630_1547217589476618_r.jpg",
      "27553630_1547140887394702_r.jpeg",
      "27553630_1546907070661574_r.jpg",
      "27553630_1546735436847504_r.jpeg",
      "27553630_1546552385289629_r.jpeg",
      "27553630_1544214175359214_r.jpg",
      "27553630_154409901093356_r.jpg",
      "27553630_1543294113738485_r.jpg",
      "27553630_1543218001766740_r.jpg",
      "27553630_1543078509108498_r.jpg",
      "27553630_1517969482.1498_funddescription.jpg"
    ],
    "numDonationsStr": "166 donations"
  },
  "9z58j-natalies-medical-expenses": {
    "slug": "9z58j-natalies-medical-expenses",
    "name": "Natalie",
    "age": 7,
    "gender": "female",
    "disease": "Cancer",
    "raised": 625,
    "goal": 3000,
    "url": "https://www.gofundme.com/f/9z58j-natalies-medical-expenses",
    "title": "Natalie’s Medical expenses",
    "description": "Help Natalie Get the Care She Needs\n\n\n\nOur sweet Natalie has been facing ongoing health challenges, and she now needs an important biopsy procedure to guide her treatment. The medical expenses are overwhelming, and we are reaching out for help from our community and kind-hearted donors.\n\nNatalie is a bright and resilient child. Despite her struggles, she keeps her spirit shining! She deserves the chance to focus on healing and being a kid, not on medical worries.\n\n\n\nFundraising Goal: $19,200\n\nWe are raising $19,200 to cover Natalie’s biopsy procedure and related medical expenses. After GoFundMe processing fees, this will provide the $18,500 needed to give her the care she requires.\n\n\n\nEvery donation, no matter the size, helps us get closer to this goal and makes a real difference in Natalie’s health and recovery. If you are able, please consider donating or sharing this fundraiser with others. Your support means the world to us and will make a direct impact in Natalie’s journey toward better health.\n\n\n\nFrom the bottom of our hearts, thank you for supporting Natalie.\n",
    "creationDate": "2025-09-03",
    "images": [
      "94293893_1756945959650759_r.png",
      "94293893_1756946027630240_r.png",
      "94293893_1756946027960083_r.png",
      "94293893_1756946029300151_r.png",
      "94293893_1756946030121277_r.png",
      "94293893_1756946011348315_r.jpeg"
    ],
    "numDonationsStr": "9 donations"
  },
  "nikos-type-1-diabetes-medical-expenses": {
    "slug": "nikos-type-1-diabetes-medical-expenses",
    "name": "Niko",
    "age": 6,
    "gender": "male",
    "disease": "Type 1 diabetes",
    "raised": 2710,
    "goal": 5000,
    "url": "https://www.gofundme.com/f/nikos-type-1-diabetes-medical-expenses",
    "title": "Niko’s Type 1 Diabetes Medical Expenses",
    "description": "Meet Niko! \n\nNiko is one of the coolest 6 year olds there is. My family had the honor of meeting \n\nNiko and his family through baseball. We all became fast friends.  Niko’s biggest passion is baseball! He’s a Braves fan and he plays travel ball for the 7U team in our town.  His nickname is Niko Chico Baseball Man, that’s how much he loves the sport!\n\nAt a double header on Sunday Niko started feeling a little funky and asked the coach to sit out a few innings. Nearing the end of the first game he came and sat with his mom and decided he still wasn’t feeling well enough to play the second game-when he says no to baseball you know something isn’t right. During the second game he fell asleep on his mom and he didn’t play with the other kids at the pizza party after the games.\n\nThat evening after Niko still wasn’t feeling great his mom and dad took him to the ER. That’s when their family’s whole life changed. Niko was diagnosed with Type 1 diabetes and transferred to the children’s hospital for care.  He will now have to change his life to watch everything he eats and drinks, constantly monitor his blood sugar and give himself insulin.\n\nThe medical bills are just starting. Insurance barely puts a dent in some of the drug costs and in some cases they need 2 monitors or 2 life savings pens-1 for home and 1 for school. \n\nI’m asking because my dear friends would never ask-they would keep moving forward and quietly suffer, if you can give anything at all, please consider this. All funds raised would go to Niko’s medical expenses.\n\nThank you so much!\n\n#NikoChicoBaseballMan\n\n\n",
    "creationDate": "2021-10-13",
    "images": [
      "60554285_1634171548600291_r.jpeg"
    ],
    "numDonationsStr": "23 donations"
  },
  "support-for-lexi-and-norastarrs-medical-journeys": {
    "slug": "support-for-lexi-and-norastarrs-medical-journeys",
    "name": "Nora Starr",
    "age": 0,
    "gender": "female",
    "disease": "lung disease",
    "raised": 260,
    "goal": 7000,
    "url": "https://www.gofundme.com/f/support-for-lexi-and-norastarrs-medical-journeys",
    "title": "Support for Lexi and Nora-Starr's Medical Journeys",
    "description": " Lexi’s baby girl, Nora Starr, was born very premature at just one and a half pounds and is now facing serious lung disease. This tiny warrior is fighting so hard, and Lexi is spending every moment she can by her side while trying to handle the overwhelming emotional and financial strain that comes with a long NICU stay. \n\nIf you are able, please consider helping Lexi and baby Nora by donating or sharing their GoFundMe. Your support will go toward medical expenses, time lost from work, transportation, as she is in desperate need of a car and the many unexpected costs that come with caring for a medically fragile preemie. Even the smallest gift and a simple share can make a huge difference for them right now.\n\nHere is the link to help:  \n https://gofund.me/5eda77d95\n\nIf you can’t donate, please keep Nora Starr and Lexi in your prayers and share this so their story reaches more people. Thank you for lifting up this young mama and her tiny, brave girl during the hardest fight of their lives. \n",
    "creationDate": "2025-12-04",
    "images": [
      "97416087_1764954030430588_r.jpg",
      "97416087_1764870264260757_r.jpeg",
      "97416087_1764870264224167_r.jpeg",
      "97416087_1764870264236704_r.jpeg",
      "97416087_1764870264114773_r.jpeg",
      "97416087_1765247653464873_r.jpg"
    ],
    "numDonationsStr": "5 donations"
  },
  "help-baby-owen-through-cancer-treatment": {
    "slug": "help-baby-owen-through-cancer-treatment",
    "name": "Owen",
    "age": 0,
    "gender": "male",
    "disease": "Ewing Sarcoma",
    "raised": 78857,
    "goal": 70000,
    "url": "https://www.gofundme.com/f/help-baby-owen-through-cancer-treatment",
    "title": "Help Baby Owen Through Cancer Treatment",
    "description": "Hi, my name is Owen. Some call me Baby Owen, like my big sister Riley. I am 9 months old, and I just found out I have Ewing Sarcoma in my spine. It is a rare form of cancer found in kids.\n\n\n\nMy mom and dad need to be here in the hospital with me, so they are unable to go to work. Mommy and daddy will have to bring me back here every 14 days for chemo treatment. If you would like to donate to help pay for expenses, my family and I would greatly appreciate it.\n\n\n\nI will continue to update you on my progress. Please pray or send good vibes my way.\n\n\n\nThank you!\n",
    "creationDate": "2024-12-09",
    "images": [
      "84706369_1733795825683718_r.jpeg",
      "84706369_1767018212896190_r.jpeg",
      "84706369_1767018230606869_r.jpeg",
      "84706369_1767018248651001_r.jpeg",
      "84706369_1767018267957562_r.jpeg",
      "84706369_1767018326819038_r.jpeg",
      "84706369_1765730135955033_r.jpeg",
      "84706369_1765730158355791_r.jpeg",
      "84706369_1765730201858284_r.jpeg",
      "84706369_1765730286894429_r.jpeg",
      "84706369_1765730312660154_r.jpeg",
      "84706369_1765730334727994_r.jpeg",
      "84706369_1764984069618159_r.jpeg",
      "84706369_1764984077495464_r.jpeg",
      "84706369_1764984085682955_r.jpeg",
      "84706369_1764984093234605_r.jpeg",
      "84706369_176498410178721_r.jpeg",
      "84706369_1764984107279575_r.jpeg",
      "84706369_1764984115355204_r.jpeg",
      "84706369_1764688493467091_r.jpeg",
      "84706369_1764688510511353_r.jpeg",
      "84706369_1764688523751443_r.jpeg",
      "84706369_1764688536241960_r.jpeg",
      "84706369_1764688551328441_r.jpeg",
      "84706369_1764688565893839_r.jpeg",
      "84706369_176468858359531_r.jpeg",
      "84706369_1764688597323566_r.jpeg",
      "84706369_1763669146798413_r.jpeg",
      "84706369_1763669219931475_r.jpeg",
      "84706369_1763669269484985_r.jpeg",
      "84706369_1761065509134387_r.jpeg",
      "84706369_1761065595437658_r.jpeg",
      "84706369_1761065960936624_r.jpeg",
      "84706369_1761066036490278_r.jpeg",
      "84706369_17610661224502_r.jpeg",
      "84706369_1761064557342198_r.jpeg",
      "84706369_1761064601897097_r.jpeg",
      "84706369_1761064636248901_r.jpeg",
      "84706369_1761064666615282_r.jpeg",
      "84706369_1761065050283591_r.jpeg",
      "84706369_1757104933438716_r.jpeg",
      "84706369_1757104994120465_r.jpeg",
      "84706369_1757105313690644_r.jpeg",
      "84706369_1754605531129669_r.png",
      "84706369_1751914807509381_r.jpeg",
      "84706369_1751914817835443_r.jpeg",
      "84706369_1749221013406274_r.jpeg",
      "84706369_1749221062404533_r.jpeg",
      "84706369_1749221300372517_r.jpeg",
      "84706369_1747160488460772_r.jpeg",
      "84706369_1747160514906979_r.jpeg",
      "84706369_1747160532360731_r.jpeg",
      "84706369_1747160553660431_r.jpeg",
      "84706369_1747160581174777_r.jpeg",
      "84706369_1747161025587312_r.jpeg",
      "84706369_1746214709224949_r.jpeg",
      "84706369_1746214727688264_r.jpeg",
      "84706369_1746214771105223_r.jpeg",
      "84706369_1744301867338697_r.jpeg",
      "84706369_1744301958601996_r.jpeg",
      "84706369_1744302029120768_r.jpeg",
      "84706369_1744302071240711_r.jpeg",
      "84706369_1744302104524389_r.jpeg",
      "84706369_1744302138415728_r.jpeg",
      "84706369_1744302190389270_r.jpeg",
      "84706369_1744302222489545_r.jpeg",
      "84706369_1744302262861368_r.jpeg",
      "84706369_1743083496260866_r.jpeg",
      "84706369_1743083506952122_r.jpeg",
      "84706369_1743083516382180_r.jpeg",
      "84706369_1743083526507010_r.jpeg",
      "84706369_1743083536739186_r.jpeg",
      "84706369_1742477502832358_r.jpeg",
      "84706369_1742477521272348_r.jpeg",
      "84706369_1741797654639755_r.jpeg",
      "84706369_1741797675709980_r.jpeg",
      "84706369_1741797703895057_r.jpeg",
      "84706369_1741797723861152_r.jpeg",
      "84706369_1741797736969199_r.jpeg",
      "84706369_1741797792626979_r.jpeg"
    ],
    "numDonationsStr": "731 donations"
  },
  "peters-journey-medical-expenses": {
    "slug": "peters-journey-medical-expenses",
    "name": "Peter",
    "age": 0,
    "gender": "male",
    "disease": "Blue Rubber Bleb Nevus Syndrome, Venus Malformation, congenital scoliosis, kyphosis, spine and chest wall deformities",
    "raised": 11982,
    "goal": 50000,
    "url": "https://www.gofundme.com/f/peters-journey-medical-expenses",
    "title": "Peter’s journey - medical expenses",
    "description": "On May 17th, 2019 we were blessed with the most beautiful & perfect baby boy, but we were not prepared to have our entire world changed. Our sweet boy was born into this world with the surprise of a lot of medical challenges. Peter is the baby of a large blended family, and he is loved so very much! He is perfect in every way. He has the most beautiful blue eyes & the sweetest smile. Unfortunately he was born with a long list of diagnosis, the most rare one being Blue Rubber Bleb Nevus Syndrome. He was also born with a 1.5 lb. Venus Malformation (VM) on his back over his spine. This malformation grew with him in the womb, and crazy enough was missed in all the ultrasounds during pregnancy. So you can only imagine how we were in shock when our beautiful baby boy was born with this tremendous mass on his back. This VM caused a lot of medical issues & concerns. We were able to get in contact with Peter’s amazing specialist Dr. Johnson who specializes in vascular anomalies. At 2 months old, Peter had it removed by an amazing team of doctors, they were able to resect 90% of the mass. This incredible team was put together by Dr. Johnson, at Nemours in Orlando. Surgery went amazing! God is good! Well, after his surgery we knew that we needed to keep an eye on his spine, Peter was born with spine and chest wall deformities. These deformities caused congenital scoliosis & kyphosis due to his spine growing around the large mass in the womb. Also due to these deformities, Peter’s breathing is very different than any other baby; Another thing we have to keep a very close eye on. All of his doctors were hoping the spine would straighten out after surgery since most of the mass was removed. However, this has not been the case, it’s actually so much worse than they expected. This is now becoming Peter’s main concern.About 2 months after surgery we went into a follow up for new updated imaging of his spine and the doctors were shocked and really didn’t know what to do. Peter’s kyphosis progressed rapidly. The curve was at 90 degrees. This is very severe for a little baby like him. Peter does not sit up, roll over or kick his legs and the doctors believe it’s due to his spine and that the spinal cord being so stretched out where the kyphosis curve and mass are sitting. We have gone to all the top orthopedic surgeons in Florida and they all are at a loss because it’s nearly impossible to perform the surgery that he needs bc of just how little he is. You see, we are also battling the fact that Peter is struggling to gain weight. We have tried all different types of formulas and his weight gain is just at a stand still. A lot of Peter’s specialists have reached out to CHOP (Children’s hospital of Philadelphia) and Boston Children’s to get their recommendations. They have the top specialists for what Peter is needing right now and they may be the only hope to helping our sweet boy have a chance of getting his spinal deformity under control before it gets any worse. Which is why his current specialists want him seen ASAP at one of those hospitals. There is no multidisciplinary children’s hospital in our state (Florida) that specialize in Peter’s medical issues. We have been told by all the doctors we have seen that their fear is if it gets any worse he can become permanently paralyzed.As his parents, we are at the point we will do anything we need to to make sure our little blessing gets the chance to have the fullest life he possibly can. If that means getting him to the right doctors and hospitals then that’s what we will do. Unfortunately, it comes with a very hefty price tag that we just can’t afford. Just the consults with the specialists that Peter needs to see is sitting around $37,000 for each specialist at each hospital. Then comes the medical treatments which will be in the hundred thousands. We are fighting the best we can with insurance to approve everything but its been a lot of going back and forth with them & it doesn’t go very quick. Unfortunately, time is not on our side and we can no longer wait on them to make a decision. We also do not know what treatments & doctors they are even going to approve if any. We are trusting in The Lord to open the doors to the specialists and hospitals that our sweet boy needs to be seen at and to open up the means for us to be able to afford to get him there. So many people have reached out asking how they can help and of course first and foremost is prayers! But we also thought we would set this fundraiser up for Peter. All the money from here will go to 1st getting him to the specialists at Boston Children’s and CHOP that are requesting to see him. Covering all doctors fees, hospital fees, imaging and any testing and procedures.  Traveling to and from the hospitals and home. Helping to cover costs of time off work during these times. Next, the money would go to all medical testings, equipment, procedures, medicines, therapies that are not covered by his insurance. We thank each and everyone of you that have supported our sweet boy through his journey and that have been there for our family in this very challenging time. We love you all!!\n\n\n**Here is one of his most recent xrays showing a side view of his kyphosis.\n",
    "creationDate": "2020-02-17",
    "images": [
      "45551428_1581967922749802_r.jpeg",
      "45551428_162459429049001_r.jpg",
      "45551428_1621826321805660_r.jpg",
      "45551428_1621826321832301_r.jpg",
      "45551428_1618249938326060_r.jpg",
      "45551428_1582732654256923_r.jpg",
      "45551428_1582732654403744_r.jpg",
      "45551428_1582732654392081_r.jpg",
      "45551428_1582243263278399_r.jpg",
      "45551428_158196818661708_r.jpeg"
    ],
    "numDonationsStr": "122 donations"
  },
  "baby-peyton-needs-our-help-beating-cancer": {
    "slug": "baby-peyton-needs-our-help-beating-cancer",
    "name": "Peyton",
    "age": 2,
    "gender": "male",
    "disease": "stage 4 metastatic neuroblastoma",
    "raised": 53400,
    "goal": 100000,
    "url": "https://www.gofundme.com/f/baby-peyton-needs-our-help-beating-cancer",
    "title": "Baby Peyton Needs Our Help Beating Cancer!",
    "description": "Our beloved Peyton was recently diagnosed with a rare form of cancer: advanced stage 4, metastatic neuroblastoma. As part of his extended family, we were shocked, devastated, and left wondering, \"What can we do to help?\" Please join us in our effort to provide financial assistance to Lauren and Roberto, Peyton's mommy and daddy, so they can solely focus on Peyton and his full recovery. Below is a little about Peyton and his diagnosis...\n\nPeyton, like most 2-year-olds, loves to play and has energy for days! His smile lights up any room and you can't help but laugh along with him - his laughter is that infectious! He loves sports and you can usually find him carrying around a ball of some sort. He likes putting together puzzles and counting. He also loves animals, especially his black lab Maddison. Most recently, Peyton began learning about dinosaurs and seems to really enjoy those too!\n\nA couple of weeks ago, Lauren and Roberto noticed Peyton limping on his left leg. Because they hadn't seen him trip or fall, they decided to wait a day or two but when he didn't show improvement, they took him to the doctor. About a week and several invasive procedures later, we're now faced with the scary diagnosis facing our sweet boy! Peyton will start chemotherapy in the forthcoming days and his continuing treatment will be determined based on how he responds to chemo. We will update this GoFundMe page when we have news to share, so feel free to follow it for updates.\n\nAs Lauren, Peyton's mommy, explained to us, \"For the last 2 weeks we have been living every parent's worst nightmare... We aren't asking for your pity or sympathy - all we ask is for prayers. We do believe in the power of prayer. WE WILL FIGHT THIS CANCER! I beg you all to take a minute or two out of your day and pray for Peyton. Pray for his peace, comfort, and cure.\"\n\nAt times like these, parents want to be by their ailing child's side. Please help us alleviate some of their stress by donating to this worthwhile cause. Any amount you are able to donate will go towards medical bills, medical supplies, and general costs.\n\nPeyton is our beloved son, grandson, and nephew and it is with love, humility, and the most gracious hearts that we ask for your financial assistance and prayers during this difficult time.\n\n\n\nTo learn more about neuroblastoma please visit the following sites:\n\nhttps://www.stjude.org/disease/neuroblastoma.html\n\nhttps://www.cancer.org/cancer/neuroblastoma/about/what-is-neuroblastoma.html\n\n\n\nTRANSLATED IN SPANISH BELOW:\n\nNuestro amado Peyton recientemente fue diagnosticado con un cáncer poco común: se trata de neuroblastoma metastásico avanzado (estadio 4). Como integrantes de su familia extendida, nos sentimos devastados y hemos pensado en la mejor forma para ayudar. Es por esto que iniciamos un GoFundMe. Pueden unirse a nuestra recaudación que busca brindar alivio económico a Lauren y Roberto, los padres de Peyton, para que logren enfocarse en el cuido de Peyton y su recuperación. Abajo explicamos un poco sobre Peyton y su diagnóstico.\n\n\n\n¡Peyton, como la mayoría de niños de 2 años, ama jugar y tiene muchísima energía! Su sonrisa es preciosa y puede iluminar toda la habitación. Disfrutamos especialmente cuando se ríe, porque lo hace de forma tan contagiosa que todos terminan uniéndose. Le encantan los deportes y suele ir de un lado a otro con sus balones de juguete. Además está aprendiendo a contar y disfruta de armar rompecabezas. Es amante de los animales, especialmente Maddison, la perra labrador de su familia. Recientemente, Peyton descubrió los dinosaurios y se encuentra muy entusiasmado aprendiendo acerca de estos.\n\n\n\nHace unas semanas, Lauren y Roberto observaron a Peyton cojeando de su pierna izquierda. Como no se había golpeado ni sufrido caídas, decidieron esperar un par de días. Sin embargo, no hubo mejoría en los síntomas por lo que acudieron al médico. Después de varios estudios de imágenes y procedimientos invasivos, nos dieron a conocer el aterrador diagnóstico que enfrenta nuestro amado Peyton. Sin tiempo que perder, en los próximos días iniciará tratamiento con quimioterapia, y según la respuesta inicial a las primeras sesiones de quimioterapia, se determinará los siguientes tratamientos (cirugía, radioterapia, trasplante de médula ósea...). Estaremos actualizando esta página de GoFundMe, por lo que los invitamos a seguirla para conocer noticias y actualizaciones sobre Peyton.\n\n\n\nEn palabras de Lauren, la mamá de Peyton: \"En las últimas dos semanas hemos vivido la peor pesadilla de todo padre... No estamos pidiendo por su lástima ni simpatía, solamente pedimos por sus oraciones. Nosotros creemos en el poder de la oración. ¡VAMOS A LUCHAR CONTRA ESTE CÁNCER! Les ruego a todos que tomen uno o dos minutos de su día y oren por Peyton. Oren por su paz, consuelo y cura\".\n\n\n\nEn situaciones como esta, los padres desean estar al lado de su hijo enfermo. ¡Ayudanos a aliviar la preocupación de su familia donando a esta causa, sin importar el monto! Todos los fondos recaudados serán destinados al pago de facturas del hospital, equipo médico, y gastos generales.\n\n\n\nPeyton es nuestro amado hijo, nieto, sobrino y primo... Por lo que con el corazón lleno de amor, humildad y misericordia, solicitamos tu ayuda financiera y oraciones durante estos tiempos difíciles.\n\n\n\nPara conocer más acerca neuroblastoma podés consultar los siguientes links:\n\nhttps://www.cancer.org/es/cancer/neuroblastoma/si-su-hijo-tiene-un-neuroblastoma.html\n\nhttps://www.stjude.org/es/cuidado-tratamiento/enfermedades-que-tratamos/neuroblastoma.html \n",
    "creationDate": "2021-11-03",
    "images": [
      "61006519_1651978236926778_r.jpg",
      "61006519_1651977534221644_r.jpg",
      "61006519_1651977535327332_r.jpg",
      "61006519_165197753553830_r.jpg",
      "61006519_1645849138464437_r.jpeg",
      "61006519_1637877075599_r.jpg",
      "61006519_1637877075395252_r.jpg",
      "61006519_1637877075608123_r.jpg",
      "61006519_1636154622631289_r.jpg",
      "61006519_1636001661197039_r.",
      "61006519_1636002592594332_r.",
      "61006519_1636002774809626_r.",
      "61006519_1636002829179356_r."
    ],
    "numDonationsStr": "325 donations"
  },
  "help-with-costs-of-presleys-medical-care": {
    "slug": "help-with-costs-of-presleys-medical-care",
    "name": "Presley",
    "age": 4,
    "gender": "female",
    "disease": "brain tumor",
    "raised": 3229,
    "goal": 5000,
    "url": "https://www.gofundme.com/f/help-with-costs-of-presleys-medical-care",
    "title": "Help with cost of brain tumor medical expenses",
    "description": "We are trying to raise money for Presleys medicines and appointments until her insurance becomes effective again. We also need help getting lots of work on our car to be able to go back and forth from McMinnville to Nashville and other areas. We also don’t know how long our hospital stay will be when surgery is done so it would also help us with any expenses for that. She has a brain tumor that will have to be removed to see exactly what it is. They don’t think it’s cancer but we can’t rule it out just yet. The medicines are for her seizures to help control them until surgery can happen. We appreciate anything and everything. ",
    "creationDate": "2024-07-24",
    "images": [
      "81639473_1721834917428788_r.jpg"
    ],
    "numDonationsStr": "26 donations"
  },
  "help-with-baby-prestons-medical-fund": {
    "slug": "help-with-baby-prestons-medical-fund",
    "name": "Preston Kendall",
    "age": 0,
    "gender": "male",
    "disease": "Hirschsprung's disease",
    "raised": 2090,
    "goal": 12000,
    "url": "https://www.gofundme.com/f/help-with-baby-prestons-medical-fund",
    "title": "Help with Baby Preston’s Medical Fund",
    "description": "On October 18, 2022, my baby cousin, Preston Kendall, was born. Shortly after birth, he began experiencing eating problems. Two days later, his conditions severely worsened and he was flown in a helicopter from Fort Mohave, Arizona to the children’s hospital in Las Vegas, Nevada. After spending two weeks in the NICU, he was diagnosed with a rare disease that only affects 1 in every 5,000 babies. This disease is called Hirschsprung’s disease, a disease that affects the colon and large intestine, with the the only fix being surgery. Preston will be affected by this disease for the rest of his life, but surgery can alleviate many symptoms.\n\nPreston’s surgery will be on January 26th, 2023 in Phoenix, Arizona. This is four hours away from his home. Preston and his family will have to spend a total of 2 weeks in Phoenix for this surgery. Then, they will have to travel to Phoenix for the next 6-12  months 1-2 times a month to meet with his surgeon, following the surgery.I would love to help my baby cousin and family in anyway possible, so I am setting this go fund me to assist with not only the unexpected medical bills associated with the NICU stay, helicopter ride, surgery, and surgery appointments, but also the costs of constant travel every month. This is especially important because his parents have run out of paid time off due to the unexpected hospital time for baby Preston and still have so much more time to take off for him. Preston is the sweetest, smiliest, and happiest baby who adores his big brother, Jack. He also loves babbling to his loving mom and dad. Anything and everything helps for my cousin, Preston. Thank you. All my love,\nChristy Stopher",
    "creationDate": "2023-01-08",
    "images": [
      "70354423_1673212965758323_r.jpg",
      "70354423_1675356904294142_r.jpeg",
      "70354423_1675058907820332_r.jpeg",
      "70354423_1675058929745677_r.jpeg",
      "70354423_1675058949388531_r.jpeg",
      "70354423_1673664963596076_r.jpeg",
      "70354423_1673665012509327_r.jpeg",
      "70354423_167321314458219_r.jpg",
      "70354423_1673213149884488_r.jpg",
      "70354423_167321314459120_r.jpg"
    ],
    "numDonationsStr": "25 donations"
  },
  "help-kaitlyn-and-rhodes-fight-rare-tumor": {
    "slug": "help-kaitlyn-and-rhodes-fight-rare-tumor",
    "name": "Rhodes",
    "age": 1,
    "gender": "male",
    "disease": "Hepatoblastoma",
    "raised": 23490,
    "goal": 20000,
    "url": "https://www.gofundme.com/f/help-kaitlyn-and-rhodes-fight-rare-tumor",
    "title": "Help Kaitlyn and Rhodes Fight Rare Tumor",
    "description": "Help Support Baby Rhodes and Kaitlyn Through Cancer Treatment\n\n\n\nIn March, our sweet baby Rhodes celebrated his first birthday. Shortly after, our family received heartbreaking news: Rhodes has been diagnosed with a liver tumor consistent with Hepatoblastoma, a rare form of liver cancer. On May 5th, Rhodes will undergo major surgery to remove the tumor, followed by several rounds of chemotherapy at Lurie Children’s Hospital in Chicago.\n\n\n\nThis has been an overwhelming and emotional time for my sister and our family as we navigate the challenges of caring for baby Rhodes while managing the significant financial burden that comes with his treatment. We are hoping to raise $20,000 to help cover the costs of surgery, ongoing chemotherapy, travel, and related medical expenses.\n\n\n\nYour support—whether through a donation or by sharing this page—means the world to us. Every little bit helps as we rally around Rhodes and give him the strength and resources he needs to fight this battle.\n\n\n\nThank you for your love, support, and prayers.\n",
    "creationDate": "2025-04-30",
    "images": [
      "90693491_1746032046976308_r.png",
      "90693491_1746031767423554_r.jpeg",
      "90693491_1746031768203684_r.jpeg",
      "90693491_1746031768112826_r.jpeg",
      "90693491_1746031935247613_r.jpeg",
      "90693491_1746031766717003_r.jpeg"
    ],
    "numDonationsStr": "282 donations"
  },
  "support-for-baby-ryland": {
    "slug": "support-for-baby-ryland",
    "name": "Ryland",
    "age": 0,
    "gender": "male",
    "disease": "Complications from birth",
    "raised": 1825,
    "goal": 5000,
    "url": "https://www.gofundme.com/f/support-for-baby-ryland",
    "title": "Support for Baby Ryland",
    "description": "This is helping Keaton, Kayla, and baby Ryland. As they travel back and forth to children’s, medical expenses, and time off work. \n\n\n\nHe was born on August 14,2025 via emergency c section. There were some complications that have put him in children’s hospital for a while. We’re so thankful for all of the prayers and love sent our way. We ask that you continue all the prayers as we can see and feel the difference they’ve made!\n\n",
    "creationDate": "2025-08-16",
    "images": [
      "93710269_1755373585182650_r.png"
    ],
    "numDonationsStr": "6 donations"
  },
  "sebastian039s-fight-with-stage-4-childhood-cancer": {
    "slug": "sebastian039s-fight-with-stage-4-childhood-cancer",
    "name": "Sebastian Llanes",
    "age": 2,
    "gender": "male",
    "disease": "Embryonal Rhabdomyosarcoma",
    "raised": 4115,
    "goal": 4000,
    "url": "https://www.gofundme.com/f/sebastian039s-fight-with-stage-4-childhood-cancer",
    "title": "Sebastian's Fight with Childhood Cancer",
    "description": "Isn't it crazy to think that, although 'death' is the only thing we are certain of in life... for some reason, there is absolutely no way for us to truly prepare for when a loved one passes. Even more so, for the passing of a child.  When Sebastian Llanes, my 2-year-old cousin, was diagnosed with Embryonal Rhabdomyosarcoma at 9-months-old my family and I were heartbroken by the news. Nonetheless, we remained hopeful and positive for Sebastian.While Sebastian fought a good fight and had been through much more in the past two years than what most people go through in one lifetime, Sebastian laid to rest on May 14, 2019. Despite the unfortunate cards Sebastian had been given, Sebastian was a loving, smart, courageous, brave, and above all things STRONG...  a VERY VERY VERY STRONG boy. Despite all the surgeries, ICU stays, MRI’s, X-Ray’s, multiple medications, sleepless nights, pain, and confusion, Sebastian continued to be the unique and incredible little guy that he was. He loved monster trucks, milkshakes, Doritos, cuddling with his stuffed animals, YouTube videos, and getting hugs and kisses from his incredibly supportive and hard working parents, Bryan and Nikki. Despite all that Sebastian had been through, he continued to be a happy and joyful boy, even during the most difficult times.Bryan and Nikki had been nothing but the BEST PARENTS to Sebastian. All of Bryan and Nikki’s efforts, energy, and time these past 2 years had been devoted to giving Sebastian the best life they can give him. The incredible unconditional love they had for their only child did not go unnoticed. My purpose for this GoFundMe page is to show Bryan and Nikki the same love and support they gave Sebastian. My purpose for this is to give those who have expressed the desire in helping the Llanes family an opportunity to do so, no matter how big or small. My purpose for all of this is to give Bryan and Nikki the support and love they need during this incredibly difficult time in their lives. *All funds will go directly to the Llanes family to assist with past medical, funeral, and living expenses. Prayers, positive thoughts, and lots of love are also and always greatly appreciated. * THANK YOU &I APPRECIATE EACH AND EVERYONE OF YOU FOR TAKING THE TIME TO VISIT THIS PAGE AND FOR YOUR GENEROSITY.",
    "creationDate": "2019-05-04",
    "images": [
      "38959732_1556993713774838_r.jpeg",
      "38959732_1558928585234953_r.jpeg",
      "38959732_1556993759899606_r.jpeg",
      "38959732_1556993512679434_r.jpeg",
      "38959732_1558928629139262_r.jpeg"
    ],
    "numDonationsStr": "46 donations"
  },
  "help-to-support-medical-expenses": {
    "slug": "help-to-support-medical-expenses",
    "name": "Shifa Fatima",
    "age": 1,
    "gender": "female",
    "disease": "Tuberculosis",
    "raised": 1980,
    "goal": 5000,
    "url": "https://www.gofundme.com/f/help-to-support-medical-expenses",
    "title": "Help to Support Medical Expenses",
    "description": "Friends this is not a Fake posting.  One of my friends sister's daughter is hospitalized and undergoing a medical treatment. From what I understood is kids family isn't financially strong enough to payoff the medical bills & to continue with the treatment.  They are seeking a financial help.Please consider contributing to this Go Fund Me to help this little Kid and her family..Please note that any donations are completely voluntary and any contributions would be a tremendous help. Kids Name :Shifa FatimaShe is undergoing Tuberculosis treatment in Niloufer Hospital - Ward Unit 3 ERS for last 3 weeks.GOFUNDME asked that I update my story with some information: My name is Vijay Jaladi and I'm from Bay Area, California. I set up this account to help my friends family & I will be withdrawing the funds and transfer funds to my friends Bank Account in India once this campaign is over. Thank you.",
    "creationDate": "2019-02-11",
    "images": [
      "37001486_1549917527358129_r.jpeg"
    ],
    "numDonationsStr": "52 donations"
  },
  "baby-sulleys-medical-expenses": {
    "slug": "baby-sulleys-medical-expenses",
    "name": "Sulley Deshazo",
    "age": 0,
    "gender": "male",
    "disease": "Pulmonary Hypertension",
    "raised": 7251,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/baby-sulleys-medical-expenses",
    "title": "Baby Sulley's Medical Expenses",
    "description": "I made this profile for my dear friends because their humble pride would not allow them to ask for help themselves. Their sweet baby Sulley has earned quite a following on social media because 1. He's completely adorable and squishy 2. To follow his medical journey. Due to his medical needs, baby Sulley requires 24/7 monitoring, and has been unable to be allowed back to daycare. In addition to the piles of medical bills that continually roll in from ER trips and hospital stays, the adjustment to Blake and Alaina's work schedules to accommodate one of them always being home with baby Sulley has begun to take its financial toll as well. These are hard times for everyone right now, but the Deshazo family truly needs some help, and I know there are many of us out there that follow their journey and would love to support them through this financial hardship. Please feel free to share this page and know that even the smallest donation will truly be appreciated beyond measure. For those of you who are new to baby Sulley's medical journey, here is an overview of his condition:Sulley was born at 34 weeks and spent two weeks in the NICU before coming home. He got bronchitis in December, then rhinovirus and enterovirus, then pneumonia... on underdeveloped preemie lungs. It was just too much on his little body. His immune system was so weak, he would catch anything. After a couple of hospital stays, he was referred to a pediatric pulmonologist. He ended up in the hospital again, where he was sent to Children’s Hospital. After his return home, he continued having problems and was referred to a pediatric cardiologist. He had testing on his lungs and heart. The cardiologist found a lot of pressure on his lungs, and after consulting with his pulmonologist, they determined that he has Pulmonary Hypertension. Sulley is now on full time oxygen.",
    "creationDate": "2021-03-10",
    "images": [
      "55216308_1615399920790909_r.jpeg",
      "55216308_1621081493671425_r.jpeg",
      "55216308_1621081522154716_r.jpeg",
      "55216308_162108154482742_r.jpeg",
      "55216308_1615406125360862_r.jpeg"
    ],
    "numDonationsStr": "143 donations"
  },
  "help-in-the-fight-for-baby-theos-life": {
    "slug": "help-in-the-fight-for-baby-theos-life",
    "name": "Theo",
    "age": 0,
    "gender": "male",
    "disease": "hypoplastic left heart syndrome",
    "raised": 14280,
    "goal": 25000,
    "url": "https://www.gofundme.com/f/help-in-the-fight-for-baby-theos-life",
    "title": "Help with Baby Theo's Medical Expenses",
    "description": "Lauren and James need help to pay for medical bills and expenses that Baby Theo requires. Please donate what you can, and prayers are equally welcome.\n\n \n\nLauren and her husband James learned, during her pregnancy, that \"Baby Theo\" had a heart condition. They were presented with a choice to end the pregnancy or fight for Theo's life. They are a young Christian couple who researched the medical diagnosis and found that infants can survive with surgeries to lead happy lives. They chose to fight for Baby Theo's life. To get the needed medical care for Theo, they moved their household and young family from California to Texas. Theo's heart condition is hypoplastic left heart syndrome (HLHS), which requires specialized medical care and multiple surgeries over multiple years.\n\n \n\nIt was a blessing when Theo was born on January 5, 2022. Two days later, he had the Norwood heart surgery completed with a Sano and a second surgery the next day to adjust clips on the Sano. Theo has had numerous heart surgeries and is now at home with his family.\n\n \n\nUntil now, James and Lauren have been a dual-income family. They both worked for non-profit organizations to help others. Now they need OUR help. They have to pay mounting medical bills for scans, surgeries, specialists, recovery costs and household-related costs. In addition, one parent needs to care for Theo and his brother while the other needs to work to provide for the family. So, their costs have increased substantially, and their income has been reduced by half.\n\n \n\nWe are incredibly proud of the choice they made together to prioritize baby Theo's health and to fight for his life. As a result, they could use prayers and financial assistance for ongoing medical bills.\n\n \n\nThank you for your prayers and support.\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n",
    "creationDate": "2022-01-23",
    "images": [
      "61085043_1668473708909382_r.jpeg",
      "61085043_1668473601767117_r.jpeg",
      "61085043_1668473619972849_r.jpeg",
      "61085043_1652915651757084_r.jpeg",
      "61085043_1652915670140472_r.jpeg",
      "61085043_1646596562732686_r.jpeg",
      "61085043_1646596605411867_r.jpeg",
      "61085043_1644101123153117_r.jpeg",
      "61085043_1644101153886689_r.jpeg",
      "61085043_1642982771427289_r.jpeg",
      "61085043_164298279366498_r.jpeg",
      "61085043_1642982809311805_r.jpeg",
      "61085043_1642982420867935_r.",
      "61085043_1642982447504849_r.",
      "61085043_1642982484455579_r."
    ],
    "numDonationsStr": "151 donations"
  },
  "baby-theodores-medical-support": {
    "slug": "baby-theodores-medical-support",
    "name": "Theodore",
    "age": 0,
    "gender": "male",
    "disease": "respiratory distress with lung bleeding",
    "raised": 3465,
    "goal": 20000,
    "url": "https://www.gofundme.com/f/baby-theodores-medical-support",
    "title": "Baby Theodore’s Medical Support",
    "description": "Hi, my name is John and I’m raising funds to help cover the expenses of our baby Theodore in NICU (neonatal intensive care unit). Theodore was born on June 23, 2023, after a healthy pregnancy. He was a healthy 8 pounds and the birth seemed to have gone well, but a few minutes after birth it was clear that something wasn’t right. Little Theodore had trouble breathing and was put on supplemental oxygen. They hoped that supplemental oxygen for a while would take care of it, but after some ups and downs discovered bleeding from one lung as well, and after CO2 started to build up in his blood, they life flighted him to a level 4 NICU. They were able to stabilize him, but he was put on a ventilator and pretty strong meds to keep him from fighting the ventilator as well as to keep his vitals where they need to be. They don’t know what exactly happened or why and have run an enormous number of tests and scans which have ruled out physical abnormalities (congenial and other), infection, or injury. Doctors say they are optimistic, but this is likely to be weeks or months, not days, in the NICU. We live an hour’s drive away from the hospital, but distance-wise not far enough to get help from charities like Ronald McDonald house, and have an older sibling to care for as well, so have been commuting back and forth 1-2 times per day. We have medical insurance, but that will not cover all expenses either. Our finances are tight and we’re kindly asking for help to raise $20,000 to help with medical and costs related to commuting while Theodore is being treated in the NICU. We are very encouraged by you joining us in the journey and your financial help along the way.",
    "creationDate": "2023-07-03",
    "images": [
      "73830873_1688494506671390_r.jpg",
      "73830873_1689428169780768_r.jpg",
      "73830873_1689428169730542_r.jpg",
      "73830873_1688885248697471_r.jpg",
      "73830873_1688885248925487_r.jpg",
      "73830873_1688885249144706_r.jpg",
      "73830873_1688712412307441_r.jpg",
      "73830873_1688712412251153_r.jpg",
      "73830873_1688447978768645_r.jpeg",
      "73830873_1688448011966479_r.jpeg"
    ],
    "numDonationsStr": "14 donations"
  },
  "vrbcp-medical-bill-assistance": {
    "slug": "vrbcp-medical-bill-assistance",
    "name": "Tobias",
    "age": 10,
    "gender": "male",
    "disease": "brain tumor",
    "raised": 4665,
    "goal": 30000,
    "url": "https://www.gofundme.com/f/vrbcp-medical-bill-assistance",
    "title": "Medical bills for a great kid",
    "description": "\n\n\n\nHi all and thank you for looking. Just recently my brother in laws kid had to go in for emergency brain surgery as they found a tumor on the back of his brain. He just came out and the surgery went well so they say but have to wait for additional tests of the tumor they removed. This was very unexpected and am positive that my sister in laws insurance won’t hardly cover anything and they are already stressing with the situation. They are a great family and our nephew Tobias is a great kid. Anything will help as I am starting this go fund me to get a jump start on the upcoming medical bills from this surgery. I know it may be more than the goal I have set. Or probably even more but it’s a start this way when they get that bill they can breathe a little bit. Thank you for listening. Funds will be used for the expected medical bills from the surgery and rehabilitation. Tobias is currently at Logan Health children’s ward in Kalispell Montana.\n",
    "creationDate": "2024-03-02",
    "images": [
      "78650461_1709399487934088_r.jpeg",
      "78650461_1733759722844138_r.jpeg",
      "78650461_1733759755439885_r.jpeg",
      "78650461_1733759857184838_r.jpeg",
      "78650461_1713193016752818_r.jpeg",
      "78650461_1713193051910372_r.jpeg",
      "78650461_171219034822311_r.jpeg",
      "78650461_1712190420310624_r.jpeg",
      "78650461_1711416182403312_r.jpeg",
      "78650461_1711416209889724_r.jpeg",
      "78650461_1711416243733708_r.jpeg",
      "78650461_1710906615143427_r.jpeg",
      "78650461_1710906728824292_r.jpeg",
      "78650461_1710906760732692_r.jpeg",
      "78650461_1710547657438216_r.jpeg",
      "78650461_1710547726134251_r.jpeg",
      "78650461_1710384503682224_r.jpeg",
      "78650461_1709857602600057_r.jpeg",
      "78650461_1709840117282397_r.jpeg",
      "78650461_1709840177628459_r.jpeg",
      "78650461_1709687196491953_r.jpeg",
      "78650461_1709436341523621_r.jpeg",
      "78650461_1709436308907358_r.jpeg"
    ],
    "numDonationsStr": "49 donations"
  },
  "d6fcgz-stop-gun-violence": {
    "slug": "d6fcgz-stop-gun-violence",
    "name": "MeMe and Kay'Vion",
    "age": 5,
    "gender": "N/A",
    "disease": "gunshot wounds",
    "raised": 7085,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/d6fcgz-stop-gun-violence",
    "title": "Need Help Moving & Medical Expenses for my 3 & 6 yr. old",
    "description": "I'm a tenant that lives in the apartments that was shot up (MiraMar) in Fort Worth last night off Las Vegas Trail and the West side of For Worth. My youngest (3 yr old) is still trying to pull through her injuries as she is putting up a big fight. She had her right kidney removed and the doctors are working diligently to get and keep her stable.\n\nHer 6 year old brother was shot in the femur, where he is recovering well after his surgery. It will take a lot of physical therapy and a plate in his leg for at least one year for his recovery. The mental impact all of the children witnessed and suffered through the fear of losing their lives is something I could never imagine any child or human to ever have to experience. Thank you to the community family friends and loved ones for your continues prayers and support! It's time to acknowledge that gun violence should never be an option.\n\nMay God bless each and everyone of you and those who have been supporting and have supported, it's greatly appreciated.\n",
    "creationDate": "2024-05-02",
    "images": [
      "79869479_1715270857201584_r.jpeg",
      "79869479_1714651806114236_r.jpeg",
      "79869479_1715270868482976_r.jpeg",
      "79869479_1715270884620973_r.jpeg",
      "79869479_171517840627248_r.jpeg",
      "79869479_1715178421933278_r.jpeg",
      "79869479_1715084551562269_r.jpeg"
    ],
    "numDonationsStr": "73 donations"
  },
  "help-4months-baby-girl-need-a-heart-surgery": {
    "slug": "help-4months-baby-girl-need-a-heart-surgery",
    "name": "Anonymous",
    "age": 0,
    "gender": "female",
    "disease": "Ventricular Septal Defect, needs heart surgery",
    "raised": 5319,
    "goal": 200000,
    "url": "https://www.gofundme.com/f/help-4months-baby-girl-need-a-heart-surgery",
    "title": "Help my 4 months old Baby Girl, in need of a Heart Surgery",
    "description": "\n\nHelp Me Save My Baby Girl’s Heart ❤️\n\n\n\nMy name is Ikram, and I’m a first-time mom to a beautiful 4-month-old baby girl. What was supposed to be the happiest time of my life has turned into the most terrifying.\n\n\n\nSoon after she was born, doctors discovered a murmur in her tiny heart. At just one month old, we were told she has a Ventricular Septal Defect (VSD)—two holes in her heart. We hoped and prayed they would close on their own, but one of the holes has now grown to 7mm. Her doctors have confirmed that she will need open-heart surgery.\n\n\n\nHer little heart is growing too large from the constant strain. Every day, I watch her fight to stay strong. As a mother, it’s the most helpless feeling in the world. I should be enjoying the joys of being a first-time mom—celebrating her first smiles, her first giggles. Instead, I’m living in fear.\n\n\n\nJust this month, I heard of two babies with the same condition who sadly didn’t make it. My heart breaks for them, and I live every day afraid I might lose my baby too. I’m not ready to lose her. I can’t.\n\n\n\nWe are asking for your help—no matter how small—so we can afford her surgery, her medical care, and everything she needs to survive this. The costs are overwhelming, and we can’t do this alone.\n\n\n\nIf you can donate, please know that every dollar brings us closer to saving her life. And if you can’t donate, please share her story. Every share could reach someone who can.\n\n\n\nPlease help us give her the chance to grow up, to live a full life, to simply be a child. From the bottom of my heart, thank you for your kindness, your generosity, and your prayers.\n\n\n\nWith love and hope,\n\nIkram\n",
    "creationDate": "2025-05-28",
    "images": [
      "91438091_1749590209178659_r.jpeg",
      "91438091_1750533574804155_r.jpg",
      "91438091_1748471364253603_r.jpeg",
      "91438091_1749576807206460_r.jpeg",
      "91438091_1750103858920338_r.jpeg",
      "91438091_174847130421039_r.jpeg",
      "91438091_1749681624428165_r.jpeg"
    ],
    "numDonationsStr": "180 donations"
  },
  "the-beans-medical-bills": {
    "slug": "the-beans-medical-bills",
    "name": "Ellie and Merrick",
    "age": 1,
    "gender": "N/A",
    "disease": "intrauterine growth restriction (IUGR) and prematurity with complications requiring open heart surgery",
    "raised": 1635,
    "goal": 15000,
    "url": "https://www.gofundme.com/f/the-beans-medical-bills",
    "title": "The Beans' medical bills",
    "description": "Hello everyone! As you all know Ellie and Merrick were born at 31 weeks due to severe IUGR (intrauterine growth restriction) and me having pre eclampsia. Ellie weighed 2lbs 6oz and Merrick weighed 1lb 11oz. Because of their low birth weight they had to stay in the NICU for an extended period. Not to mention that Merrick had a really rough time gaining weight for his open heart surgery, which extended his time in. Merrick also has had to have 2 other hospital stays due to health issues and possibly another in the future. Our insurance has been great in covering most of the babies needs. Unfortunately after a hefty combined bill of 1.60m, we are left with a 15,000 bill. It hurts to have to write this and ask of you guys..but any amount donation is appreciated immensely. Thank you and we love you all.",
    "creationDate": "2021-02-13",
    "images": [
      "54613050_1613271858330727_r.jpg"
    ],
    "numDonationsStr": "19 donations"
  },
  "help-cover-warrens-medical-bills": {
    "slug": "help-cover-warrens-medical-bills",
    "name": "Warren",
    "age": 2,
    "gender": "male",
    "disease": "Acute hypoxic respiratory failure, probable asthma",
    "raised": 9835,
    "goal": 12000,
    "url": "https://www.gofundme.com/f/help-cover-warrens-medical-bills",
    "title": "Help cover Warren's medical bills",
    "description": "On June 15, our two-year-old grandson Warren was hospitalized in Grand Rapids, MN, because he was having difficulty breathing. He was transferred to the local ER and then whisked away by ambulance to St Mary's Children's Hospital in Duluth as his condition was not improving. \"Acute hypoxic respiratory failure\" is what they called it, and it was scary for us and for his parents, and terrifying for Warren.\n\n\n\n\n\nAfter receiving a few days of excellent care in the PICU at St. Mary's, Warren's health stabilized enough to be released. Asthma was the probable cause, but a formal diagnosis is not typically given for such a young patient. Even without the diagnosis, the condition is treatable with daily use of a flovent inhaler, and periodic emergency use of an albuterol inhaler.\n\n\n\nFast forward about a month when Warren went into surgery for some complicated dental work. That procedure was cut short when the anesthesiologist informed the surgeon that Warren's oxygen levels were dropping dangerously low. She said this was only the second time in 4 years that she had to stop a procedure for oxygen levels that low. The dental procedure still needs to be done, so there is a subsequent surgery scheduled during which Warren will be intubated.\n\n\n\nAll of this has resulted in some exorbitant medical expenses. Warren has some medical insurance coverage, but his plan has an $8700 deductible. And much of the costs associated with the dental work aren’t covered at all. This leaves Mom and Dad with bills in the multiple thousands of dollars, plus the costs of his medications. There are additional unknown costs yet to come, as they seek referrals to allergists and other specialists in order to dig deeper and figure out what exactly is going wrong with his lungs and why his body isn't getting the oxygen it needs.\n\n\n\nCan you please help Hannah and Mark pay for the medical care for their son (our grandson) Warren?\n\n\n\n\n",
    "creationDate": "2022-08-18",
    "images": [
      "67491553_1660848551434823_r.png",
      "67491553_166146120720234_r.jpeg",
      "67491553_166118325793921_r.jpeg",
      "67491553_1661183292302409_r.jpeg",
      "67491553_1660849946174368_r.",
      "67491553_1660849399582234_r."
    ],
    "numDonationsStr": "68 donations"
  },
  "baby-violets-medical-support": {
    "slug": "baby-violets-medical-support",
    "name": "Violet",
    "age": 0,
    "gender": "female",
    "disease": "Cavernous Hemangiomas and Hemangiomatosis with suspected vascular abnormality on forehead",
    "raised": 4650,
    "goal": 7000,
    "url": "https://www.gofundme.com/f/baby-violets-medical-support",
    "title": "Baby Violet’s Medical Support",
    "description": "When she was first born right off the bat I noticed something different about her forehead. I noticed something different about the light little pink marks on her body. My concerns were shoved away and we were told they were nothing to worry about. Mother’s intuition would not stopping chiming in. I felt deep down there is something more to this. There is something more to all of this. I wanted answers. Legit answers. I wanted to be heard. The first round of doctors all told me “Oh these are just birth marks. They will grow some and then go away.” Well not only did the one she was born with grew some but multiple began to pop on my 1 month old baby’s body. At this point I was tired of everyone not only doctors saying it was nothing. It seemed like anyone who felt they had a medical background wanted to chime in and tell me how it’s not serious and to drop it. Well I didn’t. I pushed for those answers as I saw these growths only getting worse. We finally got to a doctor who was willing to do a scope and see if there was anything internally going on. And guess what?! Sure enough there they were these “birth marks” growing inside my baby’s air ways and throat. At that point we got sent to Utah to actually be seen by doctors who specialize in rare cases and most importantly in children and babies. Come to find out these “birthmarks” that I should just let go and forget about are actually considered begin tumors. Yup tumors! They are vascular abnormalities and growths. There are multiple kinds of treatment for them. Including radiation. These are serious. These are not something to just let go and be. They can become internally invasive and cause serious harm. She was originally put on Propranolol to slow her heart rate and slow the blood flow which would hopefully stop the growths. She began to have adverse effects and was taken off the medication due to heart risks. During that appointment I decided to bring up her forehead shape to her doctor in Utah. Since that specific specialist does not deal with craniotomy she said to first speak with our pediatrician and go from there. After speaking with the pediatrician he also agreed something was off and a bit abnormal with Violets head shape. The pediatrician then sent us to a neurologist. The neurologist felt it was Craniosynostosis and wanted us to be seen by another doctor that same day. We were then seen by 2 more doctors. A craniosynostosis doctor and neurologist who team up on surgeries together. They both felt it was mild craniosynostosis and wanted a CT to confirm and determine if surgery was needed or if monitoring was needed. Something just didn’t feel right to me. I just didn’t trust them in all honesty. I also did not want to have to put my 7 month old baby through radiation from a CT unless absolutely needed. So I reached out to her already established doctor in Utah and she magically got us in with one of the best pediatric craniosynostosis and neurologist doctors at the Primary Children’s Hospital in Utah. Once we were seen by the craniosynostosis doctor and his medical consultant right off the bat with no hesitation they looked at each other and said “Violet does not need a CT she needs an MRI. This is not craniosynostosis but we feel there is clearly build of something under the skin of her forehead and hopefully just the exterior of her skull.” They do not feel it’s fluid because it dense but not dense enough for it to be bone. They believe it’s a vascular abnormality as it is safe to assume with her already diagnosed condition. Which means a large growth/tumor on her head. This can be minor or very serious. It could be just on the exterior of her skull or it could be coming from her brain. All these things we do not know until an MRI is done. They have worked on rare cases like these and also have another surgeon they will be bringing on board if it’s vascular who specializes in pediatric vascular neurosurgery. At the moment we have to pray and stay positive as hard as possible that it is indeed superficial and it’s not in her brain. If I did not pursue these “birthmarks” our baby could be having serious complications by now since these things would of most likely popped up every where and grown even in the most vital places like her brain. The need for awareness on Cavernous Hemangiomas and Hemangiomatosis is needed. Just because you have a baby or know someone who had a baby who had one or two hemangiomas does not mean that there are not more serious complications with these. Here’s to Violet! We are positive her MRI will be  fine and the results will be even better. She has to be put under anesthesia to get the MRI done and the team of doctors will be reviewing the MRI immediately and then having a meeting with us. Her scanning will be done November 26, 2019. We have been going to Utah every 4 to 8 weeks within the past 7 months. Paying for hotels, food, travel, etc. The medical bills are piling high. Due to the amount of travel, hotels, and medical bills we will be creating a GOFUNDME. As many of you know I am a hard working full time woman plus mom of our baby Violet and her 4 year old brother Oliver. Dad is also a full time hard working man and father but we can only do so much. Anything you can help to provide for our family is so appreciated. I do not ask for anything. I HATE asking for anything. I have been digging my heals in so hard to not have to ask for help from my community and friends but I need to let my pride go and just accept any help our family can be given.Once we get a solid result from the MRI on November 26, 2019 we will update further. If surgery is indeed needed we will need to raise our current goal funds to help with the surgery and whatever it may entail. I will post as many pictures of our daughter’s condition as possible and will possibly be able show the MRI scan once I get copies. We are being seen by a pediatric cardiologist, pediatric dermatologist, pediatric craniologist, pediatric neurologist, pediatrician, and soon a vascular neurologist as well as a geneticist.From the bottom of my family’s heart we appreciate your time for reading our daughters story and considering helping us get through this. Warmly,Makena (Mom) / Dallas (Dad) / Baby Violet / Oliver (Older Brother)",
    "creationDate": "2019-10-26",
    "images": [
      "42962102_1572085619234518_r.jpeg",
      "42962102_1574708296192291_r.jpg",
      "42962102_1573948865804986_r.jpg",
      "42962102_1573948866278212_r.jpg",
      "42962102_1573948866266826_r.jpg",
      "42962102_1573536249794997_r.jpg",
      "42962102_1573536250697718_r.jpg",
      "42962102_1572658734160777_r.jpg",
      "42962102_157230710068945_r.jpg",
      "42962102_1572196681329811_r.jpeg",
      "42962102_1572195724528406_r.jpeg",
      "42962102_157219727236756_r.jpeg",
      "42962102_1572197297786517_r.jpeg",
      "42962102_1572197320776274_r.jpeg",
      "42962102_1572197545533326_r.jpeg",
      "42962102_1572197701929036_r.jpeg"
    ],
    "numDonationsStr": "42 donations"
  },
  "teamatticus": {
    "slug": "teamatticus",
    "name": "Atticus",
    "age": 3,
    "gender": "male",
    "disease": "refractory epilepsy",
    "raised": 1970,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/teamatticus",
    "title": "Help Atticus With Medical Expenses!",
    "description": "I started this campaign for my freinds, please take the time to read and share.Atticus is a strong little boy who has perservered through life altering diffculties. With such a strong name who would hvae tought refractory epilepsy would be what tears this little boy apart? Suffering from sub-clinical seizures 24/7, this sleep deprived angel fights hard everyday through these heart wrenching seizures thats are clustered up to 30 tonic seizures within a 5 minute time frame. People who have seen a child seize understand that every second seems like minutes and every minute feels like hours. It's been a year and a half since Atticus has had seizure control, That's 548 days, 13,152 hours, 10,960 seizures and counting. There has been 9 failed meds, and Atticus is inoperable as he has no focal point or origin for the seizures. He has lost the ability to walk, eat and even understand the simplest directions or instructions. Atticus is confined to a pediatric wheel chair, fed directly into his stomach by a G-Tube and functions at a early age of infancy (Atticus is 3). I started this campaign for my friends and their little boy to try and raise money for him and them. Melissa (his mother) hasn't worked since Atticus was born. Terence (Atticus' father) works, but his income alone is not enough. Financially they aren't in the best situation. Most of his medical equiptment is covered by the government, but a lot of his meds aren't, not to mention his CBD, which is $500 per month all on it's own. This little boys expenses never end, and as he gets older, his needs get more expensive.We appreicate any donation that you make to help these wonderful people give their son the life he deserves.Much Love,Team Atticus",
    "creationDate": "2015-03-23",
    "images": [
      "3842431_1427223195.1538.jpg",
      "3842431_1427227380.5408_updates.jpg"
    ],
    "numDonationsStr": "36 donations"
  },
  "helpforeli": {
    "slug": "helpforeli",
    "name": "Eli",
    "age": 4,
    "gender": "male",
    "disease": "eosinophilic esophagitis",
    "raised": 2580,
    "goal": 30000,
    "url": "https://www.gofundme.com/f/helpforeli",
    "title": "Help with Eli's Medical Expenses",
    "description": "Eli is an energetic, compassionate  and loving 4 year old boy who loves life and  his 2 year old sister Alyssa, but Eli has an extensive medical history. We both work full time jobs as a PE teacher/ Varsity womens school basketball coach and as a builder,  but we are just getting by monthly trying to take care of Eli and we are in debt in medical expenses that are continuing to pile up from our little boy's health issues. The money that we raise will pay the $30,000+ medical bills that are currently owed for Eli's treatments.  ....here's Eli's story: Eli's medical journal began on the day he was born... August 31, 2011, our baby boy was born with shoulder distotia which caused a broken collar bone.  At 6 weeks old he quit breathing and we found ourselves in the hospital again. Eli was aspirating milk into his lungs causing him to not be able to breathe. A few weeks later Eli was hospitalized with bilateral RSV and pneumonia. Eli has had pneumonia 10 times since he was born being hospitalized many times. The doctors at MUSC said he was aspirating fluid into his lungs causing the pneumonias.  Eli was vomiting very often and began not eating because he associated eating with vomiting. At 2 years old he was diagnosed with eosenophylia esophogitus also know at EOE. Eosinophilic is a recently recognized allergic/immune condition. A person with EoE will have inflammation or swelling of the esophagus, causing food refusal, abdominal pain and trouble swallowing. This is a chronic condition.The first step to treatment was many allergy tests, scopes, food studies ect. They first action they chose was food elimination. After 6 months they scoped Him again and realized it wasn't working so they eliminated more foods and started him on steroids and reflux medication.  Eli couldnt keep food down and started to loose weight and energy, so by the end of March 2015 we were told that Eli needed a feeding tube to help heal his condition which he received on June 8.  We were told he would have the g-tube 6 months to a year. Eli then started with elemental formula which is $60 a can. He has to have a can a day and insurance won't cover the formula. He was also still on steroids and the reflux medicines. On November 24th Eli had digressed and was worse than when he first received his feeding tube. This is where we are today: Eli has his most recent scope last week. His results were good and they are starting to introduce food again slowly. This time his body has beat the eosenophyls without any medication. So he will have another scope every month from here on out. If there is another negative scope, the doctors at MUSC do not have anymore treatment plans to offer Eli and will be referring us to Cincinnati OH. We pray everyday that Eli's esophogus heals and he can be a normal 4 year old little boy.  We would be so grateful for any donation that can be made on Eli's behalf, no matter how big or small to help our family with this medical financial burden.",
    "creationDate": "2016-02-21",
    "images": [
      "9147609_1456199468.8221.jpg"
    ],
    "numDonationsStr": "27 donations"
  },
  "babyjameus": {
    "slug": "babyjameus",
    "name": "Jameus",
    "age": 0,
    "gender": "male",
    "disease": "Hirschsprung's disease",
    "raised": 11036,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/babyjameus",
    "title": "Medical expenses for baby Jameus",
    "description": "My son, Jameus, was born with Hirschsprung's disease. It's a rare disease that affects the intenstines. Babies who are born with HD lack the nerves necessary to produce a bowel movement. Jameus started throwing up lime green bile when he was two days old. He was immediately flown over two hours away  to MUSC Childrens hospital, where he remained in the NICU for almost 3 months. Jameus had his first surgery at two weeks old.  He suffered a terrible infection as a result of the surgery and the infection caused his bowels to perforate and all his stool leaked through his body cavity.He went into septic shock, and had to be put on life support. He was also given a colostomy bag at that point. At this point in his short life, Jameus has had  20 surgeries and procedures. We do daily home dilation treatments as well, where an 8 inch metal rod has to be inserted into his rectum, and also down through his stoma. These treatments are terribly painful for Jameus.There is no end in sight for this cycle of surgery and treatment. The current surgeons are giving us no options that will result in a better quality of life for Jameus.We have switched surgeons, and the new surgeon is a specialist for his disease. She has given us hope we did not have before, however she is based out of Denver, Colorado. We are in South Carolina. Traveling back and forth will be extremely expensive. As a single mom, I am supporting myself, Jameus, and paying for all the current treatment Jameus needs. This does not leave room to save for the trips to Denver. Even when I can save up some money for the trip, Jameus ends up needing another surgery or treatment.  My little boy deserves to start living his life without constant sickness, infection and surgeries. It will only be through the generosity of others that he can have a chance at a better quality of life.\"You have not lived today until you have done something for someone who can never repay you.\"- John Bunyan\"No one is useless in this world who lightens the burdens of another.\"- Charles Dickens\"No one ever became poor from giving.\"- Anne FrankPlaying at the hosptial atrium.He is the happiest, sweetest baby when he is feeling well.",
    "creationDate": "2015-04-11",
    "images": [
      "4133657_1456800122.7716.jpg",
      "4133657_1445797790.1578_updates.jpg",
      "4133657_1435803059.3139_funddescription.png",
      "4133657_1435804742.4248_funddescription.png",
      "4133657_1429279824.7068_funddescription.jpg",
      "4133657_1429279850.4673_funddescription.jpg",
      "4133657_1429281440.3228_funddescription.png",
      "4133657_1429279901.2977_funddescription.jpg",
      "4133657_1429279925.4312_funddescription.jpg",
      "4133657_1429279948.895_funddescription.jpg",
      "4133657_1429279969.684_funddescription.jpg",
      "4133657_1429280579.8189_funddescription.jpg",
      "4133657_1431353382.8929_funddescription.jpg",
      "4133657_1431353402.7675_funddescription.jpg",
      "4133657_1431353436.7701_funddescription.jpg",
      "4133657_1431353449.2296_funddescription.jpg",
      "4133657_1431353458.783_funddescription.jpg",
      "4133657_1443621033.5442_funddescription.jpg",
      "4133657_1431353466.4723_funddescription.jpg"
    ],
    "numDonationsStr": "343 donations"
  },
  "baby-larkens-medical-fund": {
    "slug": "baby-larkens-medical-fund",
    "name": "Larken James Nelson",
    "age": 0,
    "gender": "male",
    "disease": "hydrocephalus caused by a cyst in his brain",
    "raised": 4965,
    "goal": 10000,
    "url": "https://www.gofundme.com/f/baby-larkens-medical-fund",
    "title": "Baby Larken's Medical Fund",
    "description": "Hello world, my name is Max Lee, and I'd like you to meet the bravest little boy I know. This is my nephew, Mr. Larken James Nelson...\nDespite being born 2 months early, he has become a happy and handsome little boy. Stealing the collective hearts of our family and friends. I am honored to be his uncle. Larken’s parents received devastating news. He was diagnosed with hydrocephalus caused by a cyst in his brain. A condition which the fluid build-up in his head causes headaches and enlarged head. He is going in for surgery tomorrow to address this problem.Nicole and Jacob (mom and dad) wish to extend their deepest gratitude to family, friends, colleagues, and employers for all of the amazing help, support, and encouragement during the past difficult weeks.As with all surgeries, the operation will not be cheap. The hydrocephalus operation according to nih.gov, will easily exceed $10k-$30k + ongoing care, and possible revisional surgeries. We are opening this go-fund me page to assist with high insurance deductibles, mounting medical bills including this surgery and Larken’s premature birth, and time-off/travel costs that can be anticipated over the coming months.  I am asking for any amount of donation for this amazing family, however little it may be, $5, $10, will help tremendously and greatly appreciated.Please help the bravest little boy I know, and help his family get through this medical nightmare.",
    "creationDate": "2016-11-15",
    "images": [
      "16054987_1479241841.8468.jpg",
      "16054987_14917443630_updates.jpg",
      "16054987_14913997170_updates.jpg",
      "16054987_14912778230_updates.jpg",
      "16054987_14897694730_updates.jpg",
      "16054987_14888579060_updates.jpg",
      "16054987_14888580690_updates.jpg",
      "16054987_14813118220_updates.jpg",
      "16054987_14813118670_updates.jpg",
      "16054987_14807831610_updates.jpg",
      "16054987_14807351600_updates.jpg",
      "16054987_14795072220_updates.jpg",
      "16054987_14794928520_updates.jpg",
      "16054987_14794399920_updates.jpg",
      "16054987_14793947200_updates.jpg",
      "16054987_14793513510_updates.jpg",
      "16054987_1479243426.0334_funddescription.jpg",
      "16054987_1479243233.1456_funddescription.jpg"
    ],
    "numDonationsStr": "84 donations"
  },
  "2g7uzz8k": {
    "slug": "2g7uzz8k",
    "name": "Lillian",
    "age": 4,
    "gender": "female",
    "disease": "mitochondrial disease",
    "raised": 4850,
    "goal": 30000,
    "url": "https://www.gofundme.com/f/2g7uzz8k",
    "title": "Medical expenses for Lillian",
    "description": "Lillian is an amazing 4.5 year old little girl that has a very rare mitochondrial disease. It is a genetic disease that she has had since birth, and there is no cure or treatment. It saddens me to explain that it is a terminal disease, and has slowly become more and more difficult to really give her the care she needs.  She needs constant care, lots of medical equipment, medicines and nursing care.   At 4.5 years old she is a really big girl, weighing close to 60 lbs and is about 3.5 feet tall.  Our nurses aren't really allowed to lift anyone over 50lbs, and it has gotten pretty impossible for Theresa, or myself, to lift her in and out of a bath tub.  So, we have one of two choices, renovate our home to add another bath room with walk in shower, or move. To renovate our home would make the air quality questionable for Lillian, because she has a trach and ventilator to help her breath.   Either way, to make the renovations to our current home or another home it is going to cost $30-60,000 dollars.  Anyone that knows us know we hate to ask for help, but with all the other expensises, and the handicap Van we had to get this year also, we have come to the point where we need to do whatever we can for Lillian.  We love all of you, and are grateful for even your prayers. Thank you so much and just know Lillian and our family love you all!!",
    "creationDate": "2016-07-24",
    "images": [
      "13200181_1469472861.5574.jpg",
      "13200181_1473771137.9864_updates.jpg",
      "13200181_1470882028.9204_updates.jpg",
      "13200181_1470143293.8739_updates.jpg",
      "13200181_1469634941.9859_updates.jpg",
      "13200181_1469546740.435_updates.jpg",
      "13200181_1469461850.9967_updates.jpg",
      "13200181_1469403711.83_funddescription.jpg",
      "13200181_1469403752.8494_funddescription.jpg"
    ],
    "numDonationsStr": "59 donations"
  },
  "ScarlettMcAlpine": {
    "slug": "ScarlettMcAlpine",
    "name": "Scarlett Rose McAlpine",
    "age": 0,
    "gender": "female",
    "disease": "Spinal Muscular Atrophy (SMA) Type 1",
    "raised": 8898,
    "goal": 20000,
    "url": "https://www.gofundme.com/f/ScarlettMcAlpine",
    "title": "Hugs for Scarlett against SMA",
    "description": "Scarlett giving a big smile as she plays with mommy!Hello everyone,Scarlett Rose McAlpine was born on September 3, 2015.  She was the healthiest and happiest baby you could imagine!  There are very few times you could ever find her without a smile ear to ear!On February 18 we were rushed to the University of Iowa Hospital's emergency room via ambulance because Miss Scarlett was struggling to breathe and her oxygen was at a dangerous level.  She had contracted RSV (Respiratory Syncytial Virus Infection), which is a respiratory virus that is very serious for little ones.While being treated for RSV in the hospital the doctors here had noticed that Scarlett didn't put any weight on her lower extremities and seemed very \"floppy.\"  They were concerned there may be some underlying condition which was also making it harder for her to recover.  After various tests we received results that would change our lives forever, Scarlett Rose McAlpine was diagnosed with SMA (Spinal Muscular Atrophy) type 1 on February 25, 2016.---------- Information About SMA ---------SMA is a progressive genetic disorder that causes the motor nerve cells in the spinal cord to be weak, resulting in the inability to walk, eat, talk, sit up, breathe, and do many other physical abilities.  SMA is a recessive genetic disorder that is passed on by both parents.  There is a 25% chance in each pregnancy that the child will have this disorder if both parents are carriers (we are both carriers unfortunately).  SMA is the number one genetic cause of death in infants.SMA is diagnosed with different levels and within each level there is a wide spectrum of severity.  Type 1 is the most common and the most severe type.  This type is diagnosed before the infant is 6 months of age.  Some reports say that 80% of SMA type 1 infants don't live past their first birthday!  However this is not set in stone as the disorder affects each baby differently.  As medical science advances the infants lifespan can be increased.  With the proper care and maintenance many families are seeing their children thrive and live for years!---------- Why We Are Asking For Your Help ----------We are asking for your donations to help Scarlett battle this disorder and give her the best life we possibly can!  Your donations will go directly to help pay for medical expenses, equipment, awareness, and education to help Scarlett and other SMA children.Medical expenses are a huge concern with families that have an SMA child.  SMA causes a basic respiratory virus to be much more serious and even fatal, due to the weak breathing muscles.  This often requires emergency room visits and hospital/ICU stays.There is a lot of special equipment that Scarlett will need due to her lack of motor skills.  These involve medical equipment at home to assist her breathing, strollers/car seats to help position her, feeding equipment when she is no longer able to swallow, and more.As loving parents of a daughter with SMA, we want to do as much as we possibly can to help her thrive.  One way we can help Scarlett fight is physical therapy and speech therapy.  With these programs SMA children are able to do remarkable things that were once said to be out of their reach, like talking.  Some SMA children are actually hitting standard infant milestones!We want to become as involved in SMA awareness as we possibly can, even when Scarlett is no longer with us.  We want to help anyone else that gets put in the situation that we are in!  Any extra money raised that we don't need for Scarlett will be used to help spread awareness and support for SMA families.Your help means the world to us because you are helping us spend more precious time with our daughter!  Thank you so much for taking the time to read Scarlett's story and helping her fight this disorder!Even as she sits in the University of Iowa Hospital's PICU hooked up to machines she will not stop fighting and smiling, and neither will we!Scarlett rocking her winter outfit, less than a week before being admitted to the hospital!",
    "creationDate": "2016-03-05",
    "images": [
      "9702309_1457226885.5925.jpg",
      "9702309_1477062543.7971_updates.png",
      "9702309_1476819867.1993_updates.jpg",
      "9702309_1476820590.6748_updates.jpg",
      "9702309_1476820673.1969_updates.jpg",
      "9702309_1459522951.8391_updates.jpg",
      "9702309_1459523496.902_updates.jpg",
      "9702309_1457993102.7864_updates.jpg",
      "9702309_1457232229.1484_funddescription.jpg",
      "9702309_1457232484.8894_funddescription.jpg"
    ],
    "numDonationsStr": "119 donations"
  }
}